{"pages":[{"url":"http://chunshan.github.io/MRI-QA/dsc/meaning_of_cbf_mtt_etc.html","text":"原文链接: How are parameters like BF, BV, and MTT defined and used in perfusion imaging? 概要 最简单的局部循环模型包含一个动脉输入，一个组织毛细血管床和一个静脉输出。这个模型有悠久的历史，最早被19世纪的Fick用来研究心脏输出。20世纪40年代，Kety和Schmidt修改了此模型以用于指示剂稀释测定血流量技术中，20世纪50年代，Meier和Zierler进一步扩展了此模型。 局部循环的简单模型有一个动脉输入和一个静脉输出，并且假设血流量（BF）和血容量（BV）是恒定的 假设通过系统的血流量和组织中的血容量都是恒定的。BF和BV通常会与灌注组织的绝对质量相除而进行归一化，其单位分别为mL/min/100g和mL/100g。此模型还假设没有血液滞积，也没有失血，所以流入的血液会最终全部流出。 穿过组织的血管通路有些相对直接而有些则有很多分叉，这意味着不同的红细胞分子或对比剂分子穿过毛细血管床的时间会很不相同（尽管最终所有分子都会从静脉流出）。平均通过时间（MTT，用秒或分钟度量）反映了注射的示踪剂随血液流动驻留在组织中的平均时间。 血流量BF，血容量BV以及平均通过时间MTT通过中心容积定律（central volume theorem）相联系，如果两个已知，第三个就可以计算出来。它们之间的关系如下：BF = BV / MTT. 考虑一下上文提到的血流量和血容量的单位，这个关系很容易记，血流量就表示单位时间内的血容量。 在灌注成像研究中，BF，BV和MTT计算出来后一般用施加伪彩的参数图显示，这些参数图提供了互补的灌注相关信息，对做出临床决策很有帮助。 T2加权像，显示胼胝体上的脑肿瘤 显著升高的BV，高度恶性的成胶质细胞瘤 例如脑梗死区域一般显示为BV和BF减小，而MTT上升。相反地，没有梗死的局部缺血区域（缺血半暗带）一般BF减小，MTT上升，而BV正常。 接受治疗的脑肿瘤对比剂增强的T1加权像，显示肿瘤变大 减少的BV预示更可能是肿瘤放射性坏死而不是肿瘤进化 如何从图像数据中计算这些量化的灌注参数图的细节将会在后面的几个Q&A中给出。 参考材料 Fick A. Ueber die Messung des Blutquantums in der Herzventrikeln . Sitz der Physik-Med Ges Wurzburg 1870; 2:16–28. (Classic paper where the \"Fick Principle\" is formulated\"). Kety SS, Schmidt CF. The determination of cerebral blood flow in man by the use of nitrous oxide in low concentrations . Am J Physiol 1945; 143:53–66. (classic paper; worth a look) Meier P, Zierler KL. On the theory of the indicator-dilution method for measurement of blood flow and volume . J Appl Physiol 1954; 6:731-744. (Lays out proof for the central volume theorem and derivation of mean transit time). Zaharchuk G. Theoretical basis of hemodynamic MR imaging techniques to measure cerebral blood volume, cerebral blood flow, and permeability . AJNR Am J Neuroradiol 2007; 28:1850-8. 相关问题 How is the arterial input function used to extract more quantitative flow information from the DSC data? Question-灌注方法：灌注（Perfusion）如何定义和测量?","tags":"DSC","title":"Question-灌注参数：血流量（BF，Blood Flow），血容量（BV，Blood Volume），平均通过时间（MTT， Mean Transit Time）等参数是怎么定义的？在灌注成像中如何使用？"},{"url":"http://chunshan.github.io/MRI-QA/dsc/measuring_perfusion.html","text":"原文链接: How is perfusion defined and measured? 概要 灌注是指通过一个器官或组织的毛细血管循环的血流量。考虑到器官的大小不同，灌注的量化通常需要归一化，血流量（mL/min）除以器官质量（每100g），所以灌注的单位一般被表示为mL/min/100g。 脑的动脉自旋标记的灌注参数图，有血管性脑胶质瘤 不同的器官灌注情况不同，而且对同一器官，灌注也会随着其病理改变或代谢需要而改变。例如，脑灰质和白质灌注分别约60和20mL/min/100g。心肌灌注则大得多，休息时约100mL/min/100g，最大运动时可达400mL/min/100g。 灌注的测量需要使用示踪剂（分子，分子聚集体或小颗粒），示踪剂与血流充分混合，分布在组织中并且可以被检测。一些示踪剂会留在血管内，其他的示踪剂则分布更加广泛。示踪剂可分为： 血管内示踪剂，限制在血管中。用于MR的血管内示踪剂包括钆膦维司（Ablavar，与血清白蛋白结合）和超小超顺磁性铁氧化合物分子（USPIO）。 细胞外示踪剂，不进入细胞，但可自由地通过血管壁，分布在组织的细胞外空间。大多数钆基造影剂属于此类。 可扩散示踪剂，分布在组织所有部位，包括细胞内。通常用于MRI的可扩散示踪剂是磁标记的水分子，用于动脉自旋标记（ASL，arterial spin labelling ）。 参考材料 Cuenod CA, Balvay D. Perfusion and vascular permeability: basic concepts and measurement in DCE-CT and DCE-MRI . Diagn Interven Imaging 2013; 94:1187-1204. (Good review of basic mechanisms; some terminology is slightly different than abbreviations used in Tofts models). Frackowiak RSJ, Lenzi G-L, Jones T, Heather JD. Quantitative measurement of regional cerebral blood flow and oxygen metabolism in man using 15O and positron emission tomography: theory, procedure, and normal values . J Comput Assist Tomogr 1980; 4:727-736. Ito H, Inoue K, Goto R, et al. Database of normal human cerebral blood flow measured by SPECT: I. Comparison between I-123-IMP, Tc-99m-HMPAO, and Tc-99m-ECD as referred with O-15 labeled water PET and voxel-based morphometry . Ann Nucl Med 2006; 20:131-138. Prinzen FW, Bassingthwaighte JB. Blood flow distributions by microsphere deposition methods . Cardiovasc Res 2000; 45:13-21. Salerno M, Beller GA. Noninvasive assessment of myocardial perfusion . Circ Cardiovasc Imaigng 2009; 2:412-424. (comparison of different imaging methods for myocardial perfusion measurement) Zhang K, Herzog H, Mauler J, et al. Comparison of cerebral blood flow acquired by simultaneous [15O]water positron emission tomography and arterial spin labeling magnetic resonance imaging . J Cerebr Blood Flow Metab 2014; 34:1373-1380. 相关问题 Can myocardial perfusion be accurately quantified? What are the differences between DSC, DCE and ASL perfusion methods used in MRI?","tags":"DSC","title":"Question-灌注方法：灌注（Perfusion）如何定义和测量？"},{"url":"http://chunshan.github.io/MRI-QA/misc/welcome_to_mri_questions_answers_chinese_version.html","text":"首先声明这个网站的文章（除了本篇&#94;_&#94;）都翻译自 Questions and Answers in MRI 。 在学习磁共振知识的过程中，我发现了 Questions and Answers in MRI 这个网站，这个网站对磁共振相关知识介绍的非常全面，涵盖磁体，线圈，磁共振成像原理，磁共振伪影，磁共振功能成像等方方面面，堪称磁共振知识的百科全书，而且每个话题都写得深入浅出，图文并茂，甚至有视频讲解，磁共振初学者和对磁共振有一定了解的技术人员都能从中学到很多东西。这个网站的作者Allen D. Elster在开发这个网站之前其实已经分别在1994年和2001年出过 Questions and Answers in Magnetic Resonance Imaging 这本书的第一版和第二版，这个网站算是这本书的延伸。 这个网站是英文的，相信想要学习磁共振的同仁们都有能力阅读，但要是有对应中文版的可阅读，相信学习者会更开心（有怀疑精神和更高追求的除外&#94;_&#94;），学习效率也会更高一些。 本来我只想自己业余时间翻译着玩儿，将翻译后的内容记在 有道云笔记 上，与部门同事进行分享。但后来觉得用一个网站能够分享给更多对磁共振感兴趣的同仁，在 太然 的建议下使用 Pelican 这个静态网页生成工具在 GitHub 的project pages免费空间上建站，这应该是成本最小而且也显得比较专业的方式了。遂又花了一些时间了解 Pelican 和 reStructuredText ，学习在 GitHub 上建网站的过程。翻译为中文网站也算是我给自己留的深入了解磁共振物理的作业，借此翻译把磁共振知识进行比较系统地了解，也看看自己能不能坚持翻译完或者聚集志同道合的朋友一起翻译完。 翻译的过程我不想按照原网站的顺序逐个话题逐个问题翻译，而是先挑与我当前工作比较接近的话题先翻译，再翻译其他的话题。如果有比较心急的，就自己去读英文版，或者加入到我这个众筹项目中来，大家一起合作翻译(=&#94;_&#94;=)，求之不得。 这个网站目前还没有独立域名，留待以后申请也不迟。目前我个人对 reStructuredText 还不是很熟悉，排版还不是很美观，对 Pelican 的配置也还没很熟悉，网站的一些功能还没开发得很完善。好在 GitHub 可以提供非常好的版本控制，源文件也使用版本控制，改进后重新用 Pelican 生成页面再上传到 GitHub 就能重新发布。 有兴趣加入的朋友联系我。 email : shan.c.young@gmail.com","tags":"Misc","title":"欢迎来到磁共振知识问答中文版"}]}