{"pages":[{"url":"http://chunshan.github.io/MRI-QA/about.html","text":"中文 本网站上的文章翻译自网站 Questions and Answers in MRI ，仅用于自学磁共振知识中的记录，与任何商业用途无关。 Questions and Answers in MRI 是 Allen D. Elster 博士对磁共振社区的厚重礼物。为了磁共振初学者能够更好地学习磁共振知识， Allen D. Elster 博士决定不再更新其出版的 Questions and Answers in Magnetic Resonance Imaging ，而是拥抱21世纪的新技术，在 Questions and Answers in MRI 网站上向磁共振社区完全免费开放其毕生搜集的磁共振物理相关知识的笔记，并且添加了大量多媒体材料。无疑， Allen D. Elster 博士对磁共振社区的贡献是巨大的。 本网站上每一篇文章的开头都标出了原始文章的链接，这些文章都是 Allen D. Elster 博士辛苦劳动的结果，鼓励磁共振爱好者直接阅读这些未经翻译的文章，相信阅读原文的过程中会学到更多。如果觉得文章的知识对您有用，请首先感谢 Allen D. Elster 博士，正是其无私分享的精神才让我们能够免费地阅读这些珍贵的材料。本网站上的图片非常宝贵，它们的版权都属于 Allen D. Elster 博士及 Questions and Answers in MRI 网站，如果要使用原始的文章或者图片，请与 Allen D. Elster 博士联系取得他的授权，其邮箱为 mriquestions@gmail.com 。 English The articles on this site are translation of website Questions and Answers in MRI . These articles are records of learning MRI knowledge by myself and has nothing to do with any commercial purposes. Website Questions and Answers in MRI is the heavy gift for MRI community from Prof. Allen D. Elster , who has decided not to update and publish his book Questions and Answers in Magnetic Resonance Imaging , but to make all his collection of notes of MRI physics public on Questions and Answers in MRI totally free. Prof. Allen D. Elster has been embracing the new technology in the 21st Centrury and adding many multimedia materials on the site. Undoubtedly, Prof. Allen D. Elster has a giant contribution to the MRI community, especially for the beginners in MRI. At the beginning of each translated Chinese article, the link of the original English article is marked, which is the result of Prof. Allen D. Elster 's hard work. I encourage every MRI enthusiast to read the original articles directly and I believe you can learn more in the process. If you think that you learn something from the articles, please firstly give your appreciation to Prof. Allen D. Elster . It is Prof. Allen D. Elster who selflessly shared the precious materials free of charge. Pictures on this site are very valuable and their copyright belongs to Prof. Allen D. Elster and website Questions and Answers in MRI . If you want to cite his original text or pictures, make sure to contact Prof. Allen D. Elster to get his authorization. His email is mriquestions@gmail.com .","tags":"pages","title":"About"},{"url":"http://chunshan.github.io/MRI-QA/bold/language.html","text":"原文链接: What paradigms do you use to test language function prior to surgery? 概要 语言处理的\"经典\"和\"双流\"模型。经典模型 以Wernicke区（接受） 和Broca区（表现）为中心。\"双流\"模型将这些区域整合入负责理解 的腹侧流（红色）和负责衔接的背侧流（蓝色）。 语言处理的\"经典\"模型主要集中在大脑左半球两个专门的脑区：1）Wernicke区（绿色），在颞上回后部，与语言的接受和理解相关；2）Broca区（蓝色），在额下回后部，与说话的表达/发音相关。从Wernicke区到Broca区的信息传导发生在皮层下的白质通路，主要是弓状纤维。 在过去的十年，神经科学界越来越多人开始接受更复杂的\"双流\"模型，此模型认识到了颞叶，顶叶，额叶在语言处理中的参与与作用。在此模型中，两边非常有组织的腹侧流处理讲话信号的理解，左侧占明显优势的背侧流将声学上的语音映射到额叶的发音网络。 用于术前手术规划的语言相关fMRI实验有两个主要目标：功能区定位（Wernicke区和Broca区）和确定语言优势半球。实践中尚没有标准的实验模式，但可以参考ASFNR网站上最常用的实验，至少应该采用一个语义实验和一个音韵实验，最好的研究中心对语义和音韵每个都会采用2-3个实验。不管选择什么协议，一个重要的原则是在控制期间用非语言活动占据患者（如显示乱序的字母或者无意义的符号），这个原则是必须满足的，因为很多患者在休息时不自觉进行语言功能，引入干扰变量。 音韵实验 音韵实验用于激活Broca区和背侧流中与语言发音相关的其他区域。最常用的音韵实验之一是默念生成的单词。如给被试显示一个字母（如\"B\"），在接下来的5-10秒钟内要求被试默想尽可能多的以此字母开头的单词（\"Baby\"，\"Bed\"等）。在休息期间，给被试显示一些无意义的符号（如\"✜\"，\"⌘\"）。 A B C 默想生成的单词任务导致左前额皮层激活（A），双侧Broca区（左侧比右侧大）激活（B），右小脑的激活（C） 其他（大多数）的音韵实验包括押韵实验（默想与显示单词尽可能多的押韵单词或者在显示的单词对押韵时按下按钮），命名实验（图像中物体是什么？）和反义词实验（热的反义词是什么？）。值得注意的是，没有实验是\"纯粹\"的，对大多数患者而言，背侧流和腹侧流通常会出现不同程度的激活。 语义实验 语义实验主要用于激活Wernicke区和腹侧流中与语言解码和建立意义相关的其它区域。因为伴随音韵实验，Broca区的一些激活不可避免。语义实验的输入可能是听觉，也可能是视觉。 fMRI检查中典型的语义实验任务包括完成句子（\"我开__车去工作。\"），陈述真/假（\"显示的语句是真是假？\"），阅读理解（阅读全部段落后提问）和听力理解（听完一段话后提问或者听取混乱中演讲的意思）。语义实验也可以添加许多其它有趣的变化，这样的实验在神经生理学杂志中随处可见。 A B C 完成句子实验。注意到Wernicke区有强烈的激活（A），而上颞叶和左前颞叶的其它部分也有激活（B,C） 高级讨论 双语患者(Bilingual Patients) 能说两种语言的被试展示出了与只能说一种语言的被试在颞叶语言相关区域（Wernicke区）上的一些不同，但是Broca区并没有这样的不同。这儿的差异是第二语言是早期（儿童时期）学到的还是晚期（青少年或者成年）学到的。晚期学会两种语言的被试一般有独立的语言表达区域然，而早期学会两种语言的被试的语言表达区域是共享的。 优势半球(Hemispheric Dominance) fMRI激活实验中可以用偏侧化指数（Laterality Index，LI）量化优势半球的程度，偏侧化指数定义为： LI = (L− R) / (L + R) 使用这个度量，左脑半球具有高度优势的人得分将是+1，右脑半球具有高度优势的人得分将是-1，左右脑完美平衡的人得分将是0。然而，偏侧化指数（LI）的定义有些随意，因为它依赖于定义激活的统计阈值。 参考材料 American Society of Functional Neuroradiology (ASFNR). Functional Imaging Paradigms (2007) . Available from http://www.asfnr.org/wp-content/uploads/ASFNR-BOLD-Paradigms.pdf (language paradigms on pp. 15-35) Hickok G. The functional neuroanatomy of language . Phys Life Rev 2009; 6:121-143. (good review by the originator of the modern \"dual stream\" model of speech processing) Klein AP, Sabsevits DS, Ulmer JL, Mark LP. Imaging of cortical and white matter language processing . Semin Ultrasound CT MRI 2015; 36:249-259. Price CJ. A review and synthesis of the first 20 years of PET and fMRI studies of heard speech, spoken language and reading . Neuroimage 2012; 62:816-847. Smits M, Visch-Brink E, Schraa-Tam CK, et al. Functional MR imaging of language processing: an overview of easy-to-implement paradigms for patient care and clinical research . Radiographics 2006; 26:S145-158. Zaca D, Jarsol S, Pillai JJ. Role of semantic paradigms for optimization of language mapping in clinical fMRI studies . AJNR Am J Neuroradiol 2013 34: 1966-1971. 相关问题 为什么要做\"开关\"BOLD信号的比较？为什么不能直接测量BOLD信号绝对值？","tags":"BOLD","title":"Question-语言测试：术前测试语言功能会使用什么实验模式？"},{"url":"http://chunshan.github.io/MRI-QA/bold/visual.html","text":"原文链接: What about fMRI of the visual system? 概要 从视网膜到初级视觉皮层有交叉和非交叉的投射通路 神经科学的学生应该对视觉通路的基础解剖都很熟悉：光进入眼睛，刺激视网膜细胞（retinal cells），其完整的输出纤维沿视神经（optic nerves）走行，在视交叉（optic chiasm）处部分交叉，并继续沿视束（optic tracts）到达丘脑（thalamus）外侧膝状体核（lateral geniculate nucleus，LGN）的突触（synapse）。视辐射从LGN产生，终止于枕叶（occipital lobe）初级视觉皮层（ primary visual cortex）特定区域的神经元，初级视觉皮层，也称为striate cortex或第一视觉区（V1）。视网膜到V1的投射是高度组织化的，每个视野投射到对侧大脑半球（这句话有些不对，并不是每个视野都投射到对侧）。 枕叶（紫色）上的初级视觉皮层连接到后顶叶区 （绿色）和颞下叶区（灰色）的相关区域分别通过背侧和腹侧的流 视觉信息最复杂的整合发生在纹状体外皮层（extrastriate cortex），视觉联合区域表示为V2-V6，位于枕叶，颞叶和顶叶的相邻处。有两种通路传送信号到这些区域：腹侧流被认为负责物体识别和长期视觉记忆的存储；背侧流被认为与物体空间位置和运动知觉相关。 使用棋盘格图案做的视觉皮层BOLD/fMRI实验。注意到 外侧膝状体（lateral geniculate nucleus，LGN）（绿色箭头）的激活 历史上看，20世纪90年代最早的fMRI实验就有涉及视觉皮层激活的实验。目前视觉系统fMRI主要的临床应用是脑肿瘤，血管畸形，和其它有影响视觉中枢通路病变患者的术前规划。DeYoe等人已经开发了一套能够产生比较强BOLD信号的实验模式，该实验使用缓慢扩大的棋盘环和楔形图案，使得视野偏心距和角位置都能在合理的时间框架内得到映射。采集fMRI数据时一般也会进行弥散张量成像（Diffusion Tensor Imaging，DTI），用于确定与这些皮层区关联的白质纤维束。 高级讨论 许多基础科学研究正在使用fMRI研究人类视觉相关区域的功能，但是目前尚未达到术前手术规划的临床实用阶段，但可能在不久的将来就能实现这一目标。 参考材料 American Society of Functional Neuroradiology (ASFNR). Functional Imaging Paradigms (2007) . Available from http://www.asfnr.org/wp-content/uploads/ASFNR-BOLD-Paradigms.pdf (visual paradigms on pp. 37-40) DeYoe EA, Ulmer JL, Mueller WM, et al. Imaging of the functional and dysfunctional visual system . Semin Ultrasound CT MRI 2015; 36:234-248. Engel SA, Glover GH, Wandell BA. Retinotopic organization in human visual cortex and the spatial precision of functional MRI . Cereb Cortex 1997; 7:181-192. (Description of the traveling wave method, commonly used for visual fMRI experiments). Mishkin M, Ungerleider LG, Macko KA. Object vision and spatial vision: two cortical pathways . Trends Neurosci 1983; 6:414-417. (famous paper describing the \"two-stream hypothesis\" for visual processing) Warnking J, Dojat M, Guérin-Dungué A, et al. fMRI retinotopic mapping —step by step . NeuroImage 2002; 17:1665-1683. 相关问题 谁发明了功能磁共振（fMRI）？","tags":"BOLD","title":"Question-视觉系统的fMRI：视觉系统的fMRI是什么情况？"},{"url":"http://chunshan.github.io/MRI-QA/bold/motor-paradigms.html","text":"原文链接: What is the best way to identify the motor cortex using fMRI? 概要 初级运动皮层 运动皮层映射是最简单最可靠的BOLD/fMRI方法之一。初级运动皮层位于中央前回的额叶，毗邻中央沟（Rolandic fissure），它紧邻初级躯体感觉皮层，并且与之功能相关。在此区域及附近的手术有很高的风险造成瘫痪或失能。因此运动皮层映射是目前应用最广泛的fMRI在术前的应用。 感觉运动皮质的小矮人示意图 由于运动皮层和感觉皮层有很强的互通性，这两个区域通常被统称为初级感觉运动皮层。感觉运动皮层的功能在空间上可以组织为一个侏儒（\"小矮人\"）的样子，下肢投射到皮层的内上侧，紧接着是躯干，手臂和手，面部映射到横下侧。在感觉运动皮层前面还有一个辅助运动区域，一般认为参与运动的规划和定序。在fMRI的运动实验模式中，同侧丘脑和对侧小脑往往表现出活动，因此认为它们有协调和运动记忆的作用。 右手手指敲击实验得到的BOLD-fMRI参数图。对侧（左侧）初级感觉运动皮质有最强烈的激活。同时注意到双侧的辅助运动区域（绿色箭头）和同侧（右侧）上小脑也有激活。 不同复杂度的fMRI运动实验模式可以采用，其中的一些在下面的ASFNR中有描述。大多数是组块设计（Block Design），患者交替进行某一种物理运动和等时间的休息。一个完整的运动fMRI检查通常涉及三个不同的解剖区域：手，足，口。手的运动模式有相对简单/双侧的（如握拳或压球），也有更微妙而复杂的（如根据随机的视觉线索顺序敲击单个手指）。下肢运动功能一般用脚趾/脚踝/脚背屈进行测试，面部/口的运动功能一般使用撅嘴和/或摇动舌头进行评估。所有的运动实验模式中都要求告知患者让他们的运动尽可能平稳且局部，不造成头的摇动或颤动，从而最大限度地减少运动相关的fMRI伪影。 高级讨论 中风，肿瘤和脱髓鞘病变如果在运动皮层附近，患者可能非常虚弱，即使一个简单的运动任务如敲击手指也无法完成。同样，一些精神状态改变的患者身体虽然不虚弱却不能按照提示做手，足，面相应的动作。 这些情况下，可以修改运动模式以适应每个患者的具体限制。例如，如果手只是部分失能，敲击手指的模式可以转化为整个拳头紧握或者挤压橡胶球。对完全瘫痪的患者，手部的纯感官刺激（抚摸或刮擦）也可能会引起体感皮质和初级运动皮质的fMRI激活。一些完全瘫痪的患者靠想象运动也会激发感觉运动皮质微弱的BOLD-fMRI响应。最后，静息态fMRI在没有任何外源性刺激或强迫运动的情况下也能够检测到运动皮质的激活。 参考材料 American Society of Functional Neuroradiology (ASFNR). Functional Imaging Paradigms (2007) . Available from http://www.asfnr.org/wp-content/uploads/ASFNR-BOLD-Paradigms.pdf (motor paradigms on pages 3-13) Bizzi A, Biasi V, Falini A, et al. Presurgical functional MR imaging of language and motor functions: validation with intraoperative electrocortical mapping . Radiology 2008; 248:579-89. Connelly A, Jackson GD, Frackowiak RSJ, et al. Functional mapping of activated human primary cortex with a clinical MR imaging system . Radiology 1993; 188:125-130. Jack CR Jr, Thompson RM, Butts RK, et al. Sensory motor cortex: correlation of presurgical mapping with functional MR imaging and invasive cortical mapping . Radiology 1994;190:85–92. Johansen-Berg H. Anatomy of the sensorimotor system . Available from Nuffield Department of Clinical Neurosciences, Oxford University at this link . (accessed Feb 2016). (It's a lot more complicated than you might think!) Motor Cortex . Wikipedia, The Free Encyclopedia (accessed Feb 2016). Tieleman A, Deblaere K, Van Roost D, et al. Preopertive fMRI in tumour surgery . Eur Radiol 2009; 19:2523-2534. Ulmer JL, Klein AP, Mark LP, et al. Functional and dysfunctional sensorimotor anatomy and imaging . Semin Ultrasound CT MRI 2015; 36:220-233. 相关问题 What is meant by resting state fMRI? How is it used?","tags":"BOLD","title":"Question-感觉运动皮层：使用fMRI识别运动皮层的最佳方法是什么？"},{"url":"http://chunshan.github.io/MRI-QA/bold/why-on-off-comparison.html","text":"原文链接: Why do you have to do an \"on-off\" comparison? Why not just measure the absolute BOLD signal instead? 概要 原始MR BOLD信号不是绝对的，受很多具体的技术和患者因素的影响。技术因素包含场强，放大器增益，头线圈接收单元的数目和位置，脉冲序列（SE或GRE），层的采集顺序，序列时间参数（TR/TE/α），体素大小等。患者相关的因素包括红细胞容积比，呼吸速率，头的大小，年龄，性别，激素状态和药物治疗（含咖啡因）。 BOLD信号通常用任意单位（A.U.s，Arbitrary Units）或者与基线相比变化的百分比表示。虽然一些研究实验室对BOLD信号校准取得一些有限的成果（见高级讨论），绝大多数情况下BOLD信号不能简单地转换为绝对单位，如每分钟的血流量或每秒去极化的峰值数量。 因此大多数BOLD/fMRI检查中，必须基于\"任务\"态和\"非任务\"态信号的变化使用统计技术区分\"激活\"脑区和\"非激活\"脑区的信号。 高级讨论 虽然有这些限制，BOLD信号的校准方面仍取得一些有限的成果。现有的方法包括使用呼吸挑战引起血液中碳酸浓度升高（↑CO2）和氧气浓度升高（↑O2），同时结合动脉自旋标记（ASL）技术观察BOLD信号的变化。脑血容量可以使用外源性对比剂（如钆）或内源性对比方法如血管空间占用（VASO，Vascular Space Occupancy）进行测量。结合复杂的数学模型，就可以估计氧摄取分数（OEF，Oxygen Extraction Fraction）。 参考材料 Blockley NP, Griffeth VEM, Simon AB, Buxton RB. A review of calibrated blood oxygenation level-dependent (BOLD) methods for the measurement of task-induced changes in brain oxygen metabolism . NMR Biomed 2013; 26:987-1003. Hoge RD. Calibrated fMRI . Neuroimage 2012; 62:930-937. (review) Lu H, Golay X, Pekar JJ, van Zijl PCM. Functional magnetic resonance imaging based on changes in vascular space occupancy . Magn. Reson. Med. 2003; 50: 263–274. 相关问题 如何设计一个BOLD/fMRI检查？","tags":"BOLD","title":"Question-开关模式：为什么要做\"开关\"BOLD信号的比较？为什么不能直接测量BOLD信号绝对值？"},{"url":"http://chunshan.github.io/MRI-QA/bold/fmri-paradigm-design.html","text":"原文链接: How do you design a BOLD/fMRI study? 概要 BOLD/fMRI检查的实验设计可以分成三种基本类型：1）组块，2）事件相关，3）混合式。 三种BOLD/fMRI实验的设计 组块设计 组块设计是最古老的功能成像模式，在fMRI发明之前就广泛用于PET检查。组块模式中任务时间（也被称为epochs）与休息时间交替进行。任务状态较高的BOLD信号\"减去\"休息状态时较低的BOLD信号就可以揭示大脑皮质激活的焦点区域。 组块设计是最简单最直接的fMRI实验实现模式。这种模式广泛用于临床fMRI检查中，这些检查的目的是在手术前识别功能区。在经典的\"手指敲击\"实验中（左图所示，在一个单独的Q&A中详细描述），患者敲击手指15秒钟，然后休息同样长度的时间。对噪声和空间畸变校正后，净BOLD信号超出一定统计阈值的区域就称为\"激活\"。 使用简单组块设计的手指敲击fRMI检查， 比较信号在活动和休息期间的差异。因为激活 的\"开关\"模式像一列通过的火车， 因此组块设计也常称为\"厢式车（boxcar）\"设计 与其他的fMRI模式相比，组块设计具有最高的信噪比，最高的统计功率和最大的时间效率。除了上面描述的简单\"开关（on-off）\"式组块设计，也有更复杂的组块设计，比如，在每个休息阶段之后两种或更多种活动交替进行。 尽管有这些优点，组块设计在更复杂的神经生理学中实用性有限，特别是涉及非二进制的任务。使用简单的任务，被试可以预测简单组块（任务/休息）的顺序或持续时间，从而引入干扰变量。最后，由于组块设计需要在相对长的时间（10-20秒）中测量，血流动力学响应和fMRI信号出现时机的信息很难衡量。 事件相关设计 事件相关设计会在短而可变的时间间隔中进行一个或多个任务/刺激。这种模式提供了复杂的神经生理学实验所需的高度灵活性。事件可以是随机的，也可以混合使用不同类型的事件。被试不能预测何时将发生什么，可能会有惊喜/惊讶。事件相关设计有更好的时间分辨率，可以更好地估计血流动力学响应函数（HRF）的时间过程，使得在实验中评估\"学习曲线\"和实践效果，包括评估刺激时间间隔的影响成为可能。 事件相关设计的缺点有较低的信噪比，较低的统计效能，对每个被试需更长的成像时间和更多的试验。数据分析更加复杂，也更依赖于对HRF的准确建模。同时，事后分析可以在检查后对事件重新排序和重新分类，比如，可以将正确和不正确的响应分开独立进行分析。 混合设计 混合模式兼具组块设计和事件相关设计的特征，这种模式中，休息块与组块设计中的休息块相同，但任务块时事件是半随机的。混合模式倾向于保留组块设计中良好的信噪比特征，兼有事件相关设计中的灵活性。 参考材料 Amaro E Jr, Barker GJ. Study design in fMRI: basic principles . Brain Cognition 2006; 60:220-232. Blamire AM, Ogawa S, Ugurbil K, et al. Dynamic mapping of the human visual cortex by high-speed magnetic resonance imaging . Proc Natl Acad Sci USA 1992; 89:11069–11073. (first demonstration of difference between long-duration/block and short-duration/event-related brain responses) Buckner RL. Event-related fMRI and the hemodynamic response . Human Brain Mapping. 1998; 6:373–377. (shows linear response to multiple short-term stimuli) Dale AM. Optimal experimental design for event-related fMRI . Human Brain Mapping 1999; 8:109-114. Huettel SA. Event-related fMRI in cognition . NeuroImage 2012; 62:1152–1156. (good review) Liu TT, Frank LR, Wong EC, Buxton RB. Detection power, estimation efficiency, and predicability in event-related fMRI . NeuroImage 2001; 13:759-773. Maus B, Van Breukelen GJP, Goebel R, Berger MPF. Optimization of blocked designs in fMRI studies . Psychometrika 2010; 75:373-390. Price CJ, Veltman DJ, Ashburner J, Josephs O, Friston KJ. The critical relationship between the timing of stimulus presentation and data acquisition in blocked designs with fMRI . NeuroImage 1999; 10:36-44. 相关问题 使用fMRI识别运动皮层的最佳方法是什么？ 为什么要做\"开关\"BOLD信号的比较？为什么不能直接测量BOLD信号绝对值？","tags":"BOLD","title":"Question-fMRI模式设计：如何设计一个BOLD/fMRI检查？"},{"url":"http://chunshan.github.io/MRI-QA/bold/bold-pulse-sequences.html","text":"原文链接: What is the best pulse sequence to use for BOLD fMRI? 概要 神经元活动产生的血流动力学反应会改变大脑局部氧合血红蛋白和去氧血红蛋白的浓度。这个过程反过来会产生T2和T2*弛豫时间随时间的变化，这是产生BOLD信号的基础。因此，BOLD脉冲序列需要有如下的特征：1）对T2和/或T2*变化敏感；2）BOLD信号本身比较微弱，通常与基线相比只有百分之几的差异，具有检测此微弱信号的能力；3）具有足够的空间分辨率和时间分辨率，能够在多个紧密间隔的时间点上覆盖全脑。 一个短暂的刺激之后BOLD的血流动力学响应函数（HRF） 场强小于等于3.0T时，T2*加权的梯度回波（GRE）序列是最常用的BOLD序列。场强大于等于7.0T时，一般首选T2加权的自旋回波（SE）。下面讨论的参数主要适用于3.0T成像，大多数选择更多是经验性的，基于信噪比，空间分辨率，时间分辨率和运动伪影之间的权衡（其他适用于7.0T成像的方法和适用于所有场强的新技术可以参考高级讨论）。 成像平面 通常选择斜轴，平行于前连合-后连合（AC-PC）连线，能够覆盖全脑。如果用于评估一些解剖结构，如海马，可能会使用垂直于此结构或垂直于AC-PC连线的斜冠状成像。 回波时间（TE） 使用GRE序列，当TE ≈ 组织T2*时，BOLD效应最大，然而，更长的TE会导致更多GRE-EPI图像上的磁敏感伪影和信号丢失，可能需要在后处理中进行场映射校正。3.0T时，一个合理的折中值是TE ≈ 30−35 ms。 重复时间（TR） 应当与血流动力学响应函数峰值信号的时间差不多，典型值为1-4秒。较短的TR（≤ 1.5秒）会更适合于统计，但是必须要改变其他参数如翻转角避免饱和效应和血流流入的信号。 层厚 这是低信噪比（太薄）和部分容积效应（太厚）之间的折中，典型值为2-3mm。 层的采集顺序 一般使用交替采集（1,3,5...2,4,6...）以降低层与层之间的串扰伪影。 平面分辨率 更高的平面空间分辨率意味着更大的成像矩阵，需要增加成像时间（因此影响其时间分辨率），也需要延长读出时间（产生更多伪影），而且降低信噪比。也存在权衡，典型选择是基础分辨率矩阵为64x64 − 128x128（平面内分辨率为2x2 − 3x3 mm）。 总成像时间 为了被试有最大的服从性，总的成像时间不应该超过45-60分钟，每个单独的实验不超过10-12分钟。 并行成像 一般建议使用并行成像减少采集时间和磁敏感伪影，但仅建议使用小加速因子（R ≈ 2）从而不影响信噪比太多。 高级讨论 高级技术和选择 畸变校正 一直以来都采用预采集的场映射以最小化磁敏感引起的fMRI在空间上的扭曲，但这会显著增加采集的时间。使用一个快速的匀场过程提高磁场均匀性被更广泛地使用，尤其是在不以研究为主的中心。 3D方法 fMRI的3D采集具有减少低质图像，连续采集没有间隙，不需要进行切片-时间校正的潜在优势。但TR和读出时间会延长，实现这样的采集变得困难，许多应用无法接受。分段的3D方法，辅以两个方向的并行成像，能够缓解这些问题。也可以使用一种称为z-匀场的技术，这种技术会沿层编码方向（z轴）施加一个补偿梯度，确保k空间轨迹在TE时刻回到原点。 多路采集 现在可以使用\"多带\"技术同时激发几层，即使这样的代价是会延长EPI读出链。 PRESTO (Principle of Echo Shifting with a Train of Observations) PRESTO技术采用一种巧妙的特定选层梯度模式（有相同的相重聚区域）使第一个RF脉冲产生的信号出现延迟，直到第二个RF脉冲施加时才出现。这种方法是一个单独Q&A的主题，已经被Philips开发为商用产品用于ASL和fMRI。 其他非GRE脉冲序列 使用自旋回波的技术也曾经用于fMRI的研究，因为它们能提供高信噪比，减少几何畸变。然而，FSE/TSE序列产生T2加权的图像，必须做出一些变化（如引入回波平移延迟或回波校验修正）增强对T2*的敏感性，这是fMRI在3T或更低场强时所需要的。混合的GRASE方法（交替使用梯度和自旋回波）可能会是一个解决方案，但是目前还没有广泛使用。磁场强度7T或以上时，T2*加权的需求变得不那么强烈，因为fMRI中单纯的T2变化可以更好地反映神经元活动位置。因此在超高场，可以使用自旋回波和SSFP方法，并且有一定优势。 参考材料 Chen JE, Glover GH. Functional magnetic imaging methods . Neuropsychol Rev 2015; 25:289-313. Feinberg DA, Setsompop K. Ultra-fast MRI of the human brain with simultaneous multi-slice imaging . J Magn Reson 2013; 229:90-100. (\"Multi-band\" technique applied to fMRI) Glover GH. 3D z-shim method for reduction of susceptibility effects in BOLD fMRI . Magn Reson Med 1999; 42:290-299. Preibisch C, Wallenhorst T, Heidemann R, et al. Comparison of parallel acquisition techniques Generalized Autocalibrating Partially Parallel Acquisitions (GRAPPA) and Modified Sensitivity Encoding (mSENSE) in functional MRI (fMRI) at 3T . J Magn Reson Imaging 2008; 27:590-598. van Gelderen P, Duyn JH, Ramsey NF, Liu G, Moonen CTW. The PRESTO technique for fMRI . NeuroImage 2012; 62:676-681. Weiskopf N, Hutton C, Josephs O, Deichmann R. Optimal EPI parameters for reduction of susceptibility-induced BOLD senstiivty losses: a whole-brain analysis at 3 T and 1.5 T . NeuroImage 2006; 33:493-504. 相关问题 BOLD fMRI的图像对比度是如何产生的？","tags":"BOLD","title":"Question-BOLD脉冲序列：用于BOLD fMRI的最佳脉冲序列是什么？"},{"url":"http://chunshan.github.io/MRI-QA/bold/does-boldbrain-activity.html","text":"原文链接: Does the BOLD response result from the firing of nerve cells? 概要 是的，虽然是间接的 。神经活动增加导致局部血流量，血容量和需氧量的增加，此过程称为神经血管偶联。产生神经血管偶联的生理学机制在下面的高级讨论中有更详细的描述。 虽然BOLD信号确实与\"放电\"的神经细胞数目相关，但与细胞外的局部场电位（Local Field Potentials，LFPs）关系更紧密。LFPs记录的是大量脑细胞在一个较长时间过程中缓慢变化的电压，比去极化的\"尖峰\"时间长得多。LFPs反映了局部神经网络的活动总和，不仅包括神经元放电也包括在多个树突连接处的正的和负的突触后电位的总和。 一个短暂的外周刺激（如激光或针刺）产生的局部BOLD响应称为血流动力学响应函数（Hemodynamic Response Function，HRF），HRF一般会在开始有一个小的下冲，紧跟着是一个很高的尖峰，然后是刺激后的过冲（可有可无）。 一个短暂的刺激之后BOLD的血流动力学响应函数（HRF） 初始的下冲并不总是会出现，一般在非常高的场强（≥ 7.0T）下更多见。它的形成机制仍然存在争议，主要有两个流行的理论，a)血氧早期代谢的增加和/或b）局部脑血容量的增加。此下冲吸引人的地方在于大脑激活时它可以比大的尖峰提供更高的空间特异性。 正向主峰是BOLD响应的主体，很快就盖过了小的初始下冲，在此阶段局部脑血流量不成比例的增加，远超过直接的代谢需要，造成的结果就是血红蛋白对去氧血红蛋白的比例短时增加，MR信号增强。即使是一个非常短暂的刺激，主导地位的HRF响应也非常缓慢而且有延迟，通常在5-15秒之后才发生。 刺激后过冲也不总是会出现的，通常出现在长时间刺激实验中，它的机制也存在争议，但很可能是由于动脉血容量恢复缓慢和刺激晚期脑状态相关的局部脑血流量减少导致的。 如果多个重复的刺激间隔时间超过4-5秒，它们会以近似线性的方式叠加在一起，当施加了一长串的重复刺激，响应的主峰就变成广阔的高原，不会衰减直至刺激结束。有时可以观察到小的初始过冲，当然不同的被试，不同的实验条件，检查不同的脑区都会导致HRF的可观变化。 关于HRF和BOLD响应的更多细节可以在左边的短片中看到(视频来自YouTube www.youtube.com/embed/jG2WQpgpnMs?wmode=opaque, 不能播放)。 高级讨论 神经血管偶联 神经血管偶联指的是神经元活动导致的局部血流量，血容量和氧摄取量变化的过程。尽管有一个多世纪的大量研究，对这种现象背后的机制仍知之甚少，尚没有达成科学共识。 代谢需要 大脑有很高的能量需求，大约消耗了整个身体20%的氧气，其中至少一半的能量与突触传递有关，包括突触后受体引起的离子通量逆转和谷氨酸的回收。BOLD响应过程中初始的过量血供和氧和过度超过了直接的代谢需求。这意味着后期血供是用于给神经元和相关的支持细胞（星形胶质细胞/周皮细胞）补充能源供应而不是参与最初的响应过程。葡萄糖的供应而不是氧才是最重要的因素。 血管活性物质 神经元活动会释放大量的离子和小分子，它们是有血管活性的，包括离子（Ca++, K+, Na+），腺苷，一氧化氮（NO），血管活性肠肽（VIP），神经肽Y（NPY），前列腺素，谷氨酸，乙酰胆碱和去甲肾上腺素。 血管舒张的传播 血管内自身的信号机制受内皮源性超极化因子（EDHF），前列腺素，和/或一氧化氮的介导，目前正在探索它们对血流动力学反应的贡献。 神经元之外的细胞（星形胶质细胞和周皮细胞）介质 神经胶质细胞大约是神经元数量的10倍，占大脑容积的一半儿以上。它们在脑血管调节，神经代谢调节和神经递质摄取，很可能也包括BOLD信号上都发挥了重要作用。特别是星形胶质细胞，由于其与神经元和血管之间独特的位置，现在受到很多的关注。目前流行的（但未经证明）\"星形胶质细胞-神经元乳酸穿梭\"学说认为星形胶质细胞为神经元提供乳酸作为对谷氨酸水平升高的能量底物。 神经元活动和BOLD的去偶联 偶然情况下，BOLD信号可能与神经元活动不再偶联。一个经常被引用的例子是提早发生的血管扩张现象，此种情况下BOLD信号会先于预期的重复刺激增大。另一个例子涉及GABAA兴奋剂印防己毒素的注射，此时动作电位峰值升高但局部脑血流量没有变化。 参考材料 Bandettini PA, Wong EC, Hinks RS, et al. Time course EPI of human brain function during task activation . Magn Reson Med 1992; 25:390–397. Blamire AM, Ogawa S, Ugurbil K, et al. Dynamic mapping of the human visual cortex by high-speed magnetic resonance imaging . Proc Natl Acad Sci USA 1992; 89:11069–11073. (first demonstration of the single HRF from a short stimulus versus plateau-type response from much longer stimuli). Buckner RL. Event-related fMRI and the hemodynamic response . Human Brain Mapping. 1998; 6:373–377. (shows linear response to short-term stimuli) Chen JJ, Pike GB. Origins of the BOLD post-stimulus undershoot . Neuroimage 2009; 46:559-568. Ekstrom A. How and when the fMRI BOLD signal relates to underlying neural activity: the danger in dissociation . Brain Res Rev 2010; 62:233-244. Figley CR, Stroman PW. The role(s) of astrocytes and astrocyte activity in neurometabolism, neurovascular coupling, and the production of functional neuroimaging signals . Eur J Neurosci 2011; 33:577-588. (Astrocytes outnumber of neurons by 10:1 and comprise about half of total brain volume. They play an important role in cerebrovascular regulation, neurometabolic regulation, neurotransmitter uptake, and quite possibly the BOLD fMRI signal) Fox PT. The coupling controversy . Neuroimage 2012; 62:594-601. Fox PT, Raichle ME. Focal physiological uncoupling of cerebral blood flow and oxidative metabolism during somatosensory stimulation in human subjects . Proc Natl Acad Sci USA 1986; 83:1140-1144. (Famous paper destroying the once-popular myth that CBF and metabolic rate of oxygen consumption were tightly linked). Harris JJ, Jolivet R, Attwell D. Synaptic energy use and supply . Neuron 2012; 75:762-777. (Good review showing that over half of brain energy is used for synaptic transmission). Hillman EMC. Coupling mechanism and significance of the BOLD signal: a status report . Annu Rev Neurosci 2014; 37:161-181. Logothetis NK, Pauls J, Augath M, Trinath T, Oeltermann A. Neurophysiological investigation of the basis of the fMRI signal . Nature 2001; 412:150-157. (famous paper showing better correlation of BOLD responses with LFPs rather than action potentials) Mullinger KJ, Mayhew SD, Bagshaw AP, Bowtell R, Francis ST. Poststimulus undershoots in cerebral blood flow and BOLD fMRI responses are modulated by poststimulus neuronal activity . Proc Natl Acad Sci USA 2013; 110:13636-41. Phillips AA, Chan FHN, Zheng MMZ, et al. Neurovascular coupling in humans: physiology, methodological advances and clinical implications . J Cereb Blood Flow Metab 2015; Epub http://dx.doi.org/10.1177/0271678X15617954 Shmuel A, Augath M, Oeltermann A, Logothetis NK. Negative functional MRI response correlates with decreases in neuronal activity in monkey visual area V1 . Nature Neurosci 2006; 9:569-577. (description of the negative BOLD response) Sirotin YB, Das A. Anticipatory haemodynamic signals in sensory cortex not predicted by local neuronal activity . Nature 2008; 457:475-479, corrected 5 Feb 2009. (showed that vasodilation may bring additional arterial blood to cortex locally in anticipation of expected tasks) 相关问题 BOLD fMRI的图像对比度是如何产生的？","tags":"BOLD","title":"Question-BOLD与大脑活动：BOLD响应是由于神经细胞的放电产生的么？"},{"url":"http://chunshan.github.io/MRI-QA/bold/why-does-bold-uarr-signal.html","text":"原文链接: Why does the BOLD signal increase during activation? It seems like it should decrease since more oxygen is being used up. 概要 BOLD信号在皮层激活时是增强的，这似乎与理论相悖。 不用感觉太糟，因为这个现象也让fMRI的早期研究者费解了很久。 我们现在了解的是，在大脑激活时，局部小动脉扩张，毛细血管会充盈更多的新鲜血液（含氧），比大脑活动直接代谢所需要的还多。 在一个多世纪的时间中神经生理学家错误地认为大脑血流动力学是由大脑的代谢需要决定的，这个观点在1980年代中期被Fox和Raichle否定了，他们使用O15-PET技术展示了大脑血流量和氧需求之间的生理性\"解偶联\"。大脑激活时局部脑血流量（CBF）确实是增加的，而且与脑氧代谢率（CMRO2）增加相比要高很多。CBF和CMRO2因此被称为\"解偶联\"。看似矛盾的是，比直接代谢需要多得多的新鲜血液（含氧）被输送给大脑的激活区域。 含氧血液的\"过冲\"意味着大脑激活区域去氧血红蛋白的相对浓度会降低，去氧血红蛋白的T2/T2*缩短效应会减小，激活区域的BOLD信号因此会增加。 参考材料 Fox PT, Raichle ME. Focal physiological uncoupling of cerebral blood flow and oxidative metabolism during somatosensory stimulation in human subjects . Proc Natl Acad Sci USA 1986; 83:1140-1144. Fox PT. The coupling controversy . Neuroimage 2012; 62:594-601. (Good historical review of how the concepts of neurovascular coupling evolved in the late 20th Century.) 相关问题 BOLD fMRI的图像对比度是如何产生的？","tags":"BOLD","title":"Question-BOLD信号：为什么BOLD信号在激活时反而增强？消耗了更多的氧气信号似乎应该降低。"},{"url":"http://chunshan.github.io/MRI-QA/bold/bold-contrast.html","text":"原文链接: How is image contrast produced by BOLD fMRI? 概要 由于以每个铁原子为中心有4个未成对电子，去氧血红蛋白呈强顺磁性 BOLD（Blood Oxygen Level Dependent）对比度产生于局部氧合血红蛋白和去氧血红蛋白浓度的改变。如在前一个Q&A中描述的，氧合血红蛋白没有未成对的电子，呈弱抗磁性，当氧气释放形成去氧血红蛋白时，4个未成对电子暴露在每个铁原子中心，使分子成为强顺磁性。BOLD效应与去氧血红蛋白的浓度直接相关，其浓度在动脉血中少于2%而在静脉血中高于40%。 大脑的局部T2和T2*弛豫时间随着去氧血红蛋白比例增加而降低。这种效应对MR信号的影响取决于场强（Bo），脉冲序列（SE或者GRE）和回波时间（TE）。无论上述何种技术，含更多氧合血红蛋白的大脑区域会比含更多去氧血红蛋白的区域信号强度更高（看起来更明亮）。 红细胞中顺磁性的去氧血红蛋白（D） 导致血管内外局部磁场畸变 红细胞内顺磁性去氧血红蛋白的出现使得血管内外局部磁场畸变（磁敏感梯度）。这些局部磁场扭曲会导致附近静止和缓慢移动的质子有不同的共振频率和相位偏移。由此产生的像素内失相位是一种经典的T2*缩短效应，在大静脉附近最为显著，使用回波时间（TE）接近T2*的GRE序列会加剧这种效应。此效应与场强（B0）成线性关系，是1.5T下BOLD对比度的主要形成机制。 血管内去氧血红蛋白导致的局部磁场畸变也会影响在血管内外弥散的水分子中的质子。这些质子会受到随机改变的频率偏移的影响，其失相位是不可恢复的。这种弥散相关的T2信号损失在临近毛细血管的地方比稍微大一些的血管处更加显著，最好使用自旋回波技术（可以翻转由静磁场不均匀性导致的失相位）抑制此效应。真正的T2弥散效应与磁场强度的平方（Bo²）成正比，是4.0T或更高场强下BOLD对比度的主要机制（大多数临床fMRI检查使用3.0T，这种情况下T2和T2*效应对BOLD对比度的贡献相当）。 高级讨论 至少四种不同的机制会产生BOLD fMRI中的T2和T2*弛豫，下面的参考文献中可以找到对此更完整的描述。这可以分为血管内和血管外两部分，这两部分可以分开考虑因为两部分之间的交换速率比起成像时间（TE）而言非常慢。弥散效应非常重要，因为一个典型的fMRI实验过程中，在其成像间隔（TE ≈ 50 ms），水分子扩散的距离约为毛细血管直径的4倍。血管相对于B0的方向也必须考虑到。 稍低磁场（≤ 3.0T）和更高磁场（≥ 7.0T）中BOLD图像对比度的一个主要不同的机制在于血液和大脑由磁场强度不同导致的弛豫时间改变。1.5T下，动脉血和静脉血的T2分别为250ms和180ms，而白质和灰质的T2在70-100ms之间；7.0T下，相对的弛豫时间发生了逆转，血液的T2（T2*）与大脑相比变得非常短。 参考材料 Pauling L, Coryell CD. The magnetic properties and structure of hemoglobin, oxyhemoglobin and carbonmonoxyhemoglobin. Proc Natl Acad Sci 1936; 22:210-216. (first paper describing and explaining the diagmagnetic and paramagnetic properties of oxy- and deoxy-hemoglobin respectively) Silvennoinen MJ, Clingman CS, Golay X, et al. Comparison of the dependence of blood R2 and R2* on oxygen saturation at 1.5 and 4.7 Tesla . Magn Reson Med 2003; 49:47–60.​ Thulborn KR, Waterton JC, Matthews PM, Radda GK. Oxygenation dependence of the transverse relaxation time of water protons in whole blood at high field . Biochem Biophys Acta 1982; 714:265–270. (describes T2 changes due to diffusion and their quadratic dependence on field strength) Uludağ K, Muller-Bierl B, Uğurbil K. An integrative model for neuronal activity-induced signal changes for gradient and spin echo functional imaging . Neuroimage 2009; 48:150-165. Weisskoff RM, Zuo CS, Boxerman JL, Rosen BR. Microscopic susceptibility variation and transverse relaxation: theory and experiment . Magn Reson Med 1994; 31:601-610. 相关问题 What are the different forms of hemoglobin and why do they have different magnetic properties? Why does acute hemorrhage become dark on T2-weighted images? 为什么BOLD信号在激活时反而增强？消耗了更多的氧气信号似乎应该降低。","tags":"BOLD","title":"Question-BOLD对比机制：BOLD fMRI的图像对比度是如何产生的？"},{"url":"http://chunshan.github.io/MRI-QA/bold/how-does-fmri-work.html","text":"原文链接: How does fMRI work? 概要 BOLD，运动任务的fMRI检查（来自Siemens）。 功能磁共振（functional MRI，fMRI）这个术语虽然很多地方都会用到，但是一般指对脑激活引起脑局部血流变化的成像。增加的血流量改变了局部去氧血红蛋白（顺磁性）和氧合血红蛋白（抗磁性）的比例，影响了T2和T2*。由此产生的MR图像中的信号强度变化成为BOLD（Blood Oxygen Level Dependent）对比度。 在一个典型的临床BOLD-fMRI实验中，会要求被试躺在扫描仪中间歇性地执行各种任务（如敲击手指或默念一些单词）。在执行任务和休息时都会使用平面梯度回波采集全脑图像。对任务态和休息态的图像进行统计性的比较（加额外的处理）可以产生激活参数图，激活参数图可以叠加到解剖图像上。 这仅是对BOLD-fMRI技术的简要介绍，对每一个步骤更加详细的描述可以参考后续Q&A。 下面是一个介绍性的视频，可以提供fMRI技术原理的概述（视频来自YouTube \"www.youtube.com/embed/r7qQhhGzRC8?wmode=opaque\"，不能播放）。 参考材料 Brown GG, Perthen JE, Liu TT, Buxton RB. A primer on functional magnetic resonance imaging . Neuorpsychol Rev 2007; 17:107-125. Chen JE, Glover GH. Functional magnetic imaging methods . Neuropsychol Rev 2015; 25:289-313. 相关问题 谁发明了功能磁共振（fMRI）？ BOLD fMRI的图像对比度是如何产生的？ 用于BOLD fMRI的最佳脉冲序列是什么？","tags":"BOLD","title":"Question-fMRI概览：fMRI的原理是什么？"},{"url":"http://chunshan.github.io/MRI-QA/bold/who-invented-fmri.html","text":"原文链接: Who invented functional MR imaging (fMRI)? 概要 术语功能磁共振成像（fMRI）通常指使用不同的磁共振技术对大脑活动进行成像。1980年代末，已经发现神经元活动区域的局部脑血流量会增加，低分辨率的PET检查已经可以在人体记录这一现象。这个现象启发已故的John (Jack) Belliveau用高分辨率的磁共振技术对脑激活成像，当时他还是哈佛大学的研究生，在麻省总院的Martinos中心工作。 John (Jack) Belliveau 1959-2014 Science杂志1991年11月的封面是一个 艺术家的演奏， 来自Belliveau等使用MRI 展示视觉皮层激活的具有里程碑意义的论文 Belliveau等使用的方法现在称之为动态磁敏感对比（Dynamic Susceptibility Contrast，DSC）MRI。当志愿者通过眼镜观察闪烁的棋盘图案时，分别采集注射钆造影剂前后的初级视觉皮层的平面回波图像。计算出刺激状态下的脑血容量，减去非刺激状态下的脑血容量，得到的功能图可以显示大脑哪儿活动增强了。 Science上这一开创性的论文立刻激发了神经科学界巨大的兴趣，随后全世界的研究机构都争相购入自己的MRI机器。1992年，基于Belliveau团队的发现，一种公认做fMRI更优的方法产生了，这项技术称为血氧水平依赖（Blood Oxygen Level Dependent，BOLD）成像，不需要注射钆造影剂，相反，它利用含氧血红蛋白和去氧血红蛋白不同的磁特性检测局部血流变化。 Seiji Ogawa, BOLD fMRI的开创者，2003年的照片 BOLD方法是由AT&T Bell实验室的科学家Seiji Ogawa与Minnesota大学的MRI研究者们一起工作时想出来并发展的。1990年BOLD对比度最早在7T下的老鼠中被发现，首次用于人类视觉皮层的fMRI激活研究是在1992年，4T下进行开关灯刺激，发表在Proceedings of the National Academy of Sciences USA。因为BOLD方法是完全非侵入的（不需要注射外源性对比剂），允许在一次检查中进行多个大脑激活实验BOLD方法很快取代DSC激活方式，成为全世界用于fMRI研究的主要方法。 参考材料 Belliveau JW, Kennedy DN, McKinstry RC, et al. Functional mapping of the human visual cortex by magnetic resonance imaging . Science 1991; 254:716-719. (first fMRI demonstration using bolus gadolinium and a DSC-like method) Ogawa S, Lee TM, Kay AR, Tank DW. Brain magnetic resonance imaging with contrast dependent on blood oxygenation . Proc Natl Acad Sci USA 1990; 87:9868-72. (demonstration of the BOLD phenomenon - these were not functional mapping studies but were experiments to elucidate the nature of intracortical \"dark lines\" newly seen in the brains of rodents at 7.0T, showing that these were veins containing deoxyhemoglobin whose signal changed in response to metabolic manipulations such as hypoglycemia and hypoxia.) Ogawa S, Tank DW, Menon R, et al. Intrinsic signal changes accompanying sensory stimulation: functional brain mapping with magnetic resonance imaging . Proc Natl Acad Sci USA 1992; 89:5951-5. (use of BOLD imaging to demonstrate activation of the visual cortex. This paper was originally submitted to Nature but summarily rejected without peer review saying it was not of \"general interest\"!) Raichle ME. Behind the scenes of functional brain imaging: a historical and physiological perspective . Proc Natl Acad Sci USA 1998; 95:765-772. Sandrone S, Bacigaluppi M, Galloni MR, et al. Weighing brain activity with the balance: Angelo Mosso's original manuscripts come to light . Brain 2014; 137:621-633. (Possibly the world's first demonstration of the relationship between brain activity and blood flow.) 相关问题 如何做一个DSC灌注检查？ fMRI的原理是什么？","tags":"BOLD","title":"Question-功能磁共振的发明：谁发明了功能磁共振（fMRI）？"},{"url":"http://chunshan.github.io/MRI-QA/technique-related-artifacts/mra-artifacts-ce.html","text":"原文链接: What artifacts on contrast-enhanced MRA should we know about? 概要 锁骨下动脉伪狭窄伪影 锁骨下动脉酷似狭窄的不规则病灶可能会发生于注射造影剂的同侧。这是一种周围锁骨下静脉残留钆的磁敏感（T2*）效应。这种伪影通常见于左头臂静脉病程较长患者的左侧注射后。 左锁骨下动脉的\"伪狭窄\"（箭头），由于锁骨下静脉残留钆的磁敏感（T2*）效应影响 扫描太迟：静脉污染 扫描太晚，就就有了静脉回流时间，与动脉期重叠。这对于颅内和颈动脉系统尤其是个问题，硬脑膜窦和颈静脉在对比剂到达后5-10s内就会发生显著充盈。肾脏系统是另一个快速静脉充盈会发生的地方。 与CTA一样，非时间分辨的CE-MRA仅提供一次机会去\"做正确地事\"。 扫描稍晚导致的颈动脉MRA出现静脉污染 扫描太早：振铃（Maki）伪影 如果K空间中心区域在对比剂到达之前进行扫描，血管中心会比较暗，只显示增强的边缘。这个现象的原因是k空间中心决定基本的图像对比度而外围提供高空间频率和细节。这种\"太早\"现象最初是由Maki等描述的，因此成为振铃伪影或Maki伪影，与上面介绍的伪影一样，在发现伪影之前所有的对比剂剂量已经被用光，除了重新注射外没有别的解决方法，而且最好是另进行一次。 扫描太早导致的Maki伪影（例如主对比剂团到达之前） 参考材料 Lee VS, Martin DJ, Krinsky GA, Rofsky NM. Gadolinium-enhanced MR angiography: artifacts and pitfalls . AJR Am J Roentgenol 2000; 175:197-205. Maki JH, Prince MR, Londy FJ, Chenevert TL. The effects of time varying intravascular signal intensity and k-space acquisition order on three-dimensional MR angiography image quality . J Magn Reson Imaging 1996;6:642-651. 相关问题 How is contrast-enhanced MRA performed?","tags":"technique-related-artifacts","title":"Question-增强MRA中的伪影：我们应当知道对比增强MRA中的哪些伪影？"},{"url":"http://chunshan.github.io/MRI-QA/technique-related-artifacts/mra-artifacts-tof.html","text":"原文链接: What are the major TOF MR artifacts should we know about? 概要 时间飞行（time-of-flight，TOF）MRA检查至少有6种不同的伪影经常被提及。下面有图示和简单说明。 阶梯状伪影（仅2D TOF） 非各向同性的体素产生的温和的阶梯状伪影 这种伪影最简单的形式是在倾斜方向的血管上有微妙的像素化外观。这种伪影是因为二维层面相对与平面内的空间分辨率（0.5-1.0mm）而言比较厚（1-3mm）。可以通过重叠25%-30%的层面使阶梯状伪影最小化。这意味着覆盖相同的区域要更多的层面，伴随着扫描时间也会增加。 分别扫描二维层面时如果有轻微或重大的运动就会产生更严重的阶梯状伪影。 轻微的运动伪影导致主动脉2D-TOF MRA上出现水平带 颈动脉TOF MRA检查中比较大的运动导致锯齿状边缘的严重伪影 平面内饱和伪影 TOF MRA依赖于新鲜血液（不饱和）的流入产生高血管内信号，当流动方向垂直于主成像平面时信号最强。如果血管在平面内穿行，其中的血液会像静态组织一样变得饱和，导致信号降低。在2D或3D TOF技术中都会出现。 3D-TOF MRA显示两根大脑中动脉处都有平面内信号丢失 2D-TOF MRA显示两根胫前动脉的水平部分都有平面内信号丢失 闪耀伪影 CSF流入现象（下面的源图像）产生MIP图像（上图）的伪影 2D和3D TOF MRA图像都会使用最大密度投影（MIP，Maximum Intensity Projection）算法进行显示。MIP算法会选择任意最大信号强度（如背景的2倍标准差）的所有像素。 除了明亮的血管，其他任何有高信号亮度的材料都会\"闪耀\"或\"污染\"MIP图像。由于TOF MRA脉冲序列实际上是T1加权的，短T1材料（血肿，钆，脂肪）是这一现象的主因。然而，任何高信号焦点（由于运动或磁敏感效应）都会产生解释上的问题。 3D TOF MRA在颅底显示来自血肿(H)和脂肪(F)的高信号闪耀 逆流伪影 这更多是一个陷阱而不是伪影，但同样需要注意。回忆一下，TOF技术通常会使用移动饱和脉冲消除静脉向相反方向流动的信号，但是如果由于一些异常情况下动脉逆行会发生什么呢？是的，此动脉也会被抑制，在TOF MRA中不可见。下图显示了一个例子，一个锁骨下动脉盗血综合征的患者左椎动脉被扭转。类似的现象也可以在骨盆和下肢上看到，这些部位狭窄病变周围的血管网络也可能遵循逆行的过程。 2D TOF MRA显示只有右椎动脉，左椎动脉无血流相关信号。 对比增强MRA显示左椎动脉逆行填充（锁骨下动脉盗血现象） 百叶帘影（仅3D MRA） 这是一个仅在MOSTA（Multiple Overlapping Thin Slab Acquisition，多重叠薄层采集）技术中可见的伪影。它代表了相邻层面之间的重叠，这些层面单独采集然后融合到一起。MOSTA技术在 另一个Q&A 中有详细描述。 磁敏感伪影 磁敏感指的是局部磁场扭曲，尤其是空气组织界面和金属物体附近。这些扭曲产生的磁场梯度会引起自旋加速失相位，信号损失和空间扭曲。在MRA中，磁敏感伪影常见于手术夹，血管内线圈和支架的周围。如果比较轻微，可能误诊为血管狭窄，如果比较严重，可能导致血流相关增强完全丢失，错误的提示为血管闭塞。 源图像显示动脉瘤夹导致磁敏感场扭曲 MRA显示由于动脉瘤夹导致的磁敏感伪影，右侧大脑中动脉供血区信号丢失 参考材料 Kaufman JA, McCarter D, Geller SC, Waltman AC. Two-dimensional time-of-flight MR angiography of the lower extremities: artifacts and pitfalls . AJR Am J Roentgenol 1998; 171:129-135. 相关问题 How does time-of-flight MRA work?","tags":"technique-related-artifacts","title":"Question-TOF MRA伪影：我们应该知道TOF MR哪些主要的伪影？"},{"url":"http://chunshan.github.io/MRI-QA/technique-related-artifacts/surface-coil-flare.html","text":"原文链接: What is surface coil flare? What can be done about it? 概要 不同尺寸的线圈的信噪比。表面线圈的灵敏度随着距离表面越远下降越厉害. 磁共振成像越来越多的使用放置在身体附近或身体上的小表面线圈阵列，并与并行成像结合使用。使用小表面线圈比使用大的，距离身体更远的线圈的优势是会有更高的信噪比（SNR），缺点是会造成信号的不均匀性。线圈的穿透深度与其直径成反比，患者表面产生的信号增强而患者体内深处产生的信号衰减，由此产生的明亮的表面信号有时被称为表面线圈\"耀斑\"。 表面线圈脊柱图像的表面线圈\"耀斑\"表现为过多明亮的皮下脂肪。 深层组织的信号相对较低，看起来就差。 与左边相同的图像，用SCIC算法（表面线圈强度校正，Surface Coil Intensity Correction）处理后的结果。注意整幅图像对比度更加均匀。 表面线圈耀斑最简单的解决方案是对重建后的图像应用一个后处理滤波器。这样的滤波器可以校正低空间频率的强度调制，增强图像对比度，减少噪声，它们被统称为SCIC（表面线圈强度校正）。一些版本的SCIC是每个厂商都提供的，并作为一项常规使用的规则，特别是对脊柱，四肢和身体成像。但是，当需要得到定量数据时不要使用强度校正滤波器，如质量保证/SNR测量，T2软骨映射，功能磁共振成像等。 PURE - 使用体线圈映射线圈灵敏度的大FOV，低空间分辨率校准扫描 对于多通道并行成像，可以在成像之前对非均匀的接收器线圈配置进行校正。不同的供应商对这些方法有不同的名称：GE（PURE- \"Phased array Uniformity Enhancement\"相控阵均匀性增强），Siemens（Prescan Normalize，预扫描均一化），Philips（CLEAR - \"Constant LEvel AppeaRance\"恒定外观水平），Hitachi（(NATURAL - \"NATural Uniformity Realization Algorithm\"自然的一致性算法实现）。与SCIC不同，这些预扫描校正方法需要在成像前进行短暂的表面线圈灵敏度校准扫描。 对于大多数应用而言，可以同时使用线圈均匀性校正预处理和后处理。 高级讨论 如上所述，除了定量成像时应限制使用滤波器，当成像视野中包含大的金属植入物时也应当避免使用像PURE/CLEAR等预扫描方法。此时线圈校准很可能会失败或不充分，校准后的图像甚至比不校准的图像更差。 由于PURE/CLEAR方法需要在成像前进行校准扫描，患者在两次扫描间的任何运动都可能导致校准失败或产生伪影。 参考材料 Belaroussi B, Milles J, Carme S, et al. Intensity non-uniformity correction in MRI: existing methods and their validation . Med Image Anal 2006; 10:234-246. (This review shows that there are many new and interesting methods for solving the image intensity problem than are available on current clinical scanners). GE Healthcare. MR Field Notes: RF Coils...They've come a long, long way . 2005. Hayes CE, Axel L. Noise performance of surface coils for magnetic resonance imaging at 1.5T . Med Phys 1985; 12:604-7. McVeigh ER, Bronskill MJ, Henkelman RM. Phase and sensitivity of receiver coils in magnetic resonance imaging . Med Phys 1986; 13:806-814. Wallner Bk, Edelman RR, Bajakian RL, et al. Signal normalization in surface-coil MR imaging . Am J Neuroradiol 1990; 11:1271-2. 相关问题 How do receive-only coils work?","tags":"technique-related-artifacts","title":"Question-表面线圈耀斑：表面线圈耀斑是什么？可以对它做什么？"},{"url":"http://chunshan.github.io/MRI-QA/technique-related-artifacts/data-artifacts.html","text":"原文链接: Are there any other data-related artifacts that we should be aware of? 概要 中心点伪影 中心点伪影 中心点伪影表现为图像正中心一个或明或暗的点。回顾磁共振扫描历史，这种伪影最初被误认为是多发性硬化斑块或腔隙性脑梗死。不要让这种情况在你身上发生！ 中心点伪影是由接收器电路中一个恒定的直流（DC）电偏移导致的。理想情况下，当没有信号被记录时，接收器输出电压应为0。但是接收器偶尔会有漂移，在静息状态下也会一个小的或正或负的电压输出。当傅里叶变换时，这个小的常量偏移就会在图像中心产生一个信号的小尖峰。 在磁共振早期，这种伪影是一个常见的麻烦。然而由于射频相位变换和扫描仪电路中自校准检查的广泛使用，现在很少遇到。但是，如果直流偏移错误非常偶然地通过，中心点伪影还是会出现在图像中，所以要有所准备。 数据裁剪伪影 数据裁剪 接收器放大器的增益如果校准不当可导致数据裁剪和诡异的数据，带有灰色背景的水模样图像。如果增益设置太高，射频信号超出了射频放大器的上限和下限截止水平（±Vmax），这种伪影就会发生。仔细校准和反复扫描是克服此伪影的唯一方法。 数据错误伪影 在数据处理链中不时产生的随机\"毛刺\"会导致图像中包含多条线，这些线纵横交错或者呈人字形。几个例子如下所示。通常，对裸数据简单地再处理就可以消除这种伪影，挽救一批不可辨读的图像。 高级讨论 一个常数的傅里叶变换是狄拉克函数δ(T)，是中心点伪影\"尖峰\"的来源。 同样地，(kx, ky)处一个错误的数据点会突出一个空间频率，反映在最终图像上就是此空间频率的一组平行线。 参考材料 Zhuo J, Gullapalli RP. AAPM/RSNA physics tutorial for residents . MR artifacts, safety, and quality control. Radiographics 2006;26:275-297. Heiland S. From A as in aliasing to Z as in zipper: artifacts in MRI . Clin Neuroradiol 2008; 1:25-36. 相关问题 我们断断续续在我们图像看到拉链样伪影，它们是怎么产生的？ Why is receiver gain adjustment necessary? What happens if it is set incorrectly?","tags":"technique-related-artifacts","title":"Question-其他伪影：我们还应该注意哪些其他数据相关的伪影？"},{"url":"http://chunshan.github.io/MRI-QA/technique-related-artifacts/zipper-artifact.html","text":"原文链接: We intermittently see zipper-like artifacts in our images. What causes them? 概要 由于射频直通产生的链条伪影 穿过图像的拉链样条带假信号有许多原因，所以没有单一的策略可以纠正所有的此类伪影。拉链伪影最常见的形式是穿过图像的中心并且在相位编码方向出现。这种形式的拉链伪影是由于接收系统接收不同的发射器射频信号泄露（\"直通\"）导致的，最常见的这种RF噪声源或许是一个外部的信号源，由于射频屏蔽室的门没有完全封闭或它的密闭有缺陷。其次常见的原因是扫描室内麻醉检测设备（如脉搏血氧仪）的射频发射。 在频率编码方向的链条伪影通常是因为不完美的层面选择梯度轮廓或不合适的射频发射器调整产生的刺激回波。增加层面间的间隙可以减少这种伪影，但通常需要给服务工程师打电话。 Annefact伪影（Annefact(cusp) artifact）是一种像羽毛的明亮信号，在相位编码方向上穿过图像的中心，这一点上很像拉链伪影。它的产生是因为FOV外的刺激回波被远处没有正确停用的阵列线圈接收，这种伪影是一种卷折伪影，由于梯度与磁体孔末端空间上变化的主磁场非线性地耦合产生。Annefact伪影在脊柱或骨盆矢状位或冠状位的FSE图像图像上最常见，偶尔，这种伪影也会退化为图像中间的一些集群点，成为星状伪影(star artifac)。 由于FOV外的刺激回波产生的Annefact伪影 星状伪影（箭头处） 参考材料 Artasona LM. Annefact artifact in MRI . Blog at El Baul Radiologicó 16 Mar 2015, accessble at this link in Spanish. Graves MJ, Mitchell DG. Body MRI artifacts in clinical practice: a physicist's and radiologist's perspective . J Magn Reson Imaging 2013; 38:269-287. Heiland S. From A as in aliasing to Z as in zipper: artifacts in MRI . Clin Neuroradiol 2008; 1:25-36. Larkman DJ, Herlihy AH, Coutts GA, Hajnal JV. Elimination of magnetic field foldover artifacts in MR images. J Magn Reson Imaging 2000; 12:795-797.​_ Rangawala N, Zhou XJ. Reduction of fast spin echo cusp artifact using a slice-tilting gradient . Magn Reson Med 2010;64:220-228. Zhuo J, Gullapalli RP. AAPM/RSNA physics tutorial for residents . MR artifacts, safety, and quality control. Radiographics 2006;26:275-297. 相关问题 我们还应该注意哪些其他数据相关的伪影？","tags":"technique-related-artifacts","title":"Question-拉链及相关伪影：我们断断续续在我们图像看到拉链样伪影，它们是怎么产生的？"},{"url":"http://chunshan.github.io/MRI-QA/technique-related-artifacts/nyquist-n2-ghosts.html","text":"原文链接: On EPI we commonly see three overlapping images. It looks somewhat like a phase wraparound artifact. What is causing this? 概要 Nyquist N/2 鬼影 这篇文章介绍的伪影被称为Nyquist N/2鬼影，发生于平面回波成像（EPI）序列中，EPI序列以zig-zag轨迹填充k空间。头部MRI中，这种伪影有时又被称为\"三个脑袋伪影（Three Brains Artifacts）\"。 EPI脉冲序列由一系列回波组成，每一个回波产生k空间中的一横行数据。在zig-zag采集中，每两个回波采集方向会交替一次。对于图像重建，偶数的回波必须时间上反转从而与奇数的回波相匹配，才能进行傅里叶变换。 如果向前和向后的回波不是彼此的完美镜像，图像处理过程中就会引入伪影。即使第一个回波的开始有微小的延迟，也会传播到所有后续的回波，导致偶数回波和奇数回波的峰值时间有轻微差别。当做傅里叶变换时，该相位误差导致信号强度在图像相位编码方向偏移一半。如果FOV内有N个像素，此混叠的鬼影看起来相对于正确位置的主图像平移了N/2个像素。 zig-zag形式k空间轨迹填充时奇数和偶数回波的峰值时间有轻微的差别是Nyquist N/2鬼影的原因之一 Nyquist鬼影有许多可能的原因包括糟糕的匀场，梯度线圈发热，病人运动和重建误差。然而最常见的原因是梯度脉冲快速变化使线圈感生涡电流和磁体壳。涡电流反过来产生局部磁场干扰B0场，在数据中添加了相位偏移。偶数线和奇数线的读出梯度方向相反，这意味着涡电流引起的相位偏移在这些交替的线上是相反的。 使用倾斜层面也有助于产生Nyquist N/2鬼影。倾斜成像需要在图像采集过程中对三个物理梯度（Gx，Gy，Gz）同步进行不同的混合，但是，每一个物理梯度有独特的电感，对开关接通和关闭的响应不同。如果三个梯度不是在完全相同的时间点激活和失活，就会发生相位误差。有时简单调整层面倾斜度（多或少）就可以减少Nyquist伪影。 其他减小Nyquist N/2伪影的方法包括重新匀场，减少回波链长度，降低相位编码分辨率，使用多次激发（分段）EPI，和应用并行成像加速。如果这些方法不起作用，伪影仍在多个部位上存在，可能需要让工程师进行全面维修，重新调整梯度和涡电流补偿。 参考材料 Buonocore MH, Gao L. Ghost artifact reduction for echo planar imaging using image phase correction . Magn Reson Med 1997; 38:89-100. Yang QX, Posse S, Le Bihan D, Smith MB. Double-sampled echo-planar imaging at 3 Tesla . J Magn Reson 1996; 113:145-150. 相关问题 I've heard that \"eddy currents\" cause problems for imaging. What are they?","tags":"technique-related-artifacts","title":"Question-Nyquist N/2鬼影：在EPI上，我们经常可以看到三个重叠的图像，看起来像相位卷折伪影，这是怎么产生的？"},{"url":"http://chunshan.github.io/MRI-QA/technique-related-artifacts/gibbs-artifact.html","text":"原文链接: What is a Gibbs artifact? 概要 吉布斯伪影（Gibbs artifacts，也称为截断，振铃，或频谱泄露伪影）通常表现为紧邻高对比交界处的多条平行细线。该伪影造成的问题对于脊髓成像尤为严重，会造成脊髓比实际宽或窄，抑或造成脊髓空洞假象。 吉布斯伪影是使用傅里叶变换将磁共振信号重建为图像必然的后果。理论上，任何信号都可以用不同幅度，相位和频率的正弦波的无限求和表示。然而在磁共振成像中，仅限制采样有限的频率，也就是用傅里叶表示中相对较少的谐波近似表示图像。傅里叶级数被截断了，这也是该伪影名字的由来。 方波的傅里叶合成(Courtesy of Dr. Dan Russell, Grad. Prog. Acoustics, Penn State). 如果物体的信号强度空间上逐渐变化，仅需要很少的几个傅里叶项，截断误差并不明显。然而在高对比度的交界处，傅里叶级数的截断导致明显的伪影，表现为变化的下冲和过冲振荡。取决于贯穿高对比交界处的像素的数目，截断伪影可能有多种形式，包括交界处边缘虚假增宽，交界处边缘增强，或者紧邻交界处的组织扭曲。例如，脊髓中间信号高而边缘信号低（左图）也是截断伪影的另一种表现形式。 吉布斯（截断）伪影的其他例子 由于截断伪影是图像的傅里叶表示带来的一个基本后果，因此在相位编码和频率编码方向上都会出现。但是相位编码方向上采样数通常更少（如128或192），吉布斯伪影在相位编码方向上通常更显著。最小化截断误差可以通过增加相位编码步数或减小视野达到此目的。但是它们不能被完全消除。 各种方法，在k空间或者后处理操作数据都可以用于最小化截断伪影。被绝大多数厂商采用的一个直接方法是信号处理之前在k空间使用平滑下降的窗（Hamming或Tukey）对信号进行滤波。后处理优化技术，如Total Variation（TV）方法，也可以采用，但是更难实现。所有技术对于减少截断伪影都是有效的，尽管图像质量会略有牺牲。 高级讨论 吉布斯伪影和现象的补充说明 吉布斯（截断）伪影以19世纪数学物理学家Josiah W. Gibbs的名字命名（注意如果使用撇号，须放于\"s\"后而不是\"s\"前，也就是Gibbs'而不是Gibb's）。 在他的众多其他科学贡献中（包括热力学中的吉布斯自由能，数学中的向量点乘和叉乘符号），吉布斯研究傅里叶级数不连续时的表现。他描述了在锐利的边缘产生的过冲和振荡，这就是我们现在看到的磁共振图像中的截断伪影。 吉布斯现象一个有趣的数学特征是即使使用无限数目的傅里叶项，波纹会消失，但是在不连续处剩余8.9%的过冲会始终存在。这种不寻常的特征之所以会发生，是因为傅里叶级数是点式的，不会一致性收敛。 磁共振成像中常用的零填充（Zero-flling，ZIP）方法是造成截断伪影的原因。k空间中对低频采样等价于在频率域使用一个矩形采样窗。零填充产生的图像等价于使用一个sinc函数（sinc函数是矩形窗的傅里叶逆变换）与原始图像卷积。如果矩形窗被一个平滑下降的窗（如Hamming）代替，就可以减少截断伪影。 参考材料 Block KT, Uecker M, Frahm J. Suppression of MRI truncation artifacts using total variation constrained data extrapolation . Int J Biomed Imaging 2008; Article ID 184123:1-8. Levy LM, Di Chiro G, Brooks RA, et al. Spinal cord artifacts from truncation errors during MR imaging . Radiology 1988; 166:479-483. Czervionke LF, Czervionke JM, Daniels DL, Haughton VM. Characteristic features of MR truncation artifacts . AJR Am J Roentgenol 1988; 151:1219-1228. 相关问题 What is a Fourier transform? What produces the dark-rim artifact on cardiac perfusion MRI?","tags":"technique-related-artifacts","title":"Question-吉布斯（截断）伪影：什么是吉布斯伪影？"},{"url":"http://chunshan.github.io/MRI-QA/technique-related-artifacts/spiralradial-artifacts.html","text":"原文链接: What about wrap-around artifacts on radial or spiral imaging? it seems like they should always be present because phase-encode goes in every direction. 概要 径向/螺旋扫描方法确实也会产生卷折和其他形式的混叠伪影，但是它们的表现形式与直线（笛卡尔）扫描中看到的有些不同。 大多数径向和螺旋成像方法中，频率和相位轴不保持基本解剖方向中的固定关系（从左到右，从上到下等）。相反，相位和频率编码方向随着轨迹扫过或围绕k空间中心旋转时不断改变。当出现混叠时，通常以广泛分布于图像中的曲线带形式出现，虽然有时也会出现离散的径向排列的\"鬼影\"。 PROPELLER采集说明频率和相位编码方向如何变化取决于每一个刀片的方向 源自圆形FOV外红点（左下）的混叠被复制成图像上的一个弧 如果刀片数相对较少，FOV也比较小，可见一些离散的后脑部的混叠图像 如果使用许多刀片，混叠伪影分散地更广泛 螺旋/径向/PROPELLER成像中的\"网格化\"问题。采集的数据点与矩形阵列（用于离散傅里叶变换）并不匹配，因此须转换/插值，这会在最终的图像中引入振铃伪影和混叠伪影。 在PROPELLER图像的背景中通常可见一种不同形式的伪影，包含弥散的晕开的细线或条纹。这是由网格化导致的重建伪影，此过程中径向/螺旋模式采集的数据点必须转变/插值以适合等间隔的矩形阵列，然后用于图像处理。如果使用线性插值，整个图像中会有简单的阴影，但如果使用更高阶的插值机制，更复杂的振荡会混叠到图像中，偶尔会形成高信号物体边缘的明亮条纹，类似于CT中骨或金属周围看到的现象。 弥散的径向重建伪影 PROPELLER图像中右侧脸颊上高信号区域的细条纹 参考材料 Pipe JG. Motion correction with PROPELLER MRI: application to head motion and free-breathing cardiac imaging . Magn Reson Med 1999; 42:963-969. Patch SK. k-Space data preprocessing for artifact reduction in MR imaging . Multidimensional Image Processing, Analysis, and Display: RSNA Categorical Course in Diagnostic Radiology Physics 2005; pp 73–87. Rasche V, Proska R, Sinkus R, et al. Resampling of data between arbitrary grids using convolution interpolation . IEEE Trans Med Imaging 1999;18:385–392. 相关问题 螺旋桨技术如何减少运动伪影？","tags":"technique-related-artifacts","title":"Question-径向/螺旋伪影：径向或螺旋成像中的卷折伪影如何？看起来卷折伪影应该总是存在，因为在每个方向上都要相位编码。"},{"url":"http://chunshan.github.io/MRI-QA/technique-related-artifacts/frequency-wrap-around.html","text":"原文链接: Why aren't wrap-around artifacts seen in the frequency-encode direction, too? 概要 卷折（混叠（aliasing）的一种）是数字信号处理的一种基础现象，理论上在相位编码和频率编码方向上都会出现。这一现象的基础如右图所示，高频信号的采样频率不够，被错误地当做低频信号。这种高频信号错配到低频会导致MR图像空间上的模糊，或卷折伪影。 为了避免频率混叠，磁共振信号的数字采样频率必须至少是信号最高频率的两倍，这个关键的采样频率称为Nyquist频率。如果采样频率低于Nyquist频率，高频信号被错认为低频信号的情形就会发生。 与在相位编码方向上的混叠不同，频率编码方向上的混叠在现代临床磁共振成像中通常不是问题。这是因为频率混叠被两种方法基本消除了：1）信号过采样；2）图像重建前的带通滤波。 过采样意味着采集了比显示所需分辨率更多的磁共振信号数据。在大多数现代磁共振扫描仪中，每个回波期间要采集512-1024次磁共振信号（虽然频率编码方向上的显示分辨率通常取为256）。换句话说，Nyquist采样率是信号最高频率的2-4倍。因为这项任务仅通过增加采样电路的数字化频率就可以完成，基本没有时间上的损失。 大多数磁共振扫描仪中默认的频率过采样系数为2倍，虽然此过采样因子是可调的。不同厂商对此技术也有不同的称呼，\"频率过采样（frequency oversampling）\"（Siemens，Philips，Hitachi），\"抗混叠（anti-aliasing）\"（GE），\"频率卷折抑制（frequency-wrap suppression）\"（Toshiba）。 带通滤波可以是模拟的，数字的或混合的，这种方法可以消除假的高频分量。这种滤波器允许期望带宽内的所有频率成分通过，但衰减/拒绝选择范围之外的频率分量。 由于在图像重建前对原始磁共振信号的过采样和滤波，现代MRI中频率编码方向上的混叠在不知不觉中被有效消除了。 参考材料 Pusey E, Yoon C, Anselmo ML, Lufkin RB. Aliasing artifacts in MR imaging. Comput Med Imag Graphics 1988;12:219-224. 相关问题 什么是混叠？","tags":"technique-related-artifacts","title":"Question-卷折方向：为什么卷折伪影在频率编码方向上看不到？"},{"url":"http://chunshan.github.io/MRI-QA/technique-related-artifacts/phase-oversampling.html","text":"原文链接: How does phase oversampling eliminate the wrap-around artifact? 概要 卷折伪影 相位过采样，也被称为\"非相位卷折\"，是一种减少或消除卷折伪影（wrap-around artifacts）的技术。像在 前一个Q&A 中描述的，相位卷折是混叠的一种形式，当物体的解剖尺寸超出了定义的视野（FOV）时便会发生。物体超出FOV的部分在频率上出现错误，折叠到图像的边缘。卷折几乎只在相位编码方向出现。 减少或消除相位卷折伪影的几个直接的方法在 前面的Q&A 中已经讨论了，包括：1）增加FOV；2）交换相位和频率轴；3）使用表面线圈；4）应用饱和带。 所有的制造商也提供相位过采样技术控制相位卷折，这也是本Q&A的主题。如你所想到的，主要厂商对这一技术的命名并不相同：\"相位过采样（Phase oversampling）\"（Siemens），\"非相位卷折（No phase-wrap）\"（GE），\"卷折抑制（Fold-over suppression）\"（Philips），\"反卷折（Anti-wrap）\"（Hitachi），\"相位卷折抑制（Phase-wrap suppression）\"（Toshiba）。 所有的厂商都使用相同的技术，只有轻微的变化，说明如下。这个例子说明了100%相位过采样的情况，实际上大多数扫描仪上过采样因子是一定范围内可调节的。 相位过采样需要四个步骤，如果扫描仪软件中选择相位过采样这个选项，四个步骤就会自动进行。（1）相位编码方向上的视野（FOV）翻倍，（2）相位编码步数（Np）翻倍，（3）激励次数减半，（4）仅显示重建图像的中间部分。步骤（1）和（2）保证空间分辨率与不使用相位过采样时相同。步骤（3）保证信噪比和成像时间。 尽管理论上使用相位过采样技术不会有额外损失，但还是有一些限制和特殊的考虑。首先，相位过采样不能与一些专门的多段技术（如POMP）结合使用，因为这些技术也要求增加FOV并且改变相位偏移。其次，由于激励次数减少以保证成像时间不变，相位过采样技术仅在原先采用至少两次激发的扫描中会没有时间损失。单次激发序列中也可以使用相位过采样，但需要使用半傅里叶（\"½ NEX\"）成像，会造成信噪比下降，相位错误增加。 最后，相位过采样技术不能阻止视野外组织的噪声和运动引入的相位偏移传播到成像体积（虽然对于稳定的组织可以有效去除）。例如，在矢状位颈椎检查中，如果相位编码方向是从上到下，图像质量仍然会因为呼吸和心脏搏动伪影导致退化，虽然心脏和胸部视觉上都没有卷折到脊椎图像中。 参考材料 Axel L, Morton D. Correction of phase wrapping in magnetic resonance imaging . Med Phys 1989;16:284-287. Heiland S. From A as in aliasing to Z as in zipper: artifacts in MRI . Clin Neuroradiol 2008; 1:25-36. Pusey E, Yoon C, Anselmo ML, Lufkin RB. Aliasing artifacts in MR imaging. Comput Med Imag Graphics 1988;12:219-224. Zhuo J, Gullapalli RP. AAPM/RSNA physics tutorial for residents . MR artifacts, safety, and quality control. Radiographics 2006;26:275-297. 相关问题 为什么会发生相位卷折伪影？","tags":"technique-related-artifacts","title":"Question-非相位卷折：相位过采样如何消除卷折伪影？"},{"url":"http://chunshan.github.io/MRI-QA/technique-related-artifacts/eliminate-wrap-around.html","text":"原文链接: How do I get rid of phase wrap-around artifacts? 概要 消除相位卷折伪影最简单的方法是增加相位的视野（FOV）使得覆盖扫描对象相位编码方向上整个的解剖尺寸。这个解决方案在下图说明，显示卷折随着相位FOV从15cm增加到20cm再到30cm过程中如何逐步消除。 FOV = 15 cm FOV = 20 cm FOV = 30 cm 上述方法也不是全无代价的，FOV增加空间分辨率就会受损失。为了保持空间分辨率，相位编码步数就必须增加。相位卷折可以被消除，但是成像时间会增加。 一种替代策略是，交换频率编码轴和相位编码轴使得扫描对象较短的维度正好在相位编码方向上。但是如果FOV非常小，对象短的解剖维度仍会超出视野，相位卷折还是会发生。此外，交换相位和频率轴也会引入其他不同的非期望的伪影（如运动引起的相位鬼影或化学位移伪影），因此限制了这种简单策略的实用性。 另一组技术通过最小化视野之外组织的信号消除相位卷折伪影。这些技术包括使用表面线圈（不能检测远离线圈的信号），在视野外应用饱和脉冲（消除视野外的信号）。 最后，\"相位过采样（phase oversampling）\"或者\"非相位卷折（no-phase-wrap）\"技术也可在很大程度上消除大多数情况下的相位卷折伪影。这些技术是 下面Q&A 的主题。 参考材料 Axel L, Morton D. Correction of phase wrapping in magnetic resonance imaging . Med Phys 1989;16:284-287. Heiland S. From A as in aliasing to Z as in zipper: artifacts in MRI . Clin Neuroradiol 2008; 1:25-36. Pusey E, Yoon C, Anselmo ML, Lufkin RB. Aliasing artifacts in MR imaging. Comput Med Imag Graphics 1988;12:219-224. Zhuo J, Gullapalli RP. AAPM/RSNA physics tutorial for residents . MR artifacts, safety, and quality control. Radiographics 2006;26:275-297. 相关问题 为什么会发生相位卷折伪影？","tags":"technique-related-artifacts","title":"Question-减少卷折：如何消除相位卷折伪影？"},{"url":"http://chunshan.github.io/MRI-QA/technique-related-artifacts/wrap-around-artifact.html","text":"原文链接: Why does the phase wrap-around artifact occur? 概要 相位卷折（Phase wrap-around）是一种常见的磁共振伪影，当一个物体的尺寸超出了定义的视野（field-of-view，FOV）就会发生，这是混叠（aliasing）现象的一种特殊表现，在前一个 Q&A 中已经有描述。混叠是当数字采样频率太低时信号频率的错误分配。 卷折伪影非常容易识别，表现为视野外的解剖结构折叠到感兴趣区域中。尽管该现象也会发生在频率编码方向，通常沿相位编码方向更严重。 卷折伪影的起因 3DFT图像中的卷折 在3D成像中，末端的层面之间也会发生相位卷折伪影。对于3D傅里叶变换（体积）成像，相位编码用于定义各个层面。如果成像体积在层面选择方向超出了视野，在3D分区末端的层面之间也会发生相位卷折伪影。在右图3D头部MRI检查中，头顶部的头皮脂肪（白色椭圆）卷折叠加到颅底的组织上。 参考材料 Axel L, Morton D. Correction of phase wrapping in magnetic resonance imaging . Med Phys 1989;16:284-287. Heiland S. From A as in aliasing to Z as in zipper: artifacts in MRI . Clin Neuroradiol 2008; 1:25-36. Pusey E, Yoon C, Anselmo ML, Lufkin RB. Aliasing artifacts in MR imaging. Comput Med Imag Graphics 1988;12:219-224. Zhuo J, Gullapalli RP. AAPM/RSNA physics tutorial for residents . MR artifacts, safety, and quality control. Radiographics 2006;26:275-297. 相关问题 相位过采样如何消除卷折伪影？ 为什么卷折伪影在频率编码方向上看不到？ 什么是混叠？","tags":"technique-related-artifacts","title":"Question-磁共振伪影：为什么会发生相位卷折伪影？"},{"url":"http://chunshan.github.io/MRI-QA/technique-related-artifacts/aliasing.html","text":"原文链接: What is aliasing? 概要 混叠(aliasing)是指由于数字采样频率不充分导致信号的频率测量得不准确。如果信号没有采样足够多的数据点，它的真实频率就会被低估。这种错误估计的信号将无法与另外真实低频率的信号进行区分（即混叠在一起）。 要正确地测量信号，数字采样频率必须至少为信号所含最高频率的两倍。这就是Nyquist采样定理（Nyquist sampling theorem）。 这种混叠现象不仅在磁共振成像中存在，而是存在于各种技术中，例如声音的失真，照片中的波纹状条纹，电影中不自然的动作等。\"货车车轮效应\"是一个常见的混淆现象的例子，在这个视觉错觉中，取决于视频中的数字帧率，车轮上的轮辐看起来会以不同的速率旋转，甚至会后退。 混叠是磁共振中一种重要的现象，是一种常见伪影（相位卷折，在下面几个Q&A中讨论）的根源。混叠伪影的其他形式包括MRS中远处体素的波谱污染和MRA中流速或流向的测量错误。混叠现象也可以利用，它也是并行成像技术如SENSE和GRAPPA的基础。 这种现象的物理基础可见如下的说明。注意到对相位编码梯度的每一个值，会分配相位周期的一个特定数字覆盖扫描视野。比如，在第一阶段相位编码步骤中，0°和360°之间的相移涵盖整个扫描视野，物体超出视野的部分，其相位小于0°，或大于360°。举例来说，示意图中的腹部左侧，超出了视野，相移为361°到450°。由于此相位编码步骤中所有有意义的频率已被定义到0°到360°之间，361°相移会被分配到1°相移的空间位置，450°相移会被分配到450°-360°=90°的空间位置。患者身体的左侧就会卷折，空间上错配到图像对侧（右）。患者的右侧卷折到左侧也是类似的过程。 参考材料 \"Aliasing\" . Wikipedia, the Free Encyclopedia. Oldhasusen BA. Aliasing . (Lecture notes for Vision Science course, UC Davis, 10 Oct 2000, available on-line) 相关问题 为什么会发生相位卷折伪影？","tags":"technique-related-artifacts","title":"Question-混叠：什么是混叠？"},{"url":"http://chunshan.github.io/MRI-QA/technique-related-artifacts/slice-overlap.html","text":"原文链接: Why are there dark bands over the lumbar spine? 概要 你看到的暗带是由于使用多个重叠的倾斜层面导致的信号损失。重叠区域的质子比其他非重叠区域（单个层面）的质子接受双倍，三倍甚至更多倍数的射频照射。因此，它们的稳态磁化强度在饱和时降低。 这个问题的解决方案是在一次图像扫描过程中不要使得层面重叠，或者如果必须要重叠则进行不同的扫描。也就是说，应该使用级联采集模式而不是连续采集模式扫描倾斜层面的图像。 参考材料 Simmons A, Tofts PS, Barker GJ, Arridge SR. Sources of intensity nonuniformity in spin echo images at 1.5T . Magn Reson Med 1994: 32:121-128. 相关问题 What is cross-talk and what can be done about it?","tags":"technique-related-artifacts","title":"Question-层面重叠/干扰：为什么在腰椎上有暗带？"},{"url":"http://chunshan.github.io/MRI-QA/technique-related-artifacts/partial-volume-effects.html","text":"原文链接: What is meant by \"partial voluming\"? 概要 部分容积效应/伪影是一个在断面成像中广为人知的一个概念，概念很简单甚至可以不包含在这个Q&A网站中。但是，这个概念非常重要，为了非放射学相关的人能够理解这里的话题，所以我提供简要的解释和一些例子。 参考下面这个例子，部分容积的概念很容易理解。这儿的红色和黄色圆圈表示脑脊液（CSF，蓝色）中的神经和瘢痕组织，它们各自的磁共振图像显示在下面。左边的图示和图像为5毫米厚，右边的图示和图像为1毫米厚。5毫米厚的体素分辨率低，反映的是神经/瘢痕与脑脊液的混合信号；右边的薄层图像混合信号更少，各种不同的组织之间有清晰的边界。 部分容积平均效应。5毫米厚层图像（左）蛛网膜下腔中精细的神经 和瘢痕不能分辨出来，因为图像中的信号是脑脊液和其他组织的混合/平均。 薄层（1毫米厚）图像（右）显示更详细的解剖结构，更有优势。 从数学上讲，考虑一个包含A和B两种材料的体素，占比分别为fA和fB，整个体素的磁共振信号（SV）反映的是分别来自两种成分层面的信号SA和SB的加权平均 SV = fASA + fBSB 不完美的射频脉冲轮廓会激发期望层面外部的组织，也会导致部分容积效应。如果多个层面放在一起，这种干扰称为cross-talk（串扰）。 减少部分容积效应的主要策略是使用更小，更清晰的体素。这意味着使用更薄的切片，更小的视野（FOV），和(或)更大的成像矩阵尺寸。使用持续时间更长的射频脉冲（或至少避免使用\"fast-RF\"脉冲选项）会改进层面的轮廓，创造更多精确的体素，减少相邻组织的激发。 参考材料 Kneeland JB, Shimakawa A, Wehrli FW. Effect of intersection spacing on MR image contrast and study time . Radiology 1986; 158:819-822. Simmons A, Tofts PS, Barker GJ, Arridge SR. Sources of intensity nonuniformity in spin echo images at 1.5T . Magn Reson Med 1994: 32:121-128. 相关问题 What is cross-talk and what can be done about it?","tags":"technique-related-artifacts","title":"Question-部分容积效应：什么是部分容积效应？"},{"url":"http://chunshan.github.io/MRI-QA/motion-related-artifacts/propellerblade.html","text":"原文链接: How does PROPELLER reduce motion artifacts? 概要 PROPELLER序列的数据采样带采用围绕k空间中心旋转的方式 螺旋桨（Periodically Rotated Overlapping ParallEL Lines with Enhanced Reconstruction， PROPELLER）技术是20世纪90年代末期由Pipe发明的减少运动伪影的方法。基本思想是以旋转的方式使用一组组径向直线条（或称为\"刀片\"）对k空间进行采样。 每一个刀片由多个平行的相位编码扫描线组成，这些扫描线可以使用快速自旋回波或梯度回波。实践中，通常一次激发采集8-32个刀片线，刀片以很小的角度（10°-20°）旋转，然后采集第二组数据。这个过程一直持续到整个k空间的成像数据都已收集。 PROPELLER填充k空间的轨迹有一些独特的优势。k空间的中心（信号幅度最高，对图像对比度贡献最大）过采样，意味着信号噪声比和对比度噪声比比较高。这个区域的过采样还提供了冗余信息，意味着新刀片的数据可以与来自前一个刀片的数据比较一致性。如果患者在两个刀片之间有运动，第二个刀片的数据可以基于其中心信息不一致的程度进行校正（甚至被全部丢弃）。 PROPELLER重建算法包括以下几个步骤：1）对每一个刀片进行相位校正保证其旋转的支点恰好位于k空间的中心；2）物体平面内旋转和平面内平移的修正；3）相关加权用于最小化刀片数据中包含的运动和位移误差。现在PROPELLER的2D版本仅能校正平面内运动，3D版本未来可能会克服此限制。复杂的重建过程在扫描结束后还需要额外的一些时间，用我们目前的计算机硬件，对一个大数据集需额外延迟大约15+秒才能开始下一个序列。 PROPELLER作为最受欢迎的磁共振序列，所有主要厂商都有自己的小变化，而且有自己好听的名字：GE（PROPELLER），SIEMENS（BLADE），Philips（MulitVane），Hitachi（RADAR）和Toshiba（JET）。 PROPELLER技术对运动校正的程度可能是实质性地，通常用于DWI，FLAIR和T2加权图像，任何患者都可以使用，我们期待此技术可以使得患者在扫描过程中不用静止不动。由于对k空间的过采样，磁敏感伪影也有轻微减少。一个例子如下所示。 没有PROPELLER，常规FSE图像中出现患者运动伪影 使用PROPELLER，运动伪影显著减少 高级讨论 关于PROPELLER成像的进一步评论： 虽然k空间中心高度过采样，k空间的\"角落\"完全没有采样到。然而，这些位置仅仅对最终图像中倾斜角度上的高空间频率信息有贡献，所以通常被认为是k空间中最不重要的区域。如果每个刀片有L条线，共N个刀片，成像矩阵的等价直径M可表达为LN = πM/2 使用PROPELLER方法，k空间圆的完全覆盖（刀片之间没有空隙）需要比笛卡尔（矩形）k空间填充方法长约π/2 ≈ 1.57倍。刀片重叠的程度（两个相邻刀片之间的角度）通常是操作者可选的百分比形式的参数，制造商对此参数也有不同的名字，\"blade coverage factor\" (Siemens), \"MultiVane percentage\" (Philips), \"k-space filling factor\" (Toshiba)。覆盖因数为157%是无缝覆盖，覆盖因数为100%与笛卡尔方法相比不会有时间上的损失但是两个刀片末端将会有间隙。如果使用低于100%的覆盖因数进行扫描将会有更明显的条状伪影。覆盖因数更高的扫描伪影更少，信噪比更高，代价是扫描时间更长。通常在临床实践中选择100%到157%之间的某个值。 参考材料 Hirokawa Y, Isoda H, Maetani YS, et al. MRI artifact reduction and quality improvement in the upper abdomen with PROPELLER and Prospective Acquisition Correction (PACE) technique . AJR Am J Roengenol 2008;191:1154-1158. Pipe JG. Motion correction with PROPELLER MRI: application to head motion and free-breathing cardiac imaging . Magn Reson Med 1999; 42:963-969. van Loon L. Tips for robust motion correction in liver imaging using MultiVane . Philips NetForum Community, 30 Jan 2014. 相关问题 What about wrap-around artifacts on radial or spiral imaging? it seems like they should always be present because phase-encode goes in every direction.","tags":"motion-related-artifacts","title":"Question-螺旋桨/刀锋：螺旋桨技术如何减少运动伪影？"},{"url":"http://chunshan.github.io/MRI-QA/motion-related-artifacts/navigator-echoes.html","text":"原文链接: What are navigator echoes and how do they reduce motion artifacts? 概要 导航器是动态跟踪解剖运动的额外的射频脉冲，特别是跟踪膈肌上下运动的位置。导航脉冲可以是自旋回波（SE），也可以是梯度回波（GRE）。 导航器最简单的形式是在scout图像上在肝脏的圆顶部用图形标出。导航器可以在单一平面上标示（左图），也可以使用两个感兴趣带（右图）形成更准确的\"铅笔束\"或柱形束。导航带通常1-2cm宽，沿束方向的空间分辨率则是1mm左右。 冠状位scout图像上标示的单一导航 在横断位图像上两个感兴趣带标示的导航 肝（下部灰色带）随呼吸运动的导航数据的M型显示。暗色区域是肺 导航器返回的回波信号在读出（运动）方向重建，显示为沿束方向的线状数据。这种技术是线扫描成像的一种形式，也被成为M型显示，因为相当于M型超声心动图中观察心脏瓣膜运动的方式。 软件自动检测膈肌运动的波峰和波谷。磁共振技师可以进一步定义哪些位置采集的数据允许排除在外，通常还可以设置一定的容忍度，一般3-6mm。 根据导航回波得到的信息可以在呼吸周期的特定阶段触发数据采集，也可以用于根据呼吸导致的器官位移调整一组片层的位置。使用呼吸管时的触发和相位重排算法也同样可以用于导航扫描中。 虽然导航器主要用于追踪膈肌运动，但是也可以放置在任何移动的物体上，比如心脏。导航回波经常被集成到多次激发的弥散加权脉冲序列中，用于图像采集时运动的自我校正。导航回波通常在功能磁共振检查中用来监测和校正头部的轻微运动。整个头颅可以使用球形导航器在三维空间中进行追踪。 高级讨论 关于导航器的补充： 一个并行成像线圈可以用于监测导航器，或者也可以使用整个体线圈。 导航器可以在数据采集之前，之后或者都使用。跟踪导航器可以用于确定膈肌在数据采集前后是否已经恢复到相同的位置。如果前导导航器和跟踪导航器的位置差异超过了预设的阈值，相应的数据就会被废弃并重新采集。 切片跟踪技术会在扫描体移动到患者几乎相同的解剖位置时进行每次采集。如果成像堆栈的跟踪位置根据感兴趣解剖器官的实际位置而动态调整，就需要使用前导导航器，门控和跟踪可以同时进行。 导航门控的水平位置在采集过程中可能会漂移。在多数扫描器中可以在扫描中使用自动检测机制连续检测并更新呼气水平来校正这种漂移。 一些扫描仪中还可以使用多个导航束。 二维导航方法（如Siemens的2D PACE和Philips的MotionTrak）有一些比线扫描方法更具优势的地方。二维方法使用螺旋轨迹填充k空间，因此激发是圆柱形。这样的饱和伪影不太广泛，特别是小翻转角度时。 2D螺旋射频导航器可以通过改变翻转角和周期数进行修改。更少的周期导致更短的脉冲持续时间和更少的偏共振问题，但是会导致射线束附近出现更严重的混叠环状伪影。二维射频脉冲的形状通常是块状或jinc状，后者的激发轮廓更好。 参考材料 Ehman RL, Felmlee JP. Adaptive technique for high-definition MR imaging of moving structures . Radiology 1989; 173:255-263. Welch EB, Manduc A, Grimm RC et al. Spherical navigator echoes for full 3D rigid body motion measurements in MRI . Magn Reson Med 2002; 47:32-41. 相关问题 How can navigators track heart position if placed on the diaphragm?","tags":"motion-related-artifacts","title":"Question-导航回波：什么是导航回波？导航回波如何减少运动伪影？"},{"url":"http://chunshan.github.io/MRI-QA/motion-related-artifacts/respiratory-comp.html","text":"原文链接: What is respiratory compensation? How does this differ from respiratory gating? 概要 如果呼吸模式比较规律，简单的呼吸门控对于减少运动伪影还是比较有效的。用带子或波纹管检测胸部扩张，呼吸曲线也显示在技师的控制台软件上，在呼吸曲线上选择触发数据采集的时间点。通常采集窗选择在呼气结束时，此时膈肌运动最小。由于仅在呼吸周期中的部分时间进行数据采集，简单的呼吸门控会延长成像时间50%-300%。 简单呼吸门控。仅在呼气结束膈肌运动最小时进行数据采集。 与简单呼吸门控相比，呼吸补偿技术在整个呼吸周期连续采集数据。在呼气时进行低幅度相位编码采集（对运动非常敏感），在呼吸周期的其他时间进行高幅度相位编码采集（对运动不怎么敏感）。 最初的呼吸补偿方法是由Picker在1980年代发明，被称为ROPE（Respiratory Ordered Phase Encoding），现在主要的磁共振厂商都提供了此技术的变种，名字如\"Respiratory Comp\"（GE, Toshiba），\"PEAR\"（Phase Encoded Artifact Reduction, Philips），\"PERRM\"（Phase Encode Reordering to Reduce Motion, Hitachi）。这些方法可以有效抑制运动伪影，尤其对短TR成像。时间损失也比较轻微，大约10-15%（不包括安装和校准波纹管的时间）。典型的结果如下图所示。 没有呼吸补偿的图像 根据呼吸相位重排的图像 高级讨论 不同厂商提供的呼吸补偿方法有些许变化和不同的选项。GE提供了\"high sort\"选项，类似于他们的\"No Phase Wrap\"技术。GE的\"high sort\"技术中，相位编码方向上的FOV和相位编码步数翻倍，而激发次数（NEX）减半。这有将呼吸运动伪影传播更远的效果，许多伪影就此移到显示FOV的外边。这种技术的缺点是血管运动导致的伪影可能会增加。 参考材料 Bailes DR, Gildendale DJ, Bydder GM et al. Respiratory ordered phase encoding (ROPE): a method for reducing respiratory motion artifacts in MR imaging . J Comput Assist Tomogr 1985; 9:835-838. (The original method. Most respiratory compensation techniques in use today employ a variant or ROPE known as COPE - central ordered phase encoding). Ehman RL, McNamara MT, Pallack M, et al. Magnetic resonance imaging with respiratory gating: techniques and advantages . AJR Am J Roentgenol 1984; 143:1175-1182. Lewis CE, Prato FS, Drost DJ, Nicholson RL. Comparison of respiratory triggering and gating techniques for the removal of respiratory artifacts in MR imaging . Radiology 1986; 160:803-810. 相关问题 怎么做心跳和呼吸门控?","tags":"motion-related-artifacts","title":"Question-呼吸补偿：什么是呼吸补偿？与呼吸门控有何不同？"},{"url":"http://chunshan.github.io/MRI-QA/motion-related-artifacts/gating-methods.html","text":"原文链接: How are cardiac and respiratory gating performed? 概要 减少心跳和呼吸伪影最古老最直接的方式是将磁共振数据采集与心跳或呼吸周期同步。这个过程称为门控或触发。这两个术语通常交替使用。 然而，最严格意义上讲，触发是一种前瞻性门控，只有当检测到所需的生理事件（如一个R波，脉搏，或呼吸的特定阶段）后才开始磁共振数据的的采集。门控则是一个比触发更宽泛的术语，既可以是前瞻性的，也可以是回顾性的。在回顾性门控中，磁共振数据被连续采集（不需要特定的心跳或呼吸\"触发\"事件），心电图，脉搏或呼吸水平也与磁共振数据同时记录。之后对磁共振数据进行重新排序，分组或与心肺周期的不同阶段相关联。回顾性门控通常用于心脏电影运动的研究方法。 前瞻性心脏门控（触发）在两个R波之间特定的采集窗口内采集数据。回顾性门控持续地采集数据，然后根据心跳周期的不同阶段分组并且填充k空间。 心跳门控 外周脉搏传感器（光电）（来自www.biopac.com） 心脏收缩可以通过心电图或脉搏传感器检测。对于心脏成像（通常也包括下胸部成像），必须要基于一些心电图类型的触发。由于从心脏收缩到脉搏波到达手指时间比较长而且延迟不可预测，脉搏门控不能用于心脏成像。脉搏门控通常用于外周磁共振血管造影或者用于脑脊液流动电影的研究。 心跳和脉搏门控特别可靠，除了室性心律失常的情况，被广泛使用。这些方法需要专门的硬件和软件，通常在每次扫描前还需要额外几分钟时间设置这些硬件和软件。另外的限制是重复时间（TR）不能自由选择，必须是心跳间隔的倍数。 呼吸门控 下胸和上腹部的影像学检查需要一些方法能够冻结膈肌的运动。对配合的患者，可以使用简单的屏气配合快速成像技术如HASTE或SS-EPI。对不配合的患者或者超过20-30秒的检查（患者的平均屏气极限），必须使用某种类型的呼吸门控技术。 气动呼吸带和传感器（来自www.biopac.com） 可以通过使用胸带，波纹管或坐垫等检测呼吸扩张。对胸式呼吸，胸带应环绕下胸部放置，对腹式呼吸，胸带应环绕中腹部放置。也有测量呼吸过程中绕胸电阻抗变化的装置，但是不常用。 简单的呼吸门控需要仅在呼吸周期的有限部分采集图像，有显著的时间损失（高达非门控检查的3倍时间）。因此很少使用纯粹的前瞻性呼吸门控，但是仍然使用回顾性补偿方法，根据呼吸时相对图像数据进行收集或重排。近年来使用导航回波跟踪膈肌运动已经成为进行呼吸触发最流行的方法。 下面的图片说明了简单的前瞻性心跳和呼吸门控在提高胸部和上腹部磁共振图像质量中的作用，单独使用和联合使用心跳和呼吸门控。 没有门控 只有心跳门控 只有呼吸门控 既有心跳门控又有呼吸门控 参考材料 Chia JM, Fischer SE, Wickline SA, Lorenz CH. Performance of QRS detection for cardiac MRI with a novel vectorcardiographic triggering method . J Magn Reson Imaging 2000; 12:678-688. Ehman RL, McNamara MT, Pallack M, et al. Magnetic resonance imaging with respiratory gating: techniques and advantages . AJR Am J Roentgenol 1984; 143:1175-1182. Lanzer P, Barta C, Botvinick EH, et al. ECG-synchronized cardiac MR imaging: method and evaluation . Radiology 1985;155:681–686. Santelli C, Nezafat R, Goddu B, et al. Respiratory bellows revisited for motion compensation: preliminary experience for cardiovascular MR . Magn Reson Med 2011; 65:1097-1102. 相关问题 How do you set the various parameters for a cardiac gated study, such as repetition time (TR), trigger delay, and trigger window? Is cardiac gating the same as triggering? 什么是呼吸补偿？与呼吸门控有何不同？","tags":"motion-related-artifacts","title":"Question-门控/触发简介：怎么做心跳和呼吸门控？"},{"url":"http://chunshan.github.io/MRI-QA/motion-related-artifacts/saturation-pulses.html","text":"原文链接: How do saturation pulses work? 概要 饱和脉冲使用射频能量抑制成像区域外运动组织的磁共振信号达到减少或消除运动伪影的目的。有三种类型的饱和脉冲。 空间饱和脉冲 是空间选择性的90°脉冲将磁化翻转到横向平面。与用于成像的90°激发脉冲不同，空间饱和脉冲使用不同的载波频率发射，并且被设计为跨饱和带产生最大的相位分散，不使用切片复相叶。实际中，空间饱和脉冲后会紧接着在相位编码轴和频率编码轴上施加很强的扰相梯度进一步抑制残余的横向磁化。 Siemens, Hitachi, 和Toshiba称空间饱和脉冲为\"Presat pulses\"，GE称之为\"Sat pulses\"，Philips称之为\"REgional Saturation Technique (REST)\"。技师在扫描图像前会将空间饱和带在scout图像中用图形标示出来。它们的角度，中心和宽度都可以调整，一般的厚度在5-10cm的范围。 空间饱和带放置在前颈部以减少吞咽伪影传到脊柱上 动脉饱和脉冲抑制成像切片中的流动伪影。为了抑制静脉血流，需要选择切片相反侧的饱和带。 流动饱和脉冲 是用于抑制不需要的血管流动伪影进入成像切片的空间选择性饱和带。饱和带在平行于成像切片上游几厘米处施加（最优位置依赖于血流速度）。虽然在常规成像中多数被用于抑制动脉血流，在飞行时间（time-of-flight，TOF）磁共振血管造影中，血管饱和带被用于抑制静脉血流。 TOF MRA中，在多层图像采集过程中，静脉饱和脉冲与成像切片有固定的偏移。不同的制造商对这些移动的血管饱和脉冲有不同的名字： GE (\"walking sat\"), Siemens (\"travel sat\" 或 \"tracking sat\"), Philips (\"travel REST), Hitachi (\"sequential pre-sat\"), Toshiba (\"BFAST\")。 没有施加流动饱和脉冲的腹部T1加权像，有明显的来自主动脉的伪影。 上游使用流动饱和脉冲后减少了主动脉伪影，消除了血管流动伪影。 频谱饱和脉冲 基于其化学位移抑制一种特殊的化学物质，通常是脂肪，也被称为脂肪饱和或化学位移选择（Chemical Shift Selective，CHESS）。这些射频脉冲的持续时间很短，而且被调谐到脂肪的共振频率，在磁共振成像序列开始之前立刻施加。化学选择脉冲使得脂肪信号消失（被饱和）然而水信号相对不受影响。由于运动的皮下脂肪是运动伪影的主要来源，整幅图像中抑制脂肪信号也就减少了运动伪影。这些脉冲的设计和使用在一个单独的 Q&A 中有更完整的讨论。 高级讨论 第四种重要的射频脉冲类型称为 空间频谱脉冲（Spatial-Spectal (SPSP) Pulse） 。这可以视作空间饱和脉冲和频谱饱和脉冲的混合，在特定的位置使用特定的频谱激发磁化。 空间频谱（SPSP）脉冲比分别的两种脉冲持续时间更短，对B1场不均匀性有更好的容忍度。SPSP有许多变种，但是所有变种都含有广谱射频包络下的多个射频子脉冲，此射频包络有并发的震荡双极性层面选择梯度。SPSP脉冲越来越常用，尤其是在平面回波和螺旋采集技术中。 参考材料 Felmlee JP, Ehman RL. Spatial presaturation: a method for suppressing flow artifacts and improving depiction of vascular anatomy in MR imaging . Radiology 1987;164:559 –564. Rosen BR, Wedeen VJ, Brady TJ. Selective saturation NMR imaging . J Comput Assist Tomogr 1984;8:813-818. 相关问题 How do Fat-Sat pulses work?","tags":"motion-related-artifacts","title":"Question-饱和脉冲：饱和脉冲如何起作用？"},{"url":"http://chunshan.github.io/MRI-QA/motion-related-artifacts/reducing-motion-artifacts.html","text":"原文链接: How can motion artifacts be reduced or eliminated? 概要 幸运的是，有很多策略可用于减少或消除运动伪影。下文概述了这些策略，后续的Q&A会单独详细介绍每一个策略。 1.运动的程度最小化 不可低估教育/指导病人在扫描仪发出噪音时仍要保持静止的重要性。屏住呼吸的预扫描训练和练习可能会有帮助。 应使得病人在扫描仪中尽可能舒服，包括背部，腿部或头部支撑。稳定措施包括使用泡沫垫，胶带，舒适的包裹床单，甚至咬筋都是有用的。婴儿应进行束缚并且头部需得到支撑。 对不合作的患者或那些高度焦虑或疼痛的患者，需服用镇静剂或者全身麻醉。 一些生理运动如蠕动可以通过合适的药物（如胰高血糖素1毫克）降低。 2.抑制运动组织的信号 使用限制在感兴趣区域的表面线圈会使得来自更远的运动组织的不必要信号最小化。一个很好的例子是使用脊柱线圈阵列，运动的前腹壁信号由于距离的原因会自然地衰减。 空间饱和脉冲可以消除不需要的运动组织的信号。 脂肪抑制技术（如STIR，CHESS等）会消除来自皮下脂肪和邻膈脂肪的高信号，它们通常是运动伪影的成因。 流动饱和序列会抑制来自动脉或静脉血流进入一个片层的信号。 3.调整成像序列和参数 增加信号平均的次数（NSA，NEX）会减少伪影并且增加信噪比，但是会增加成像时间。 交换频率编码和相位编码方向会改变伪影的方向，但不会减少伪影。 单层超快序列（HASTE，EPI，True FISP）获取图像的速度足够快（2-5s），可以冻结大多数运动，不需要屏气或其他额外的特殊技术。 径向/螺旋序列比使用笛卡尔轨迹的序列在分散运动伪影上更有效。 流动补偿技术（FlowComp，GMN）通过信号的梯度回聚可以减少来自流动的血液和脑脊液的伪影。 4. 运动检测与补偿 基于硬件的用于呼吸或心血管运动的门控方法被广泛使用。可通过使用一个胸带或波纹管检测呼吸扩张。心血管运动可以通过心电图或脉搏检测装置进行检测。一旦检测到，磁共振脉冲序列可以在心动周期，呼吸周期，或二者兼顾的一个特定时间中前瞻性地触发。也可以进行回顾性门控，在这种技术中，不断获取MR数据，依据心肺循环的时序回顾性对采集时间点进行重排或者丢弃。 导航回波技术（例如，PACE）使用额外的射频脉冲来跟踪心脏或膈肌的位置。导航回波信息可用于前瞻性地触发数据采集或回顾性地调整一组已获得的图像的位置。 自我修正的序列（PROPELLER，BLADE）在k空间的中心过采样，可以检测平面内旋转或平移。异常切片通过一个迭代过程可以被拒绝或重新调整与其他切片的位置。 根据外部标志或参考图像进行配准可以在三维体积中控制运动伪影。图像通过空间平移，旋转和插值进行变换。 参考材料 Salem KA. Motion correction for MR imaging . Siemens Medical, 2005. (Sales brochure with a decent review of several techniques). 相关问题 为什么运动伪影常会形成离散的鬼影？","tags":"motion-related-artifacts","title":"Question-减少运动伪影：运动伪影如何减少或消除？"},{"url":"http://chunshan.github.io/MRI-QA/motion-related-artifacts/motion-artifact-direction.html","text":"原文链接: Why are motion artifacts propagated in the phase-encode direction instead of the frequency-encode direction? 概要 在2DFT成像中，频率和相位编码方向上数据采集的采样时间之间存在着相当大的差距。在频率编码方向，所有256-512个信号的采样是在一个回波的间隔中获得的（例如，5-80毫秒）。相反，在相位编码方向上获取一个采样的时间在几秒钟到几分钟的级别，因为基本上k空间中所有的线必须都收集获得完整的数据集用于傅里叶重建。 在此轴向头部检查中，选择从左到右的相位编码方向，从而眼窝的运动伪影不会溢出到大脑区域。 最严重的生理运动（呼吸，吞咽，心脏搏动）的周期在一百毫秒到几秒钟之间。由于这些运动相对于频率采样间隔是缓慢的，它们通常在频率编码方向上产生空间上的局部轻微模糊。相反，由于相位采样间隔通常等于或比大多数的生理运动周期更长，伪影在这个方向上将更加突出。此外，无论生理运动发生在频率编码，相位编码，或切片选择方向，这些伪影都将在相位编码方向传播。 一个对所有类型的运动简单有效的成像策略是交换相位编码轴和频率编码轴。虽然这不会改变运动伪影，它会将伪影移到一个不同的方向从而使得伪影不会溢出到感兴趣区域。比如，在轴向头颅成像中，相位编码方向通常选为从左到右，这样眼窝的运动伪影就不会溢出到大脑区域。 参考材料 Axel L, Summers RM, Kressel HY, Charles C. Respiratory effects in two-dimensional Fourier transform MR imaging . Radiology 1986; 160:795-801. Storey P, Chen Q, Li W, et al. Band artifacts due to bulk motion . Magn Reson Med 2002; 48:1028-1036. Wood ML, Henkelman RM. MR image artifacts from periodic motion . Med Phys 1985;12:143-151. 相关问题 为什么运动伪影常会形成离散的鬼影？","tags":"motion-related-artifacts","title":"Question-运动伪影：为什么运动伪影在相位编码方向传播而不是频率编码方向？"},{"url":"http://chunshan.github.io/MRI-QA/motion-related-artifacts/why-discrete-ghosts.html","text":"原文链接: Why do motion artifacts often form into discrete ghosts? 概要 当成像视野（Field-Of-View，FOV）内的结构的位置或信号强度有规律地运动或发生变化时，离散的\"鬼影\"可能沿相位编码方向产生。血液或脑脊液的搏动流，心脏运动，呼吸运动是临床磁共振成像中产生鬼影的与病人相关的最重要的原因。鬼影的强度与周期性运动的幅度正相关，也与运动组织的信号强度正相关。 如果运动是非周期性的（如蠕动），不会产生离散的鬼影，而是会形成弥散的图像噪声，而且沿相位编码方向广泛传播。 图像中离散鬼影的间隔依赖于运动的主要方向（沿x,y或z轴），位移的幅值，周期性运动相对于相位采样的间隔。一般情况下，运动速度越快，鬼影的间隔会更宽。 运动伪影的出现取决于它们如何调制主要的成像频率（fo）。随机/非周期运动代表宽范围的复杂调制频率，傅里叶变换（FT）后会导致上下边带的扩散，产生弥散的，未聚焦的伪影。频率为fs的简单/规则/周期性运动会产生离散的边带，以鬼影的形式出现在主图像的两边。 常规的2DFT磁共振成像中，连续的两个相位采样之间的间隔为TR x NEX（因为在增加相位编码梯度前，一般会执行重复激发）。如果运动的周期（TP）等于TR x NEX，鬼影间隔会比较密集。相反，如果 TP = 2 x TR x NEX，鬼影间隔会很疏松。 参考材料 Axel L, Summers RM, Kressel HY, Charles C. Respiratory effects in two-dimensional Fourier transform MR imaging . Radiology 1986; 160:795-801. Storey P, Chen Q, Li W, et al. Band artifacts due to bulk motion . Magn Reson Med 2002; 48:1028-1036. Wood ML, Henkelman RM. MR image artifacts from periodic motion . Med Phys 1985;12:143-151. 相关问题 为什么运动伪影在相位编码方向传播而不是频率编码方向？","tags":"motion-related-artifacts","title":"Question-鬼影：为什么运动伪影常会形成离散的鬼影？"},{"url":"http://chunshan.github.io/MRI-QA/tissue-related-artifacts/dielectric-pads.html","text":"原文链接: How do you reduce dielectric artifacts? How good are dielectric pads at solving this problem? 概要 绝缘垫其实是内含有高导电材料的小袋，放置在病人和接收线圈之间减少电介质伪影。最简单的绝缘垫含氯化锰的稀释溶液或凝胶。更复杂的固体绝缘垫含金属（主要是钡和钙）钛酸盐在氘化或质子化中的悬浮液。 绝缘垫的作用有以下几个：1）它们提供改进的阻抗匹配利于B1磁场的传播；2）绝缘垫上的位移电流产生继发的局部射频场增强施加的B1场；3）绝缘垫使得头部或腹部更接近圆形，因此减少射频场在椭球体内固有的不均匀效应。盆腔3.0T下使用绝缘体减少伪影的例子显示如下。 没有绝缘垫（信号比较差） 有绝缘垫（信号有提高） 10-15年前我们最早的3T系统，临床成像中我们常规使用绝缘垫用于提高B1场的均匀性。我们现代的3T扫描仪使用双射频技术，两个独立的源可调节相位偏移，被用于发射射频场。这项技术显著降低了图像的不均匀性，因此我们不再使用绝缘垫。然而，一些装3.0T的站点仍然使用绝缘垫，并且7.0T和9.4T扫描仪中绝缘垫都是常规使用的。 参考材料 Sled JG, Pike GB. Standing-wave and RF penetration artifacts caused by elliptic geometry: an electrodynamic analysis of MRI. IEEE Trans Med Imag 1998; 17: 653-662. Webb AG. Dielectric materials in magnetic resonance , Concepts Magn Reson 2011; 38A:148-184. Yang QX. Mao W, Wang J et al. Manipulation of Image Intensity Distribution at 7.0: Passive RF Shimming and Focusing With Dielectric Materials . J Magn Reson Imaging 2006;24:197–202. Yang QX, Wang J, Wang J, et al. Reducing SAR and enhancing cerebral signal-to-noise ratio with high permittivity padding at 3T . Magn Reson Med 2011; 65:358-362 相关问题 什么是介电效应？它如何产生磁共振成像中的伪影？","tags":"tissue-related-artifacts","title":"Question-绝缘垫：如何减少电介质伪影？绝缘垫用于解决这个问题的效果如何？"},{"url":"http://chunshan.github.io/MRI-QA/tissue-related-artifacts/dielectric-effect.html","text":"原文链接: What is the dielectric effect and how does it produce artifacts in MRI? 概要 在MRI中，我们通常关注B0场和B1场，而常常忘记与磁场共生的一直存在的电场（E）。如在Maxwell方程中描述的，磁场（B场）和电场（E场）振荡的方向互相垂直，而且都垂直于波传播的方向。当电磁波遇到人体，会发生几个现象：1）波长变短，2）产生电流，3）在组织交界处产生反射波或折射。介电效应是指物体与电磁场中的电场（E）之间的相互作用。 由B1场不均匀性导致的异常明亮或黑暗区域在超高场（3.0T及以上）时经常出现，虽然这些伪影的本质还不是完全清楚，它们通常被称为电介质伪影。 7.0T下的电介质伪影，脑部中心区域异常明亮 3.0T下的电介质伪影。腹部（有腹水）中心区域异常昏暗 组织中的射频波长是磁场强度的函数 介电共振能够导致的亮区和暗区的程度仍然是有争议的。有相对高电导率的组织会引入一个\"趋肤深度\"的术语，产生阻尼驻波现象。中央明亮的现象已经在高电导率的水模中（其中的介电共振最小）得到验证。总之，介电效应及与之关联的伪影随着磁场强度的升高越发显著，虽然简单的介电诱导的驻波模型可能仅能解释一小部分现象。 高级讨论 物质与电磁场交互的程度可以通过三个参数描述：磁导率（μ），介电常数（ε），电导率（σ）。在一般情况下，这些参数随温度，电磁频率，和物质的物理状态而变化。而且因为它们还可能随位置和方向有关，因此一般更准确得表示为向量（张量）而不是标量。尽管如此，为了简单的解释，我只用希腊符号来表示，而不涉及它们更复杂的性质。 磁导率（μ）反映物质集中或分散外加磁场的程度。它与磁化率（χ）这个我们已经熟悉的概念几乎同义，通过关系μ = 1 + χ相联系。 介电常数（ε）是一种电气特性，与磁导率（μ）同源。它反映物质集中或分散外加电场的程度。高介电常数意味着当放置在电场中时，材料会变得更加极化。Permittivity（介电常数）与dielectric constant（介电常数）往往是同义词，后者是更古老的术语，已经逐渐不被使用了。 电导率（σ）反映材料携带电流的能力。电导率与电阻成反比。 弱导电介质材料（如人体）内部的射频磁场受传导电流通量（JC）和位移电流通量（JD）扰动，可以通过Maxwell校正后的Ampère定律描述： ΧB = μJC + μJD = μσE + iωεE 其中，i2 = -1是复数单元，引入了传导电流和位移电流之间90°的相位偏移。传导电流和位移电流幅值之间的比例为： JC /JD = σ / ω ε 人体组织中，在MRI中使用的射频频率，JC和JD的幅值在相同的量级。随着频率的升高，JD变得越来越重要，但即使在7.0T下（3000MHz），传导电流/位移电流的比例对脂肪，灰质，肌肉和脑脊液分别约为0.4，0.6，0.7和1.7。高介电材料（如在绝缘垫中使用的材料）传导电流/位移电流的比例仅为约0.01，意味着传导电流可以被忽略。 参考材料 Collins CM, Liu W, Schreiber, et al. Central brightening due to constructive interference with, without, and despite dielectric resonance . J Magn Reson Imaging 2005; 21:192-6. Gabriel C, Gabriel S, Corhout E. The dielectric properties of biological tissues: I. Literature survey . Phys Med Biol 1996;41:2231-2249. Webb AG, Collins CM. Parallel transmit and receive technology in high-field magnetic resonance neuroimaging (pdf) . Int J Imaging Syst Technol 2010; 20:2–13. 相关问题 如何减少电介质伪影？绝缘垫用于解决这个问题的效果如何?","tags":"tissue-related-artifacts","title":"Question-电介质伪影：什么是介电效应？它如何产生磁共振成像中的伪影？"},{"url":"http://chunshan.github.io/MRI-QA/tissue-related-artifacts/metal-suppression.html","text":"原文链接: We recently purchased a metal artifact reduction software for one of our scanners. How does that work? 概要 金属具有很高的内在磁化率(χ)，会产生显著的局部磁场扰动，使得共振频率在成像平面内和垂直成像平面方向都会发生变化。金属通过改变共振频率，使得图像像素偏移它们原来真实的位置，导致显著地几何变形，包括信号缺如（黑色区域）和信号累积（明亮区域）。存在几种最小化金属相关伪影的方法。 减少金属相关伪影重要的第一步是使用尽可能低强度的磁场。磁敏感性伪影与磁场强度成正比，因此对全髋关节置换术的患者，要想获得更好的扫描，首先选择更老的1.5T扫描仪而非崭新的3.0T机器。 金属伪影抑制技术 脊柱中由锥弓根螺钉导致的金属磁敏感伪影 即使没有购买专业软件，明智地使用标准技术也可以用来减少金属伪影。首先，应该使用回波间隔短的快速自旋回波序列，因为多个很短时间内施加的180°重聚脉冲可以部分校正由于磁场不均匀性导致的相散。接收器带宽也应提高到一个尽可能大的值使得与可接受的信噪比水平一致。减少层厚和使用并行成像加速也有助于降低金属伪影。 在承认失败前，对感兴趣区域至少从3个不同的平面成像或许值得一试。我在很多情况下惊奇地发现，金属伪影会使两个平面上的图像完全不可解释，第三个平面上却基本上不受伪影的影响，能够用来诊断。这需要不断尝试，在紧要关头却能够帮你一把。 主要的磁共振厂商还提供专门设计的软件减少金属伪影，有时一般称为MARS（Metal Artifact Reduction Sequences）。有几种方法可以实现这一目标。 减少平面内的扭曲：视角倾斜（View Angle Tilting， VAT） 自从1980年代的发展，VAT已经是普遍使用而且行之有效的减少由于磁敏感效应导致的平面内图像失真的技术。这种方法中，在信号读出时沿切片选择方向施加一个额外的梯度（VAT）。这个梯度造成成像像素的\"错切\"，一种看起来像从一个小角度观察成像层面的效应。因为VAT梯度场幅值与射频激发时的梯度场相同，它会恢复射频带宽内所有激发的自旋，完全取消局部的失共振效应。VAT方法理论上能够完全补偿读出方向上平面内像素的位移。 尽管可以充分校正平面内失真，VAT方法会因为几何层面错切和额外VAT梯度场造成的低通滤波效应造成图像模糊。这些效应可以通过使用更薄的片层，更高的矩阵分辨率和更高的带宽减少。 减少平面间扭曲：SEMAC和MAVRIC 由金属引起的平面间（片层与片层之间）的磁场扭曲更难校正。已经有两种密切相关的技术用于达到此目标：SEMAC（Slice Encoding Magnetic Artifact Compensation）和MAVRIC (Multi-Acquisition Variable Resonance Image Combination)。 SEMAC技术基于2D快速自旋回波序列，每一个片层在第三维上有额外的相位编码。在离散频率偏移上获得的重叠容积上的额外相位编码提供了金属磁敏感效应如何扭曲原来片层轮廓的信息。重建软件从而可以校正垂直于成像平面的信号平移。 MAVRIC是GE的产品，基于3D快速自旋回波序列，采用专有的频率选择性激发和多谱式VAT读出。这种方法也包括去模糊的后处理算法去除成像平面重建的伪影。 参考材料 Cho Z, Kim D, Kim Y. Total inhomogeneity correction including chemical shifts and susceptibility by view angle tilting . Med Phys 1988; 15:7–11. Hargreaves BA, Worters PW, Pauly KB et al. Metal-induced artifacts in MRI . AJR Am J Roentenol 2011; 197:547-555. (A recent excellent review of metal artifacts and suppression techniques). Koch KM, Lorbiecki JE, Hinks RS, King KF. A multispectral three-dimensional acquisition technique for imaging near metal implants. Magn Reson Med 2009; 61:381–390. Lu W, Pauly KB, Gold GE, Pauly JM, Hargreaves BA. SEMAC: slice encoding for metal artifact correction in MRI. Magn Reson Med 2009; 62:66–76. Olsen RV, Munk PL, Lee MJ et al. Metal artifact reduction sequence: early clinical applications . Radiographics 2000; 20:699-712. 相关问题 什么是磁敏感性伪影（susceptibility artifacts）?","tags":"tissue-related-artifacts","title":"Question-金属伪影抑制：我们最近为一个扫描仪买了金属伪影抑制软件。它的工作原理是什么？"},{"url":"http://chunshan.github.io/MRI-QA/tissue-related-artifacts/susceptibility-artifact.html","text":"原文链接: What are susceptibility artifacts? 概要 磁敏感性(χ)衡量一种物质放置到外部磁场中时被磁化的程度。使主磁场分散的材料称为抗磁性材料，使主磁场集中的材料根据影响的程度不同可分为顺磁性材料，超顺磁性材料或铁磁性材料。 钙盐（见于骨皮质）是人体中最强的抗磁性物质。几乎所有的生物组织（肌肉，脂肪，脑，肝，水）都是抗磁性的，但是比较弱。令人惊讶的是，空气不是磁敏感中性的，而是由于氧分子的存在略微显顺磁性。组织中如果存在金属离子（如Fe,Mn,Gd）会产生弱顺磁性。铁蛋白和含铁血黄素颗粒中的铁累积为微球状，产生更强的正磁敏感性效应称为超顺磁性。含Fe,Co,Ni的固体金属物体（如假体，手术夹。螺钉）有最强的磁敏感性效应，称为铁磁性材料。 磁敏感性效应导致的磁场扭曲会导致患者体内不同部位的进动频率变化，甚至单个体素内进动频率也会发生变化。进动频率的改变，反过来会导致T2*失相位和空间失配造成磁共振信号的损失。磁共振成像的特点反映了这两种物理机制：几何失真造成的焦点区域信号缺如和分配到错误区域的\"打桩\"信号导致部分区域非常明亮。下面是不同部位磁敏感性伪影的图片库。 股骨螺钉导致的磁敏感性伪影 因分流导致的\"土豆片\"伪影 颅底处DWI上的磁敏感性伪影 焦鞍处可能一个腺瘤导致的敏感性伪影 海绵状血管瘤周围含铁血黄素引起的信号损失 椎弓根螺钉引起的磁敏感性伪影 睫毛膏中的铁粒子引起的磁敏感性伪影 牙箍引起的磁敏感性伪影 由于铁磁性材料有最强的磁敏感性效应，磁场扭曲和磁共振伪影通常围绕金属物和植入物非常明显。比较微妙的磁敏感性扭曲可见于一些人体组织交界处（如骨小梁、鼻窦、颅底，和蝶鞍）。伪影的形状（弥散性或局灶性）和强度（高或低）依赖于局部解剖关系，磁场强度，磁敏感性差异，回波时间（TE）还有带宽（读出梯度场强度和方向）。关系用下式表示： 由于磁敏感性伪影在高场强下更差，应尽可能避免在3.0T下扫描带金属植入物的患者。通过交换频率编码和相位编码的方向，磁敏感性伪影会有形状上的变化，但并不会消除。使用更短的TE（失相位时间更短），使用快速自旋回波代替梯度回波序列能够最小化磁敏感性伪影。给定视野（Field Of View，FOV）时增加梯度场强度，避免使用窄带技术也可以减少磁敏感性伪影。使扫描的片层更薄和使用并行成像技术对减少伪影也有帮助。更严重的金属伪影可以通过使用特定的金属伪影消除序列降低（在下一个 Q&A 中讨论）。 参考材料 Elster AD. Sellar susceptibility artifacts: theory and implications . AJNR Am J Neuroradiol 1993; 14:129-136. (Explains the physical basis of an artifact at the skull base that can mimic a pituitary adenoma). Liu H, Martin AJ, Truwit C. Interventional MRI at high field (1.5T): needle artifacts . J Magn Reson Imaging 1998; 8:214-9. (Explains the physical basis of the \"blooming ball\" artifact at the end of biopsy needles directed parallel to the Bo field). Port JD, Pomper MG. Quantification and minimization of magnetic susceptibility artifacts on GRE images . J Comput Assist Tomogr 2000;24:958-964. Schenck JF. The role of magnetic susceptibility in magnetic resonance imaging: MRI magnetic compatibility of the first and second kinds . Med Phys 1996;23:815-850. (Slightly dated, but an excellent and enduring explanation of susceptibility from a pioneer in MRI and first inductee in GE's Genius Hall of Fame). 相关问题 What is magnetic susceptibility? What causes susceptibility? 我们最近为一个扫描仪买了金属伪影抑制软件。它的工作原理是什么？","tags":"tissue-related-artifacts","title":"Question-磁敏感性伪影：什么是磁敏感性伪影（susceptibility artifacts）？"},{"url":"http://chunshan.github.io/MRI-QA/tissue-related-artifacts/ir-bounce-point.html","text":"原文链接: I've noticed that T1-FLAIR images may show \"India ink\" outlines. Is this also a chemical shift artifact? 概要 反弹点伪影 反弹点发生在幅值重建的反转恢复序列图像的中间时间（TI），此时含两种物质的体素会穿过零轴 反转恢复（IR）序列图像某些解剖结构有时会看到黑色轮廓，这不是由于化学位移引起的，而是由边界像素磁共振信号的相位取消引起的，机制与化学位移伪影类似。 右图显示了一个例子。注意大脑与脑脊液（CSF）边界处锐利的蚀刻样黑线，这通常称为反弹点伪影（最初被命名为\"反向磁化伪影\"）。在反转恢复成像中，组织磁化（M）反转到与主磁场相反的方向，然后逐渐恢复，此过程中会穿过零点。因为组织的T1值不同，恢复曲线也不同。右边的图表中，脑脊液（CSF）的T1比脑组织长，恢复得比脑组织慢。在只重建幅值的反转恢复（IR）序列中，从零到每种组织恢复曲线的距离就是显示的信号强度。每个组织的跨零点分配为黑色，称为空点或反弹点。 考虑脑脊液（CSF）和脑组织边界的一个像素，假设此像素中有相同量的两种组织。假设反转时间（TI）为介于脑组织和脑脊液反弹点之间的一个值，此时脑组织曲线在零轴上方，脑脊液曲线在零轴下方，两条曲线到零轴的距离恰好是相等的。也就是说该点脑组织信号和脑脊液信号幅值相同但是相位差180，失相位。信号被完全抵消，边界像素被渲染为黑色。 虽然上面反弹点伪影使用传统的幅值校正反转恢复（IR）图像进行描述，相同的现象出现在所有带反转脉冲的序列中，所以反弹点伪影也会出现在MP-RAGE,FGATIR或准IR SPGR等序列中。 参考材料 Hearshen DO, Ellis JH, Carson PL, et al. Boundary effects from opposed magnetization artifact in IR images . Radiology 1986; 160:543-7. 相关问题 What is phase-sensitive IR and why does it have a gray background? How do you pick a TI value to null signal from a given tissue? What is T1-FLAIR?","tags":"tissue-related-artifacts","title":"Question-反转恢复序列中的反弹点伪影：我注意到T1-FLAIR图像中有时也会出现\"印度墨水\"样的轮廓，这也是一种化学位移伪影么？"},{"url":"http://chunshan.github.io/MRI-QA/tissue-related-artifacts/in-phaseout-of-phase1.html","text":"原文链接: What is meant by in-phase vs out-of-phase imaging? 概要 像在前一个Q&A中所描述的，同一个体素中水和脂肪信号间的相位取消导致梯度回波图像上第二类化学位移伪影的产生。这种伪影表现为器官和解剖结构在水-脂肪交界处的黑线。这种伪影的幅度依赖于水和脂肪间的相位循环，1.5T下由于化学位移导致的相位循环的频率约215Hz。 1.5T下，同相和失相之间的相位循环约每2.2ms发生一次。3.0T时循环速度加倍，每1.1ms发生一次。1.5T下采集的梯度回波图像当TE为2.2ms，6.6ms，11.0ms时称为失相（Out Of Phase，OOP），TE为4.4ms，8.8ms等值时称为同相（In Phase，IP）。 到1980年代末，一些研究者开始意识到相位消除效应可以在临床上用来识别甚至量化组织（如肝）中的脂肪含量。今天这一原则一个特别常见的应用是帮助区分肾上腺腺瘤（通常包含脂肪）和癌及转移瘤（一般不含脂肪）。其他各种腹部病变的诊断，包括血管平滑肌脂肪瘤，肾透明细胞癌和肝局灶性脂肪侵润都可以通过IP-OOP成像辅助诊断。这种技术在下图说明，包含一对梯度回波图像，有相同TR但是不同TE，一个同相，一个失相。如果病变处信号强度在OOP图像上显著下降说明很可能包含显微脂肪。因此，IP/OOP扫描是目前大多数腹部成像协议的一种标准组成部分。 富含脂肪的肾上腺腺瘤（箭头）。同相的梯度回波图像（TE=4.4ms）显示中等强度信号肿瘤 失相的梯度回波图像（TE=2.2ms），腺瘤（箭头）信号下降，有相位取消伪影。 肾上腺腺瘤中的脂滴（箭头） 肝脂肪变性。同相的梯度回波图像（TE=4.4ms） 失相梯度回波图像（TE=2.2ms）上肝脏信号降低 标本上显示存在脂滴 参考材料 Outwater EK, Blasbalg R, Siegelman ES, Vala M. Detection of lipid in abdominal tissues with opposed-phase gradient-echo images at 1.5T: techniques and diagnostic importance . Radiographics 1998; 18:1465-80. 相关问题 什么是第二类化学位移伪影（Chemical Shift:2nd Kind）？ How do you produce multiple GRE's from a single pulse?","tags":"tissue-related-artifacts","title":"Question-同相和失相：同相位（in-phase）成像和失相位（out-of-phase）成像意思是什么？"},{"url":"http://chunshan.github.io/MRI-QA/tissue-related-artifacts/chemical-shift-2nd-kind.html","text":"原文链接: What is a chemical shift artifact of the second kind? 概要 第二类化学位移伪影有时又被称为印度墨水或黑线伪影，因为器官和肌肉束看起来像被黑笔描了边。这些黑线并不反应真正的解剖结构，而是含有水和脂肪的边界像素的信号被破坏性干扰的结果。由于这个原因，它有时被称为相位取消伪影。图示了脊柱，大腿和腹部的例子。 这种形式的化学位移伪影只发生在梯度回波成像中（不像第一类化学位移伪影也会发生在自旋回波成像中）。此外，第二类化学位移伪影是由于相位取消效应导致的，所以不限于频率编码方向（第一类化学位移伪影仅限于此频率编码方向），会出现在沿脂肪-水交界处的所有像素。 在自旋回波成像中，水和脂肪间的信号会在每个回波的中心回到相位相干（尽管它们频率不同，空间位置不同）。梯度回波成像中，水和脂肪质子在每个回波的中心却不会回到相位相干（因为梯度回波序列缺少自旋回波序列中的180°相位重聚脉冲）。梯度回波序列中，水和脂肪质子之间的相位差是回波时间（TE）的函数。1.5T下，水和脂肪质子间从相位相同变为不相同又变为相同的周期约1/225Hz（4.4ms），因此1.5T下，在TE=2.2，6.6，11.0，15.4ms等值时，梯度回波成像中脂肪和水相位正好彼此相反。在TE接近这些\"特殊值\"时采集的梯度回波图像就会出现第二类的化学位移伪影。 上图显示了相位取消效应和\"黑线\"产生的起源。中间的边界像素包含相同数目的水和脂肪质子，而且在TE=2.2ms相位相反时成像，因为水和脂肪信号相位相反，它们彼此取消，净幅值为零，因此没有信号。纯水或纯脂肪时没有这样的相位取消，由于显示的图像都是幅值重建，因此最终的图像中都是亮的。因此纯水和纯脂肪的像素被它们之间交界处的黑色边界分开。 参考材料 Wehrli FW, Perkins TG, Shimakawa A, Roberts F. Chemical shift-induced amplitude modulations in images obtained with gradient refocusing . Magn Reson Imaging 1987; 5:157-8. 相关问题 什么是化学位移伪影？","tags":"tissue-related-artifacts","title":"Question-第二类化学位移伪影：什么是第二类化学位移伪影（Chemical Shift:2nd Kind）？"},{"url":"http://chunshan.github.io/MRI-QA/tissue-related-artifacts/reducing-chemical-shift.html","text":"原文链接: What can you do to eliminate or reduce the chemical shift artifact? 概要 如果认识了化学位移伪影，化学位移伪影一般可以识别出来并且不会造成图像解释的主要困难。但如果试图检测视神经或肾皮质细小病变的轻微异常，化学位移伪影的大小可能会完全掩盖病变。 解决化学位移伪影的一种简单方法是在成像之前交换频率和相位编码轴，这样做不会消除化学位移伪影，但是会将伪影旋转到另外的解剖区域。这样的策略可能不会成功，因为可能会导致相位卷折伪影或流动相关伪影转移到别的感兴趣区。 另一种策略是调整成像参数以减小伪影的尺寸。这可以通过增加总的接收带宽（或等价地，增加视野或读出梯度场的幅度）达到。 最后一个策略，可能是最好的，是使用一些脂肪抑制技术减小脂肪信号，从而最大限度减少伪影。这样的技术包括使用短时反转恢复序列（STIR）和脂肪饱和脉冲，其他的 Q&A 中讨论了这些技术。 参考材料 Hood MN, Ho VB, Smirniotopoulos JG, Szumowski J. Chemical shift: the artifact and clincial tool revisited . Radiographics 1999; 19\"357-371. 相关问题 什么是化学位移伪影？ 水和脂肪质子的化学位移难道不会导致它们之间的相位变化么？如果如此，为什么化学位移伪影在相位编码方向没有出现？ What is STIR?","tags":"tissue-related-artifacts","title":"Question-减少化学位移伪影：怎么做可以消除或减少化学位移伪影"},{"url":"http://chunshan.github.io/MRI-QA/tissue-related-artifacts/chemical-shift-in-phase.html","text":"原文链接: Doesn't the chemical shift between water and fat protons also result in a phase shift between them? If this is so, then why aren't chemical shift artifacts seen in the phase-encode direction also? 概要 相位编码方向上有化学位移伪影的EPI图像(↑) 实际上，水和脂肪质子之间的化学位移不仅指两者之间的频率位移，也有相位位移。在常规自旋卷折成像中，脂肪质子相对于水质子的相位偏移在相位编码方向上不会累积，因此，如果给定成像位置，连续的相位编码步骤之间水和脂肪的相位偏移是一个常量。由于傅里叶变换在给相位编码方向上的空间位置赋信号值时考虑了相位差，常规的自旋回波或梯度回波成像中，相位编码方向上不会发生水-脂肪位置失配。 然而，在平面回波成像（EPI）中会发生完全相反的现象。化学位移伪影在频率编码方向上很小在相位编码方向上可能极大。自旋卷折和平面回波技术之间存在这种差异的原因是由于后者采集数据的方式不同。 在EPI中，一次射频激发后会立刻采集所有行的裸数据，频率编码方向上每个像素的带宽非常大（如在50-100kHz的级别），因此化学位移伪影不显著。然而在相位编码方向上，每个像素的带宽非常小（在1kHz的级别），因为所有的相位编码行只有几十毫秒就采集完成了。1.5T下，脂肪/水的化学位移约215Hz，相位编码方向上的窄带宽会造成10+像素宽的显著伪影。平面回波技术必须使用特殊的校正和修正方法来最小化脂肪信号，消除化学位移伪影。 参考材料 Jezzard P, Balaban RS. Correction for geometric distortion in echo planar images from Bo field variations . Magn Reson Med 1995;34:65-73. 相关问题 什么是化学位移伪影？","tags":"tissue-related-artifacts","title":"Question-化学位移的相位效应：水和脂肪质子的化学位移难道不会导致它们之间的相位变化么？如果如此，为什么化学位移伪影在相位编码方向没有出现？"},{"url":"http://chunshan.github.io/MRI-QA/tissue-related-artifacts/chemical-shift-artifact.html","text":"原文链接: What is a chemical-shift artifact? 概要 不受屏蔽的水中 1 H原子 化学位移指的是由于原子核分子环境的不同导致的共振频率的微小变化。例如，脂肪的 1 H质子，遮蔽在长链甘油三酯中，被电子云覆盖。这些电子云部分屏蔽了外部施加磁场对脂肪中质子的影响。然而，水中的 1 H质子受到的遮蔽比较少，因为电子云被带高度负电的氧原子拉走了。 由于电子云屏蔽程度不同，脂肪中质子受到的局部磁场会比周围水分子中的质子略弱一点，其共振频率也会略低。共振频率的差异非常小，在百万分（ppm）之3.4的级别（3.4 x 10-6），1.5T时引起的绝对频率差异约215Hz，3.0T时绝对频率差异会是1.5T时的两倍，约430Hz。 常规磁共振成像中，空间位置根据共振频率不同沿频率编码方向排列。如果一个体素中既有水又有脂肪，脂肪质子发出的信号会比水中质子发出的信号频率略低。 因此，如果系统频率设置为水的共振频率，脂肪质子产生的信号看起来像梯度磁场低部区域另一个体素中的水质子产生的。当图像强度值被填到最终的图像中，脂肪质子位置将会朝着读出梯度磁场低部方向产生空间上的映射错误。 脂肪和水之间的像素映射错误导致白带或暗带伪影，伪影有一至几个像素宽，分布在解剖对象两边。这种伪影通常见于脂肪包围的含水器官（如肝脏，肾脏，视神经，硬膜囊，肌肉，神经束）。下图中暗带出现在每个肾的左边，白带出现在右边。暗带出现在哪边取决于频率编码梯度在图像上从左到右是升高还是降低。在下图肾脏，膝盖和腿的例子中，频率从左向右升高。硬膜囊的图像则不同，频率从左向右降低。因此暗的化学位移带出现在硬膜囊的左侧。 脊髓液与硬膜外脂肪间的化学位移伪影 肌肉与脂肪边界的化学位移伪影 骨的边缘处髓脂肪与含水的关节囊或椎间盘毗连，也会发生轻微的化学位移伪影，看起来像皮质厚度改变了。 膝关节内的轻微化学位移伪影。频率编码方向从左到右，软骨厚度差异很明显是伪影造成的，伪影来自骨髓脂肪信号移位。肌肉与脂肪边界的化学位移伪影。 脊柱上一个类似的轻微伪影，频率编码方向从S到I。椎骨的皮质厚度改变是由骨髓和椎间盘之间的化学位移伪影造成的。 化学位移伪影的大小可以根据两个选定的参数在成像之前很容易地预先计算出来，这两个参数是接收器带宽和频率编码矩阵的大小。比如，如果接收器总带宽为32kHz，频率编码方向有256个像素，每个像素的带宽是32000/256 = 125Hz。由于脂肪-水的共振频率在1.5T下相差约215Hz，化学位移伪影大小约 (215 Hz) ÷ (125 Hz/pixel) = 1.7个像素。 减少每个像素所占带宽会加重化学位移伪影。一般而言，在化学位移伪影会使重要交界处模糊的位置（如视神经和眼眶脂肪交界处），应尽量避免使用窄带技术。 一个破裂的乳房假体（\"沙拉油征\"）中，水和硅胶交界处的化学位移伪影。 由于化学位移伪影是基于频率的MR信号的空间映射错误，因此一般出现在频率编码方向。回波平面成像（EPI）中情况有所不同，化学位移伪影出现在相位编码方向。见下一个Q&A。 此外，在2DFT成像中，层面选择由变化的频率定义。这种采集方法中，化学位移伪影不仅发生在成像平面内，也发生在成像平面间（层面选择方向）。层面间的化学位移伪影表现为一定解剖结构周围或亮或暗的\"光环\"，其他形式不太明显，但会造成图像质量的轻微下降。 最后，应该注意化学位移伪影不仅发生在水和脂肪之间，而是在任何有不同化学位移的两种物质交界处。例如，硅油（用于眼科）和水之间的化学位移约4.4ppm，硅凝胶（用于乳房假体）和水之间化学位移约1.7ppm，因此化学位移伪影也会出现在乳房，头部，颈部和四肢，这些部位使用硅胶注射物或植入物比较普遍。 参考材料 Babcock EE, Brateman L, Weinreb JC et al. Edge artifacts in MR images: chemical shift effect . J Comput Assist Tomogr 1985; 9:252-257. (One of the first descriptions of this artifact) Dwyer AJ, Knop RH, Hoult DI. Frequency shift artifacts in MR imaging . J Comput Assist Tomogr 1985;9:16-18. Hood MN, Ho VB, Smirniotopoulos JG, Szumowski J. Chemical shift: the artifact and clinical tool revisited . Radiographics 1999; 19:357-371 (Excellent review). Mathews VP, Elster AD, Barker PB, et al. Intraocular silicone oil: in vitro and in vivo MR and CT characteristics . AJNR Am J Neuroradiol 1994; 15:343-7. Smith RC, Lange RC, McCarthy SM. Chemical shift artifact: dependence on shape and orientation of the lipid-water interface . Radiology 1991; 181:225-229. 相关问题 水和脂肪质子的化学位移难道不会导致它们之间的相位变化么？如果如此，为什么化学位移伪影在相位编码方向没有出现？","tags":"tissue-related-artifacts","title":"Question-化学位移伪影：什么是化学位移伪影（Chemical Shift Artifacts）？"},{"url":"http://chunshan.github.io/MRI-QA/asl/quantifying-flow.html","text":"原文链接: How are ASL methods able to quantify blood flow? 概要 像从其他MR方法获得灌注信息一样，从ASL中获取血流定量信息是梦寐以求却很难实现的目标。信号强度差分（ΔS = Scontrol - Sinversion）仅提供了灌注加权的图像，将这种原始数据转化为绝对的血流定量参数需要三个步骤：1）图像处理和滤波以去除伪影；2）获取单独的一个质子密度（PD）或者T1加权参数图用于归一化信号强度；3）根据一个数学模型拟合数据逐个像素计算血流信息。 图像处理和滤波 在试图获取血流的定量信息之前，需使从ASL方法得到的原始数据尽可能变得\"干净\"。在标记序列和控制序列之间患者一般会有一定程度的运动，因此刚体运动校正技术一般会与互配准和基于高斯平滑滤波器的\"去噪\"技术一起使用，也有可能会分割出灰质和白质图像，然后分别处理使得部分容积效应最小。 异常值分析可以辨认更严重和随机的误差（如右侧显示的梯度故障），当控制像和标记像之间的差值超过某一设定的阈值时可以丢弃掉。通常产生椭圆形的\"mask\"用于排除大脑之外的体素，也可以使用独立成分分析的统计学方法进一步减少噪声。 短暂的梯度故障导致ASL原始数据被破坏 后处理过程中去除受影响数据进行校正 用于归一化的校准图像 质子密度校准图像 为了能够量化血流信息，任意的灌注加权图像中的ASL信号强度必须归一化到M0b，也就是动脉血的平衡磁化强度。理论上，M0b可以从一个单纯的动脉体素测定，但这是不现实的，因为血管可能非常小而且伴随部分容积效应。相反，M0b通常通过测量大脑或脑脊液的平衡磁化间接计算得到，这个过程需要单独获取大脑或脑脊液的质子密度（PD）加权像。质子密度数据转化为M0b需要校正TR，组织T1和血脑分配系数（λ）。 数学建模与数据拟合 最后一步是将滤波和校准后的ASL数据拟合到一个数学模型，逐个像素计算定量的血流参数。最广泛使用的Buxton的一般动力学模型，一个单室、活塞流模型，其中的参数使用线性系统方法进行估计，反卷积类似于 前面一个Q&A 中描述的DSC成像中使用的方式。 最终用于计算血流（F）的方程依赖于多个测量和估计的参数，还有精确的ASL脉冲序列。此处只是为了让读者感受一下复杂度，列出了GE系统中目前用于pCASL技术的方程，这个方程基于Alsop等的工作： 个体参数包括：因子6000（转换单位为mL/min/100g组织）； λ为血组织分配系数（通常假设大脑为0.9）；TRPD为饱和恢复质子密度校正序列的重复时间；T1T和T1b为组织和血液的驰豫时间（通常假设3.0T下分别为1.2秒和1.6秒）；SIcont，SIinv和SIPD分别为相应的控制像，标记/反转像和质子密度加权像中像素的信号强度；PLD为标记后延迟时间，表示pCASL反转结束到图像采集之间的时间；LT为标记时间也就是pCASL反转的持续时间；α为pCASL反转的标记效率（通常假设为0.8）；σ为背景饱和脉冲的抑制效率（通常假设为0.75）；KSF为用于灌注加权序列的归一化因子；NEXPW为ASL序列的激发次数（取信号平均）。 这儿列出此方程的目的不是为了迷惑读者，而是为了说明需要假设或估计很多参数才能从ASL数据中计算真正的血流信息。这些参数中一个小的误差或方差可以很容易地改变最终计算结果的30%或更多。归一化因子可以凭经验调整使计算后的血流信息保持在预期的生理范围内，但我建议用户仍然要对由此获得的参数的准确性保持健康的怀疑态度。像其他的MR灌注方法，ASL血流测量最有意义的在于定性，与大脑（或其他器官）另一侧比较相应的区域。 高级讨论 在1922年CASL最初的描述中，Williams等通过修改布洛赫方程来解释组织之间纵向磁化交换（MT）和标记血液的磁化，这奠定了ASL定量分析的基础。 F是血流量，T1是无血流或血液-组织之间的物质交换时组织的纵向驰豫时间，MT0是在完全松弛条件下的组织磁化，Ma和Mv分别是动脉和静脉随时间变化的纵向磁化强度。 假设血液-组织之间的相互作用发生在一个单一的、充分混合的腔室内，流出系统的静脉血磁化强度为Mv = MT/λ，其中λ为血组织分配系数，也就是标记动脉中的水穿过组织后剩余的比例。对大脑而言，λ值一般取为0.9，这是从用15O水标记的PET研究中获得的灰质和白质的平均值。 随着连续而完全的动脉自旋反转，后续的MT采样会呈现指数衰减，时间常量为T1app，由下式给出： 血流量（F）的表达式可以根据实验测量的量推导得到： 其中，Mcont 和Minv分别是控制状态和反转（标记）状态中组织的信号强度。尽管T1app是F的函数，但它通常可以使用一个T1映射或估计程序单独测量得到。 1998年，Buxton等提出了一个更复杂的方法称为一般动力学模型，这个模型的一些版本仍是目前ASL分析最广泛使用的模型。Buxton分析使用与DSC成像中类似的线性系统方法。在继续之前，建议读者快速回顾前面Q&A中总结的DSC线性系统分析。 Buxton方法的基本结果同时适用于连续和脉冲ASL技术，由下面的公式概括： ΔM(t)表示控制状态和标记状态时的组织磁化强度差异，M0b 是标记前血液的平衡磁化强度，α称为标记效率（流动自旋反转的百分比，通常为80-95%，与使用的ASL方法有关）。有一个因子2是因为自旋有反转，控制状态和标记状态下磁化强度的改变为M0b − (−M0b) = 2M0b。F表示血流量，为期望测量得到的参数。 这个积分表示是一个卷积，卷积是线性系统分析的基本数学方法。积分中的第一项a(τ)是一个动脉输入函数，Buxton称为组织传递函数，表示图像读出期间在时刻t到达一个体素的标记磁化的归一化浓度。 R(τ)称为残留函数，是一个无量纲的变量，与DSC中使用的类似，表示标记水分子在时刻t仍然留在成像体素中的百分比。没有在DSC中出现但是ASL分析所必须的一个新项是m(τ)，磁化驰豫函数，表示时刻t初始反转磁化剩余的百分比。 Buxton模型中有几个隐含的假设，其中任何一个都可能受到挑战: 完美的\"塞\"流。假设标记的磁化作为一个完美的有锋利前后边缘的矩形团进入，因此动脉输入函数，a(t)，除了血团通过时都为0。a(t)的形式为a(t) =αe-t/T1b，其中T1b是血液的驰豫时间。实际上，如此完美的矩形自旋标记轮廓很难实现，即使采用像QUIPSS技术提高血团边缘的界定。传输时间范围比较大会导致血流量被低估。 单室动力学模型。假设标记的水进入体素后瞬间与组织完成交换，满足\"充分混合\"条件。实际上，一些标记的自旋在交换之前仍会留在血管中，一些标记的自旋则会流出成像层面而不会发生交换。两种效应都会导致灌注的低估。真正的血组织分配系数(λ)需要测量或者估计，对人的大脑，在正常血流速度下大约为0.9。Buxton模型中残留函数形式一般采用R(t) = e-Ft/λ. 磁化强度衰减率反映组织的T1。作为上述假设1和2的结果，磁化驰豫函数形式为m(t) = e-t/T1t，其中T1t是组织T1。由于此假设不考虑血液流过，磁化传递效应和不完全混合，这个假设会导致灌注被高估。 为了克服Buxton模型的限制，更复杂的分析已经开发出来，包括：1）使用圆而且光滑的前后边缘描述动脉输入函数；2）使用有血管和组织的双室模型类似与DCE成像中的Tofts模型；3）分割灰质和白质并分别使用不用的组织T1和λ值；4）改变磁化衰减函数来反映组织水与血管水交换之前的初始阶段。多TI ASL采集方法也有望能够更好估计血团到达时间及血液和组织的驰豫属性。 参考材料 Alsop DC, Detre JA, Gola X, et al. Recommended implementation of arterial spin-labeled perfusion MRI for clinical applications: A consensus of the ISMRM perfusion study group and the European consortium for ASL in dementia . Magn Reson Med 2015; 73:102-116. Buxton RB, Frank LR, Wong EC, et al. A general kinetic model for quantitative perfusion imaging with arterial spin labeling . Magn Reson Med 1998; 40:383-396. Herscovitch P, Raichle ME. What is the correct value for the brain-blood partition coefficient for water ? J Cereb Blood Flow Metab 1985; 5:65-69. (Answer: probably about 0.90 ml/g) Mutsaerts HJMM, Steketee RME, Heijtel DFR, et al. Inter-vendor reproducibility of pseudo-continuous arterial spin labeling at 3 Tesla . PLOS One 2014; 9(8):e104108. Petersen ET, Lim T, Golay X. Model-free arterial spin labeling quantification: approach for perfusion MRI . Magn Reson Med 2006; 55:219-232. (QUASAR method) Petersen ET, Zimine I, Ho Y-C L, Golay X. Non-invasive measurement of perfusion: a critical review of arterial spin labelling techniques . Br J Radiol 2006; 79:688-701. Wang Z. Arterial spin labeling perfusion MRI signal processing toolbox (ASLtbx) . Version 1, May 2012. (manual for a freely available MATLAB-based toolbox for processing ASL data). Williams DS, Detre JA, Leigh JS, Koretsky AP. Magnetic resonance imaging of perfusion using spin inversion of arterial water . Proc Natl Acad Sci USA 1992; 89:212-216. (derives modified Bloch equations to account for inflow of inverted spins) Wong EC. Quantifying CBF with pulsed ASL: technical and pulse sequence factors . J Magn Reson Imaging 2005; 22:727-731. 相关问题 如何使用动脉输入函数从DSC数据中提取更多量化的血流信息？ 如何选择成像参数来优化ASL的采集？","tags":"ASL","title":"Question-血流量化 - ASL方法如何用于血流量化？"},{"url":"http://chunshan.github.io/MRI-QA/asl/vascular-color-maps.html","text":"原文链接: I have seen some ASL maps with vascular territories colored in. How are these produced? 概要 颈部血管的选择性标记 问题中提到的技术称为区域选择ASL。区域选择ASL技术不再使用单一的大层面上的反转脉冲，而是对一个器官的每一根主要供血动脉分别使用一组薄的脉冲，这可以从解剖学的基础上区分每一根要测量的血管分别的灌注贡献。在给出的例子中，颈部左右颈动脉（红色和蓝色），左右椎动脉（黄色和绿色）分别使用单独的反转脉冲，这个例子显示左侧颈动脉和右侧椎动脉分别对前部和后部脑循环的血供是不成比例的。 分别标记每根颈动脉和椎动脉的区域选择ASL 参考材料 Davies NP, Jezzard P. Selective arterial spin labeling (SASL): perfusion territory mapping of selected feeding arteries tagged using two-dimensional radiofrequency pulses . Magn Reson Med 2003; 49:1133-1142. van Laar JP, van der Grond J, Hendrikse J. Brain perfusion territory imaging: methods adn clinical applications of selective arterial spin-labeling MR imaging . Radiology 2008; 246:354-364 相关问题 您能解释一下各种ASL方法的不同之处么？哪一种最好？","tags":"ASL","title":"Question-区域选择ASL - 我看到一些ASL参数图上血管区域呈彩色，是如何产生的？"},{"url":"http://chunshan.github.io/MRI-QA/asl/gadolinium-and-asl.html","text":"原文链接: Can gadolinium be given in conjunction with ASL? 概要 注射钆造影剂后的ASL图像 钆造影剂可以和ASL一起使用，但是不要寄希望能够在图像上能够看到任何血流相关信息。 钆显著缩短了血液的T1，因此在反转和读出的这段时间中纵向磁化几乎完全恢复。标记图像和控制图像是完全相同的，相减后的图像并不会揭示流动的信息。对肾功能正常的患者，钆注射后建议一般至少等待8-12小时才能再行ASL检查，如果想要做准确的定量测量，可能至少需要等待24-48小时。 参考材料 Diebler AR, Pollock JM, Kraft RA, et al. Arterial spin-labeling in routine clinical practice, Part 1: techniques and artifacts . AJNR Am J Neuroradiol 2008; 29:1228-1234. 相关问题 我们应该知道ASL的哪些伪影？","tags":"ASL","title":"Question-钆与ASL - 钆可以与ASL一起使用么？"},{"url":"http://chunshan.github.io/MRI-QA/asl/asl-artifacts.html","text":"原文链接: What ASL artifacts should we know about? 概要 磁敏感性伪影 ASL会遇到其他MR成像技术相同的伪影，包括磁敏感性，血流和运动。然而，与常规图像伪影问题相比，一些问题在ASL图像上以不同的方式显现。在左边的图像中，磁敏感性伪影很容易辨认，酷似ASL图像中的灌注不足/梗死区域。 酷似ASL灌注不足区域的磁敏感性伪影 线圈灵敏度伪影 接收线圈灵敏度空间变化导致的伪影也与ASL图像高/低灌注区域很像，在右边的图像中，箭头所指为虚假的灌注升高，通过检查原图像可以辨识其本质。通过图像滤波或者其他的后处理技术可以减轻线圈伪影。 线圈敏感性伪影 运动伪影 控制序列和标记序列之间患者经常会有一定的运动，表现在感兴趣区域周围的光环。大脑ASL中，运动伪影通常表现为明显的头皮可视化，有时也表现为层与层之间亮度上的变化。一般进行后处理运动校正算法对齐对应的图像，减少患者总运动的影响。位置改变大的层面甚至可以丢弃，并不会引起信噪比的显著下降。 连续ASL片层上的运动伪影表现为对比度改变和图像边缘明亮的光环 下游信号损失 大多数ASL技术的一个共同特点是最下游（即反转层面的远端）的片层信号会降低。这种信号的损失由标记质子的从反转到读出这段时间的T1弛豫导致。这种现象在1.5T比3.0T更明显，因为血液固有的T1值在低场下更短。该伪影可通过使用三维读出和并行成像技术缩短图像采集时间减少。 顶部片层的下游信号衰减 血管内信号伪影 晚期到达的标记自旋在成像时刻可能来不及扩散到组织中，仍然存在于大动脉中。如果标记过程中反转的血团没有明确的划定，反转时间（TI）太短，或者动脉血团因病理延迟到达，这种伪影就会发生。 颈动脉闭塞患者的动脉信号 灌注图像上的大血管信号也可表现为大脑或其他器官表面特别明亮的斑点。在上图中，我们看到右侧大脑中动脉（蓝色箭头，左边图像）和上矢状窦（白色箭头，右边图像）的明亮信号。 为了减少大血管信号，往往在读出图像之前立即沿几个轴使用大的双极性破碎梯度，而且还必须要考虑最优TI的选择，这取决于预期的血管流量。儿科患者TI须较短而老年患者TI须较长。尽管大血管信号通常是令人讨厌的伪影，但ASL中持续的高血管信号也是一个有用的临床体征，反映血管疾病导致的动脉延迟运输。右侧的图像显示了大脑动脉的高ASL信号，此患者长期颈内动脉闭塞导致血流缓慢。 失败的背景抑制 由于标记序列和控制序列之间的MR信号差异非常小，任何运动或者背景组织中的其他变化导致的噪声和伪影都可能淹没灌注加权图像，对3D ASL方法尤其如此。为了减少这种伪影，多数临床ASL序列采用几种类型的成像体积的背景抑制。 通常的方法是对静态组织应用额外的切片特定的反转或饱和脉冲，同时保证对血流敏感的部位相对不受影响。如果在ASL检查中背景饱和失败，后处理方法可以识别并且丢弃受影响的层面，从而避免一个完全不可用的检查。 失败的ASL图像背景抑制显示由于T2穿透效应导致的脑室异常高信号（箭头）。原始数据图像显示了背景抑制在控制像（中）上如何失败，但是标记像上没有失败。 参考材料 Diebler AR, Pollock JM, Kraft RA, et al. Arterial spin-labeling in routine clinical practice, Part 1: techniques and artifacts . AJNR Am J Neuroradiol 2008; 29:1228-1234. Petersen ET, Zimine I, Ho Y-C L, Golay X. Non-invasive measurement of perfusion: a critical review of arterial spin labelling techniques . Br J Radiol 2006; 79:688-701. Ye FQ, Mattay VS, Jezzard P, et al. Correction for vascular artifacts in cerebral blood flow values measured by using arterial spin tagging techniques . Magn Reson Med 1997; 37:226–235. (use of bipolar crusher gradients to suppress ASL signal in large arteries) 相关问题 Can gadolinium be given in conjunction with ASL?","tags":"ASL","title":"Question-ASL伪影 - 我们应该知道ASL的哪些伪影？"},{"url":"http://chunshan.github.io/MRI-QA/asl/asl-parameters.html","text":"原文链接: How should imaging parameters be chosen to optimize an ASL acquisition? 概要 儿童有相对成年人更高的血流量，更短的平均通过时间。 最佳成像参数的选择依赖于使用的ASL方法（2D vs 3D， PICORE vs FAIR vs pCASL等）。即使每个序列小的变种（如背景抑制和脉冲形状的类型）都会影响参数选择。预期的血流量也应该考虑，如儿童比成人有更强的血液循环。许多选择是经验型的，因此应该从厂商或是脉冲序列设计人员推荐的参数开始。也就是说，一些一般的规则适用于任何一种ASL实现。 成像平面 所有ASL方法在垂直于成像板的横断面上采集图像时效果最好。 设备 使用尽可能高的磁场强度。ASL技术的信噪比（SNR）有限，因此3.0T比1.5T或更低场强有更好的效果。必须使用多通道线圈。低级别的并行加速（R≈2）对3D采集或许有用，但是对2D采集就需要谨慎采用，因为会造成信噪比损失。 重复时间（TR） 需要足够长使得标记的自旋在两次采集之间真正驰豫，通常大于3500ms。 最小回波时间（TE） 应总是使用最短回波时间防止信号T2/T2*衰减。 空间分辨率 避免\"高分辨率\"成像。以目前的技术状态，SNR上的考虑需要获取的图像分辨率必须比较低，而不能从标准诊断要求的分辨率上考虑。2D ASL的平面矩阵一般在64x64到128x128之间，相应的层厚在4-6mm之间。3D ASL各向同性是可行的但是由于图像采集时间的限制仍然选择各向异性。 信号平均 为了在合理的成像时间（4-6分钟）获得可接受的SNR，需要取多个信号的平均值。2D技术而言，3.0T情况下需要取30到50个信号平均，1.5T情况下更多。对3D技术而言，需要2-4个信号平均。 标记持续时间和标记后延迟反转时间（TI） 这取决于磁场强度，使用的ASL方法和预期的血流速度。如果是1.5T下的脑成像，PASL的标记持续时间为700ms，pCASL为1500ms，TI值则一般为1800ms。由于3.0T下血液的T1更长，TI也需要稍微延长。如果预期动脉血流比较慢，如老年患者或血管病变与低心输出量患者，TI也需要延长。相反，对儿童建议使用较短的TI因为他们的血液循环更快。 破碎梯度 它们的使用是有争议的。尽管可以减少血流相关的伪影，但是也需要延长最短TE，因此SNR减小。它们也会在ASL图像中引入更多T2（T2*）对比度，这种效应必须在定量血流测量中考虑。破碎梯度也可能从ASL图像中去除重要的临床信息，如延迟或侧支循环。 背景抑制 对每个TR使用单一激励的隔离的3D成像方法是必须的。背景抑制对多层的2D方法不是很有效、高效，因此是可选的。背景抑制会略微减弱ASL信号（约5%），如果要做定量血流测量，这种效应要考虑在内。 高级讨论 一些软件为了更高的性能，使用快速，非常低分辨率的多TI ASL序列来评估血团到达时间。如果这种技术可用，可以为每个患者选择最优的TI。 参考材料 Alsop DC, Detre JA, Gola X, et al. Recommended implementation of arterial spin-labeled perfusion MRI for clinical applications: A consensus of the ISMRM perfusion study group and the European consortium for ASL in dementia . Magn Reson Med 2015; 73:102-116. Ferré J-C, Bannier E, Raoult H, et al. Arterial spin labeling (ASL) perfusion: techniques and clinical use . Diagn Interv Radiol 2013; 94:1211-1223 Wong EC. Quantifying CBF with pulsed ASL: technical and pulse sequence factors . J Magn Reson Imaging 2005; 22:727-731. Ye FQ, Mattay VS, Jezzard P, et al. Correction for vascular artifacts in cerebral blood flow values measured by using arterial spin tagging techniques . Magn Reson Med 1997; 37:226–235. (use of bipolar crusher gradients to suppress ASL signal in large arteries) 相关问题 您能解释一下各种ASL方法的不同之处么？哪一种最好？","tags":"ASL","title":"Question-ASL成像参数 - 如何选择成像参数来优化ASL的采集？"},{"url":"http://chunshan.github.io/MRI-QA/asl/pcasl.html","text":"原文链接: What is pCASL and how does it differ from CASL and PASL? 概要 2008年，Dai等提出了CASL和PASL的一种混合方法称为pCASL（Pseudo-Continuous Arterial Spin Labeling）。pCASL使用比较窄的标记平面（与CASL相似），穿过此平面，就会发生动脉自旋流动相关的绝热反转。靠近成像部位标记会立刻进行，最大限度地减少由于标记血液延迟引起的信号损失。CASL使用连续的射频辐射，pCASL则是使用一连串非常短的射频脉冲，模仿单一的长CASL脉冲的作用，但是能量沉积则小得多，射频脉冲放大器占空比的要求也小得多。 pCASL技术：狭窄标记带靠近成像部位 pCASL技术：狭窄标记带靠近成像部位 典型的pCASL实现会在1.5s时间内施加750个Hanning状的20°射频脉冲，每一个持续0.5ms。标记序列中层面选择梯度的重聚部分是不平衡的。这意味着流动自旋会在每一个施加的射频脉冲期间累计额外的相位偏移。控制序列使用平衡的梯度场去除这种效应，另外，控制序列中每一个RF脉冲的相位是交替的。 由于前面已经介绍的原因，pCASL非常受欢迎，是我们目前选择的ASL方法。与PASL相比，pCASL有更高的信噪比，而且对标记后血流的（示踪剂）分散更不敏感。与CASL相比，pCASL有更高的标记效率，能够在现代扫描器中仅通过软件修改就能实现。但是pCASL的标记效率没有PASL高，而且对血流速度，血流角度，B0和B1场的不均匀性非常敏感。 高级讨论 流动自旋可以被组合的射频脉冲和梯度场选择性地反转的想法是CASL和pCASL有趣而独特的特征。其背后的物理基础有点复杂，需要引入流动相关的绝热反转概念。CASL和pCASL中自旋反转的机制与PASL并不相同，PASL中使用传统的绝热反转脉冲，标记时不需要流动。 一般的绝热现象已经在之前的一个Q&A中介绍过。简单来说，绝热激发是一种仅在某些限制条件下发生的特殊类型的RF刺激，会产生一个近乎完美的净磁化（M）反转，对B1场的不均匀性也相对不那么敏感。这种现象在核磁共振发展的早期就被描述，对一个恒定磁场中的试样进行连续的RF激发，激发频率从远低于共振频率到远高于共振频率进行扫描，假使B1场足够强而且应用地足够慢（绝热条件），净磁化（M）的章动在扫描结束时会完全反转。 令人惊讶的是，ASL中流动自旋的绝热反转在RF场即使保持在恒定频率和振幅时也会发生。如果流动方向正好有一个很强的空间梯度场，而且同时伴随RF激发，绝热反转就会发生。当流动自旋沿着梯度方向移动，质子的共振频率就会随位置变化，外部看起来固定的RF场对流动的自旋而言就像频谱范围比较大的RF场。因此它们就会进行绝热跟随和反转，假使它们的速度（v）与动脉血的T2驰豫时间相比既不太长也不太短，梯度场强度（G）和有效场（≈ B1）的振幅满足如下关系：1/T2 << G•v/B1 << γB1。 参考材料 Dai W, Garcia D, de Bazelaire C, Alsop DC. Continuous flow driven inversion for arterial spin labeling using pulsed radiofrequency and gradient fields . Magn Reson Med 2008; 60:1488-1497. (original description of pCASL) Golay X, Hendrikse J, Lim TCC. Perfusion imaging using arterial spin labeling . Top Magn Reson Imaing 2004; 15:10-27. (Good review plus a description of ASL of variants and acronyms such as FAIRER, TILT, BASE, and others). Luh W-M, Wong EC, Bandettini PA, Hyde JS. QUIPSS II with thin-slice TI1 periodic saturation: a method for improving accuracy of quantitative perfusion imaging using pulsed arterial spin labeling . Magn Reson Med 1999; 41:1246-1254. Petersen ET, Lim T, Golay X. Model-free arterial spin labeling quantification: approach for perfusion MRI . Magn Reson Med 2006; 55:219-232. (QUASAR method) Wong EC, Buxton RB, Frank LR. Quantitative imaging of perfusion using single subtraction (QUIPSS and QUIPSS II) . Magn Reson Med 1998; 39:702-708. 相关问题 您能解释一下各种ASL方法的不同之处么？哪一种最好？","tags":"ASL","title":"Question-伪连续动脉自旋标记（pCASL） - pCASL是什么？它与CASL和PASL有何不同？"},{"url":"http://chunshan.github.io/MRI-QA/asl/pasl.html","text":"原文链接: What is PASL and how does it differ from CASL? 概要 上一个Q&A中介绍的CASL（Continuous Arterial Spin Labeling）技术现在仅具有历史和教学意义，从20世纪90年代末逐渐失宠。CASL的主要问题是组织能量沉积比较高，而且由于连续RF脉冲的使用，发射线圈的占空比要求也比较高。因此PASL诞生了，PASL是ASL方法的一个大类的统称，使用脉冲（而不是连续）RF激励。三个PASL的变种在下表中描述。 脉冲动脉自旋标记方法（PASL） 最早的PASL方法由Edelman和他的同事在20世纪90年代中期提出，称为 EPISTAR（Echo-Planar Imaging-based Signal Targeting by Alternating Radiofrequency pulses） 。EPISTAR的标记像序列首先进行层选择性的90°脉冲和使用扰相梯度初步饱和成像层面中的磁化。（此脉冲的轮廓通常会略宽于成像层面以最小化一侧射频带来的伪影，并确保饱和度一致性。）然后使用180°绝热RF脉冲反转近端一个比较厚层面中流动的自旋。控制像序列重复成像层面中静态组织的90°扰相饱和梯度，接着反转远端比较厚的镜像层面来创造与第一个厚层相同的MT效应。控制像与标记像相减就产生灌注加权的图像，其中MT效应已经最小化。 单层EPISTAR随后进化为几个多层的变种（STAR，PULSAR和QUASAR），其中几个已经被Philips开发为商用产品。在高级讨论中会对此简要介绍。 PICORE (Proximal Inversion with Control of Off-Resonance Effects) 是另一个与EPISTAR相似的非对称多层PASL技术。实际上，标记序列与EPISTAR相同，也会进行成像层面饱和和使用近端反转脉冲。控制序列的不同之处在于180°反转脉冲使用与成像层面相同的频率偏移，这点与标记序列一样，但是没有空间梯度。 FAIR (Flow-sensitive Alternating Inversion Recovery) 采用一个稍微不同的脉冲标记策略，标记脉冲关于成像层面对称。标记序列首先会在成像层面周围的一个小区域施加一个空间选择的反转脉冲（此脉冲的轮廓通常会略宽于成像层面以最小化一侧射频带来的伪影，并确保饱和度一致性。）。控制序列会施加相同的反转脉冲但是没有选层梯度场。这会导致射频线圈内整个敏感体积中的自旋反转。Siemens的产品中就使用了带Q2-TIPS饱和的PICORE和FAIR序列（见高级讨论）。 EPISTAR，PICORE和FAIR的选择部分取决于希望成像区域中血流的结构。PICORE只从一侧标记血流，因此对血供都来自颈部的轴向脑灌注成像是一个合理选择。血流来自多个或者未知方向的情况下（如矢状位脑灌注成像或如肝这样的复杂器官中），FAIR会是一个更好的选择，因为它会标记成像容积的两侧。另外一个方面，FAIR可能对不必要的静脉血流引起的污染更加敏感，由于反转的层面轮廓不完美实现多层模式更加困难。在某些情况下，EPISTAR相较于其他方法会更有优势，因为其控制序列和标记序列间平衡的厚层选择梯度，从而涡电流伪影更少。 高级讨论 三种PASL技术之间另一个不同之处在于标记状态（St）和控制状态（Sc）之间信号的极性不同。对EPISTAR和PICORE而言，流入的动脉自旋是反转的，因此St<Sc；对FAIR而言，标记状态时磁化不是反转的但是在控制状态时磁化是反转的，因此St>Sc。 上文提到的EPISTAR变种 多层STAR（Signal Targeting by Alternating Radiofrequency pulses）以快速连续的两个一半幅度的近端反转层面取代了EPISTAR控制序列中单一的远端反转层面。这与CASL方案2有相同的效果，能够在成像层面上创建相同的MT效应但是对流动的自旋没有净效应。 PULSAR（PULsed StAR）使用与STAR相同的反转策略但是使用更复杂的4光谱水抑制脉冲替代成像层面中90°选层脉冲和扰相梯度预饱和。 QUASAR（QUantitative Star labeling of Arterial Regions）使用PULSAR中的标记和控制模块，紧接着施加Look-Locker策略采样多个时间点用于T1估计，和一个重复的类似于Q2-TIPS的饱和机制使得动脉血流更锐利。其他高级功能包括使用动脉输入函数（AIF）卷积方法进行的灌注量化。 锐化动脉血团 由于传输延迟和分散，血团的前边缘和后边缘可能都有些不明确。几个脉冲序列的改进版被提出来用于\"锐化\"也就是提升血团边缘的定义。比较早的一个称为QUIPSS (Quantitative Imaging of Perfusion using a Single Subtraction)，QUIPSS涉及PASL序列读出之前增加一个额外的用于层面选择的90°、18叶sinc饱和脉冲，如果应用于成像容积称为QUIPSS I或者应用于标记容积称为QUIPSS II。我们使用的一个流行的变种是Q2TIPS (QUIPSS II with Thin-slice TI1Periodic Saturation)，其使用标记区域远端一系列的厚层饱和脉冲取代单一的厚层饱和脉冲。两个操作者可选的参数可用于确定饱和链的开始和结束时间（也就是血团的边缘）。我们的Q2TIPS序列使用16个非常有选择性的抑制（VSS）脉冲，在最初反转后800-1200ms的时间窗内每隔25ms施加一次。这将饱和一个2cm厚的组织层面，留下距第一个成像层面大约1cm的间隔。 参考材料 Edelman RR, Chen Q. EPISTAR MRI: Mulitslice mapping of cerebral blood flow . Magn Reson Med 1998; 40:800-805. (Later iteration of EPISTAR with modifications and multi-slice acquisition) Edelman RR, Siewert B, Darby DG, et al. Qualitative mapping of cerebral blood flow and functional localization with echo-planar MR imaging and signal targeting with alternating frequency . Radiology 1994; 192:513-520. (one of the early descriptions of EPISTAR) Golay X, Hendrikse J, Lim TCC. Perfusion imaging using arterial spin labeling . Top Magn Reson Imaing 2004; 15:10-27. (Good review plus a description of ASL of variants and acronyms such as FAIRER, TILT, BASE, and others). Golay X, Peterson ET, Hui F. Pulsed Star labeling of arterial regions (PULSAR): a robust regional perfusion technique for high field imaging . Magn Res Med 2005; 53:15-21. Kim S-G. Quantification of relative cerebral blood flow change by Flow-sensitive Alternating Inversion Recovery (FAIR) technique: application to functional mapping . Magn Reson Med 1995; 34:293-301. (original description of FAIR technique) Luh W-M, Wong EC, Bandettini PA, Hyde JS. QUIPSS II with thin-slice TI1 periodic saturation: a method for improving accuracy of quantitative perfusion imaging using pulsed arterial spin labeling . Magn Reson Med 1999; 41:1246-1254 (description of the Q2TIPS method). Petersen ET, Lim T, Golay X. Model-free arterial spin labeling quantification: approach for perfusion MRI . Magn Reson Med 2006; 55:219-232. (QUASAR method) Wong EC, Buxton RB, Frank LR. Implementation of quantitative perfusion imaging techniques for functional brain mapping using pulsed arterial spin labeling . NMR in Biomed 1997; 10:237-249. (description of the PASL/PICORE method) 相关问题 您能解释一下各种ASL方法的不同之处么？哪一种最好？ What is pCASL and how does it differ from CASL and PASL?","tags":"ASL","title":"Question-脉冲动脉自旋标记（PASL） - PASL是什么？它与CASL有何不同？"},{"url":"http://chunshan.github.io/MRI-QA/asl/casl.html","text":"原文链接: What is CASL? 概要 我们现在称之为CASL（Continuous Arterial Spin Labeling，CASL）的技术是最早真正的ASL方法，由Williams，Detre，及其他们的同事在20世纪90年代初提出。CASL使用一个恒定，低幅度，连续的RF脉冲结合成像梯度场使得成像层面近端的血流自旋反转。当这些自旋反转的血液流到成像层面，就会使信号强度略微下降，通过减法技术可以检测出信号的变化。虽然CASL目前仅有其历史价值，但如果要理解更新和更复杂的ASL技术，仍然需要首先理解CASL所体现的基本概念。 CASL（及其他所有ASL技术）中使用的反转脉冲产生一个有趣的（带来麻烦的）MR现象，磁化传递（Magetization Transfer，MT）。如在前面一个 Q&A 提到的，集中在反转层面的RF脉冲一处\"溢出\"就会导致MT现象，间接降低成像层面的信号强度。MT效应是由于水-大分子偏共振的相互作用导致的，与由流动产生的ASL信号完全独立。 MT现象在通常成像中也会发生，但通常不会引人注意，因为它仅会影响相邻层面组织信号强度的百分之几。在ASL中，标记图像和控制图像中的信号变化本就小于1%，不希望的MT效应产生的信号变化可能会压倒希望的血流相关的信号变化。 所有的ASL技术都需要解决如何消除MT效应的影响。下图给出了\"MT问题\"的说明和CASL中两种可能的解决办法。 MT问题和两种CASL方法 上图的顶部一行说明了MT问题。使用一个偏共振（不同的共振频率和位置）的反转脉冲会降低成像层面的信号强度。这会混淆反映灌注的期望的信号改变。 第二行说明了最初的CASL解决方案。控制像使用第二个反转脉冲得到，该脉冲与第一个反转脉冲相同但是施加在成像层面相反的另一面。成像层面内的MT效应在标记像和控制像上是相同的，两张图像相减时MT效应被消除。 CASL解决方案2是由Alsop和Detre（1998）提出的最初方案的改进版。这种方法中扫描控制像序列的反转脉冲使用振幅调制分为两部分（边带），每个边带的幅值是原来脉冲的一半儿，而且两个边带离得很近，因此成像层面上的MT效应保持不变，控制像和标记像相减就可消除MT效应。分开的两个脉冲会使得控制像序列中流动血液的自旋没有净反转，因为成对并排放置的两个180°脉冲相当于360°脉冲（双重反转）。 CASL技术从20世纪90年代末逐渐失宠，对现在主要是历史和教学意义。CASL的主要问题是组织能量沉积比较高，而且由于连续RF脉冲的使用，发射线圈的占空比要求也比较高。因此PASL诞生了，PASL是ASL方法的一个大类的统称，使用脉冲（而不是连续）RF激励。PASL及其变种在下一个Q&A中讨论。 高级讨论 流动自旋可以被组合的射频脉冲和梯度场选择性地反转的想法是CASL和pCASL有趣而独特的特征。其背后的物理基础有点复杂，需要引入流动相关的绝热反转概念。 一般的绝热现象已经在之前的一个Q&A中介绍过。简单来说，绝热激发是一种仅在某些限制条件下发生的特殊类型的RF刺激，会产生一个近乎完美的净磁化（M）反转，对B1场的不均匀性也相对不那么敏感。这种现象在核磁共振发展的早期就被描述，对一个恒定磁场中的试样进行连续的RF激发，激发频率从远低于共振频率到远高于共振频率进行扫描，假使B1场足够强而且应用地足够慢（绝热条件），净磁化（M）的章动在扫描结束时会完全反转。 令人惊讶的是，ASL中流动自旋的绝热反转在RF场即使保持在恒定频率和振幅时也会发生。如果流动方向正好有一个很强的空间梯度场，而且同时伴随RF激发，绝热反转就会发生。当流动自旋沿着梯度方向移动，质子的共振频率就会随位置变化，外部看起来固定的RF场对流动的自旋而言就像频谱范围比较大的RF场。因此它们就会进行绝热跟随和反转，假使它们的速度（v）与动脉血的T2驰豫时间相比既不太长也不太短，梯度场强度（G）和有效场（≈ B1）的振幅满足如下关系：1/T2 << G•v/B1 << γB1。 参考材料 Alsop DC, Detre JA. Multisection cerebral blood flow MR imaging with continuous arterial spin labeling . Radiology 1998; 208:410-416. (improvement of the CASL technique using an amplitude modulated inversion pulse to self-correct for off-resonance effects) Williams DS, Detre JA, Leigh JS, Koretsky AP. Magnetic resonance imaging of perfusion using spin inversion of arterial water . Proc Natl Acad Sci USA 1992; 89:212-216. (first demonstration of ASL, using a single-slice continuous technique in a rat brain, later known as CASL) Wong EC, Buxton RB, Frank LR. Implementation of quantitative perfusion imaging techniques for functional brain mapping using pulsed arterial spin labeling . NMR in Biomed 1997; 10:237-249. (comparison of CASL to pulsed methods) 相关问题 您能解释一下各种ASL方法的不同之处么？哪一种最好？ What is pCASL and how does it differ from CASL and PASL?","tags":"ASL","title":"Question-连续动脉自旋标记（CASL） - CASL是什么？"},{"url":"http://chunshan.github.io/MRI-QA/asl/asl-methods-overview.html","text":"原文链接: Can you briefly explain the difference between the various ASL methods? Which is the best? 概要 所有动脉自旋标记（ASL）脉冲序列由两部分组成：1）准备模块，用于磁性标记血流；2）读出模块，产生目标组织成对的\"控制像\"和\"标记像\"。ASL方法可以根据上述两个模块如何构建进行分类。 ASL技术的分类 最早的ASL技术使用连续射频发射结合施加于血流方向的梯度磁场反转流动的自旋质子，称为连续动脉自旋标记（Continuous Arterial Spin Labeling，CASL）。这些序列在商用扫描仪上很难实用，因为会让组织显著发热。到20世纪90年代末， CASL方法基本上被抛弃，脉冲发射的方法受到青睐。统称为脉冲动脉自旋标记（Pulsed Arterial Spin Labeling， PASL）。PASL技术可进一步分为相对于成像平面不对称地标记（EPISTAR，PICORE）和相对于成像平面对称地标记（FAIR）。最近一种混合形式的ASL被开发出来，伪连续动脉自旋标记（pseudo-Continuous Arterial Spin Labeling）使用一系列短的射频脉冲和强大的切片选择梯度。pCASL结合了CASL（高信噪比）和PASL（低能量沉积）的优点。现在大多数市售的ASL产品基于pCASL或者PASL的变种。 最早的ASL方法中，读出（成像）模块只能为使用平面-梯度回波技术获得的单个平面，随后多平面成像技术也被开发出来。使用快速自旋回波和快速梯度回波成像的方法也随后诞生，而且多平面2D和3D采集方法都可采用。 2D图像采集 对头动不是那么敏感，用于血流定量的话，可能比3D采集更好。为了获得最佳的图像质量，推荐进行预扫描和场映射。2D采集方法的缺点是远端切片比近端切片有更长的标记延迟，由于驰豫效应的影响导致信号层与层之间不同。 3D图像采集 比2D图像采集所需时间稍长，但是更容易实现。3D采集方式有更高的信噪比和更高的空间分辨率，而且不同层之间的标记延迟是固定的。目前3D采集技术不能与fMRI研究兼容，因为不能获得短时间间隔内的灌注变化。3D图像采集时一般也会进行背景抑制，但是背景抑制会降低灌注信号，并且可能混淆绝对血流量的计算。 主要ASL序列的技术细节和更完整的描述在接下来的几个Q&A中。 高级讨论 第四种ASL方法称为速度选择性动脉自旋标记（Velocity-Selective Arterial Spin Labeling，VSASL），目前仍主要限于研究中心。与其它的ASL方法不同，VSASL基于血流速度标记血液，而不是空间位置。破碎梯度用于饱和比选定截止速度流动更快的自旋，因此允许标记更慢的血流。由于标签不是空间选择性的，VSASL比其他的ASL方法对长时间的传输延迟更不敏感。VSASL的缺点是SNR比较低，选择合适的截止速度也比较困难。 参考材料 Borogovac A, Asllani I. Arterial spin labeling (ASL) fMRI: advantages, theoretical constrains and experimental challenges in neurosciences . Int J Biomed Imaging 2012; Article ID 818456:1-13. Diebler AR, Pollock JM, Kraft RA, et al. Arterial spin-labeling in routine clinical practice, Part 1: techniques and artifacts . AJNR Am J Neuroradiol 2008; 29:1228-1234. Essig M, Shiroishi MS, Nguyen TB, et al. Perfusion MRI: the five most frequently asked technical questions . AJR Am J Roentgenol 2013; 200:24-34. Ferré J-C, Bannier E, Raoult H, et al. Arterial spin labeling (ASL) perfusion: techniques and clinical use . Diagn Interv Radiol 2013; 94:1211-1223 Jahng G-H, Li K-L, Ostergaard l, Calamante F. Perfusion magnetic resonance imaging: a comprehensive update on principles and techniques . Korean J Radiol 2014; 15:554-577. (good recent review). McGehee BE, Pollock JM, Maldjian JA. Brain perfusion imaging: how does it work and what should I use ? J Magn Reson Imaging 2012; 36:1257-1272. Wong EC, Cronin M, Wu W-C, et al. Velocity-selective arterial spin labeling . Magn Reson Med 2006; 55:1334-1341. 相关问题 What is PASL and how does it differ from CASL? What is pCASL and how does it differ from CASL and PASL?","tags":"ASL","title":"Question-ASL方法概述 - 您能解释一下各种ASL方法的不同之处么？哪一种最好？"},{"url":"http://chunshan.github.io/MRI-QA/asl/what-is-asl.html","text":"原文链接: What is arterial spin labeling (ASL) and how does it work? 概要 动脉自旋标记（ASL），也被称为动脉自旋标记法，是一种利用患者自身的水分子作为示踪剂测量灌注的磁共振成像方法。与动态磁敏感对比成像（DSC）和动态对比增强成像（DCE）不同，ASL不需要注射钆造影剂或任何其他的外源性对比剂。 ASL的基本原理是，首先，采集感兴趣区图像（下图中为大脑半球）作为\"控制像\"；然后，\"标记\"脉冲施加于成像平面的上游层面，使此层面中水分子的自旋方向反转。在接下来的几秒钟内，大部分血管中\"磁标记\"的分子会流向成像区域，这些标记的水分子会与静态组织中的水分子交换磁化强度，使后者的平衡磁化强度略有降低（1%-2%）。感兴趣区域被重新成像，称为\"标记像\"，\"控制像\"与\"标记像\"逐像素相减得到的图像就是灌注加权的图像。 ASL中产生图像对比的基本原理的说明 与钆造影剂相比，水是一种扩散性示踪剂，这意味着标记的水分子不会局限于血管外空间，而是在ASL实验的过程中可以自由地从毛细血管进入到组织细胞。这会影响定量灌注的数学建模和计算。 除了测量灌注，ASL方法也可应用于磁共振血管造影产生血管图像。ASL还被越来越多地在功能磁共振成像中用于记录大脑激活区域，作为BOLD（血氧水平依赖技术）的替代方法。 有几种方法可用于ASL标记和成像，并没有单一的无可争议的最佳方法产生。这些技术的优点和缺点将会在后续的Q&A中探讨。 高级讨论 说明ASL基本原理的上图有厚厚的标记层面，一般用于PASL。对于CASL和pCASL，反转区域应该被压缩为一个窄带，对流经的血液进行标记。 此外，并非所有的ASL序列都会导致标记层面中的血流信号相对于\"控制像\"降低。在PASL的变种FAIR序列中，控制层面中的组织被抑制，流入血液具有比背景稍高的信号。 参考材料 Borogovac A, Asllani I. Arterial spin labeling (ASL) fMRI: advantages, theoretical constrains and experimental challenges in neurosciences . Int J Biomed Imaging 2012; Article ID 818456:1-13. Diebler AR, Pollock JM, Kraft RA, et al. Arterial spin-labeling in routine clinical practice, Part 1: techniques and artifacts . AJNR Am J Neuroradiol 2008; 29:1228-1234. Essig M, Shiroishi MS, Nguyen TB, et al. Perfusion MRI: the five most frequently asked technical questions . AJR Am J Roentgenol 2013; 200:24-34. Ferré J-C, Bannier E, Raoult H, et al. Arterial spin labeling (ASL) perfusion: techniques and clinical use . Diagn Interv Radiol 2013; 94:1211-1223 Jahng G-H, Li K-L, Ostergaard l, Calamante F. Perfusion magnetic resonance imaging: a comprehensive update on principles and techniques . Korean J Radiol 2014; 15:554-577. (good recent review). McGehee BE, Pollock JM, Maldjian JA. Brain perfusion imaging: how does it work and what should I use ? J Magn Reson Imaging 2012; 36:1257-1272. 相关问题 What is arterial spin labeling (ASL) and how does it improve MRA? Can you briefly explain the difference between the various ASL methods? Which is the best?","tags":"ASL","title":"Question-动脉自旋标记（ASL） -  什么是动脉自旋标记（ASL）？它是如何工作的？"},{"url":"http://chunshan.github.io/MRI-QA/dce/utility-of-dce.html","text":"原文链接: When might quantitative DCE imaging be useful? Can you give some examples? 概要 坦率的说，以目前DCE的发展水平，我对量化DCE广泛向临床中推广没有多少热情。仔细查看现有的文献，读者会发现测量参数的值在不同的研究机构中有显著地不同。如果比较不同的肿瘤（如淋巴瘤和胶质母细胞瘤），我注意到测量参数如Ktrans和ve统计上有显著差异，但是组间的重叠使得这些差异没有实践的价值。至今为止我们研究过的大多数脑肿瘤病例中，量化DCE只是与观察造影剂摄取的时间-信号强度曲线相比提高了诊断概率，与常规DSC或者弥散加权成像相比丰富了测量参数。如果你愿意相信并且想知道为什么一些人认为量化DCE成像有一个光明的未来，请继续往下读。 DCE成像的病理基础在于侵略性更强，恶性程度更高的肿瘤有更多的新血管生成（这一基础概念并非无懈可击）。为了给肿瘤迅速增殖的细胞提供营养物质，血流量和血容量通常会增加，组织中血管和血浆（vp）所占的比例也会增加。肿瘤血管表面积增加，而且有固有的泄露，因此它们的渗透性-表面积乘积增加，我们预计肿瘤的Ktrans也会变高。此外，恶性肿瘤往往有坏死区域，导致与良性肿瘤相比细胞外空间比例（ve）增大。 一个驱动肿瘤学家推动量化DCE成像的基本动机是DCE能够预测并监控肿瘤反应。一些新的化疗药物如bevacizumab和cediranib是针对血管内皮生长因子（VEGF），这些药物不直接对肿瘤细胞产生细胞毒性，因此不会导致肿瘤立即萎缩。然而，通过降低血管通透性影响Ktrans和vp，是一种可用于评估治疗效果的潜在量化方法。类似的原因，DCE参数也有望区分进展性肿瘤和假性进展肿瘤，区分肿瘤复发与肿瘤放射性坏死。我们的两个病例展示了DCE成像在脑肿瘤中的应用，如下图。 ↑ enhancement ↑ K trans ↑ v e ↑ v p 10 months later 上图：DCE预测复发性胶质瘤（阳性）。对比度显著增强，Ktrans，ve，vp显著升高。10个月后的随访显示肿瘤处于进展中 下图：在治疗脑胶质瘤中不能提供明确诊断结果的DCE评估。对比度显著增强，Ktrans和ve显著升高，vp稍微升高。能够确定这是肿瘤么？随访3年后仅表现为治疗相关变化，没有肿瘤进展或复发。 ↑ enhancement ↑ K trans ↑ v e slight ↑ v p 3 year followup 参考材料 Choi HS, KIm AH, Ahn SS, et al. Glioma grading capability: comparisons among parameters from dynamic contrast-enhanced MRI and ADC value on DWI . Korean J Radiol 2013; 14:487-92. (sounds great, but remember that many of the low-grade gliomas enhance weakly, if at all, so DCE parameters will reflect this.) Chikui T, Obara M, Simonetti AW, et al. The principal (sp) of dynamic contrast enhanced MRI, the method of pharmacokinetic analysis, and its application in the head and neck region . Int J Dentistry 2012; doi:10.1155/2012/480659 Fatterpekar GM, Galheigo D, Naryana A, et al. Treatment-related change versus tumor recurrence in high-grade gliomas: a diagnostic conundrum — use of dynamic susceptibility contrast-enhanced (DSC) perfusion MRI . Am J Roentgenol 2012; 198:19-26. (acutally about DSC, not DCE, but gives an excellent description of the pathology of treatment-related changes in brain tumors). Kickingereder P, Sahm F, Wiestler B, et al. Evaluation of microvascular permeability with dynamic contrast-enhanced MRI for the differentiation of primary CNS lymphoma and glioblastoma: radiologic-pathologic correlation . AJNR Am J Neuroradiol 2014; 35:1503-1508. (some statistical differences in DCE parameters noted, but significant overlap between the two diseases in my opinion makes the technique worthless.) Zhang N, Zhang L, Qui B, et al. Correlation of volume transfer coefficient Ktrans with histopathologic grades of gliomas . J Magn Reson imaging 2012; 36:355-363. 相关问题 How are quantitative DCE parameters extracted from the signal data?","tags":"DCE","title":"Question-量化DCE的应用  什么情况下量化的DCE成像是有用的？有没有这样的例子？"},{"url":"http://chunshan.github.io/MRI-QA/dce/k-trans--permeability.html","text":"原文链接: Is Ktrans the same as permeability? 概要 钆（黑点）进入组织的体积转移速率（Ktrans）依赖于血浆流量（F），渗透性（P）和血管表面积（S） 体积转移常数（Ktrans）反映钆造影剂从血浆进入血管外细胞外空间（EES）组织的流出速率。Ktrans取决于于三个因素：血浆流量（F），血管通透性（P）和单位质量的毛细血管表面积（S）。在实践中，渗透性和表面积分别的贡献不能清楚地分离出来，因此一般把它们一起考虑，即乘积PS。 如下图所示，两个有相同血流和PS乘积的毛细血管网络中，钆将会以相同的速率进入组织，即使它们的渗透性和表面积可能不同。 两种有具有相同流量（F）和PS乘积的毛细血管网络有相同的Ktrans值 一般而言，F,P,S分别对Ktrans的贡献不能分开。然而，两种特殊情况可以揭示这三个因素相对的重要性及它们的相互作用。 情况1 （渗透性有限） 这种情况下（下面的左图），血浆流量（F）比PS乘积大得多。大量钆随血流传送到组织，但进入组织间隙的量仅取决于毛细血管床的大小和渗透性。这种情况下，Ktrans = P×S。 情况2 （流量有限） 这种情况下血浆流量比PS乘积小的多，所有钆在到达毛细血管床的静脉端之前几乎都泄露到EES，因而，Ktrans = F。 高级讨论 毛细血管渗透性的单位（cm/min）并不是那么显而易见的。渗透性（P）定义为由于浓度（moles/cm³）差的驱动，一段时间内（min）一种溶质通过给定面积（cm²）薄膜的摩尔数。因此该单位可以写为： P = [moles]/[cm²]/[min]/[moles/cm³] = cm/min 同样，S并不表示毛细血管的表面积（单位cm²），而是表示\"每单位质量组织中的表面积比例\"。因此S通过面积/质量度量（比如，cm²/100g）。总起来，PS乘积的单位是 [cm/min]•[cm²/100g] = cc/min/100g，与流量（F）的单位是相同的。 参考材料 Cuenod CA, Balvay D. Perfusion and vascular permeability: basic concepts and measurement in DCE-CT and DCE-MRI . Diagn Interv Imaging 2013; 94:1187-1204. (Good review of basic mechanisms; some terminology is slightly different than abbreviations used in Tofts models). Pappenheimer JR. Passage of molecules through capillary walls . Physiol Rev 1953; 33;387-423. Sourbron S, Ingrisch M, Siefert A, et al. Quantification of cerebral blood flow, cerebral blood volume, and blood-brain-barrier leakage with DCE-MRI . Magn Reson Med 2009; 62:205-217. Tofts PS. T1-weighted DCE imaging concepts: modelling, acquisition and analysis . MAGNETOM Flash 2010; 3:30-35. Zhang N, Zhang L, Qui B, et al. Correlation of volume transfer coefficient Ktrans with histopathologic grades of gliomas . J Magn Reson Imaging 2012; 36:355-363. 相关问题 What quantitative parameters can be extracted from the DCE data? How do calculated DCE parameters relate to patterns of enhancement we see on clinical images?","tags":"DCE","title":"Question-Ktrans & 渗透性  Ktrans是否等同于渗透性?"},{"url":"http://chunshan.github.io/MRI-QA/dce/parameters-to-images.html","text":"原文链接: How do calculated DCE parameters relate to patterns of enhancement we see on clinical images? 概要 流行的Tofts模型包含与钆在组织中的药代动力学相关的四个参数。通过数学分析可以计算这些参数并且创建它们的解剖参数图。但是这些参数在实践中有何意义？它们与我们观察到的视觉上的动态增强图像有何关联？ 钆增强的恶性胶质瘤T1加权像 Ktrans 参数图 第一个也是最重要的一个DCE参数是Ktrans，钆在血浆和血管外细胞外间隙（EES）组织的体积转移常数。像化学反应速率，它的单位是1/time，如min-1,。简而言之，Ktrans反映的是钆从血浆流入EES所有过程的总和（主要是血流量和毛细血管渗透）。 Tofts模型中第二个独立的动力学参数是EES的体积分数，表示为Ve，正式定义是每单位体积组织中EES的体积，是一个介于0到1之间的无量纲的数字。Ve反映组织间质中聚集钆的可用空间的大小。 Tofts模型中的第三个参数是Kep，表示钆从EES返流回血管系统的时间常数。回想一下，Kep不是一个完全独立的参数，它被定义为前两者的比率（如Kep = Ktrans/Ve），所以Kep的增加反映的是Ktrans的增加或者Ve的减少，或者二者兼而有之。 扩展的Tofts模型中出现的第四个参数是Vp，血浆的体积分数。在许多病变中这个变量比较小而且无关紧要。然而在严重的血管肿瘤中，血管内对总信号的贡献会达到10%或更大，以至不能被忽略。 DCE参数Ktrans，Ve，kep，vp与不同组织的时间-信号强度（钆浓度）曲线的形态有直接联系。具体表现为， Ktrans与时间-信号强度曲线的初始斜率（\"wash-in\"速率）相关 ve与时间-信号强度曲线的峰高和达峰时间（TTP）相关 kep控制曲线的形状，反映独立分量Ktrans和ve的相对贡献。 vp，如果比较小，对曲线的影响不大，但是如果vp比较大，导致时间-信号强度曲线更快速的上坡，更高更早的峰高，更快的造影剂流出，变得与动脉输入函数更为相似。 固定ve，Ktrans与时间-信号强度曲线的初始上升斜率（\"wash-in\"速率）相关 固定Ktrans，ve与时间-信号强度曲线的峰高和达峰时间（TTP）相关 随着vp增大，时间-信号强度曲线变得与动脉输入函数更为相似 参考材料 Ferrier MC, Sarin H, Fung SH, et al. Validation of dynamic contrast-enhanced magnetic resonance imaging-derived vascular permeability measurements using quantitative autoradiography in the RG2 rat brain tumor model . Neoplasia 2007; 9:546-555. (Good correlation between Ktrans and autoradiographically measured influx rate in a rat glioma model with high permeability). Tofts PS. Modeling tracer kinetics in dynamic Gd-DTPA MR imaging . J Magn Reson Imaging 1997; 7:91-101. Tofts PS. T1-weighted DCE imaging concepts: modelling, acquisition and analysis . MAGNETOM Flash 2010; 3:30-35. 相关问题 How do you evaluate the information obtained from a DCE imaging study?","tags":"DCE","title":"Question-DCE参数与图像 -- 计算的DCE参数如何与我们在临床图像上看到的增强模式相联系？"},{"url":"http://chunshan.github.io/MRI-QA/dce/dce-tissue-parmeters.html","text":"原文链接: What quantitative parameters can be extracted from the DCE data? 概要 DCE原始数据被转换为钆造影剂浓度后，下一步是确定一个用于数据拟合的组织模型。比较简单而且广泛使用的模型是由Paul Tofts和他的同事们提出的，说明如下。 Tofts模型。图中细胞外空间相对于不含钆的细胞内空间（深蓝色）有些夸大。此外，血浆体积分数（vp，米色）一般比细胞外血管外空间的体积分数（Ve，浅蓝色）小得多。 在Tofts模型中，每个体素包含三种成分：组织实质细胞（深蓝色），血管（含红细胞和血浆），组织的细胞外血管外空间（EES）。钆造影剂在刚刚注射后是在血浆中的，由于浓度梯度的存在，会通过血管内皮细胞被动扩散到细胞外血管外空间（EES）。钆的容积转移常数（Ktrans）依赖于血流，血管表面积，和血管通透性。与Ktrans相关的速率常数 kep表示从细胞外血管外空间返流回血浆的速率。钆造影剂不进入细胞，所以它的浓度取决于血浆体积分数（vp）和EES的体积分数 (ve) ，这两个体积分数都是无量纲的，在图中有标示。 Tofts 模型有两个基本的数学公式（见下面高级讨论）。第一个公式假设血浆体积分数（Vp）比较小，对总组织的磁共振信号贡献比较小。Tofts模型的第二个公式包含了血浆的贡献，这增加了复杂性，但是可能更适合表示严重血管病变的情况，如恶性肿瘤。Tofts模型中DCE参数的意义和实际使用将在后续几个Q&A中进行探索。 高级讨论 使用Tofts模型进行药代动力学分析 最初的Tofts-Kermode模型（1991年）假设组织中钆造影剂的平衡浓度Ct仅由血浆中造影剂浓度（Cp）与细胞外血管外组织中造影剂浓度（Ce）差异导致的简单被动扩散驱动。由于钆造影剂不进入细胞，Ce比Ct高了1/Ve，Ve（0<Ve<1）是细胞外血管外空间（EES）组织的无量纲体积分数。Tofts-Kermode方程定义如下： 其中Ktrans 是容积转移常数，单位是min−1。该方程的右边可以重写为： 其中， kep 定义为Ktrans/ve，表示造影剂从EES返流回血浆的速率。Ktrans, ve, 和 kep互相联系，并不是完全互相独立的参数。如果已知其中两者，可以算出第三者。 在DCE检查中，我们可以控制血浆中随时间变化的钆造影剂浓度（Cp），使用动脉输入函数（AIF）表示，或者使用双指数衰减估计的AIF表示，双指数衰减的的初始值从肾脏清除率和整个身体的细胞外空间分布得到。另外，通过测量组织的信号强度，我们可以确定组织中钆造影剂浓度，Ct。Ktrans和ve是未知的，但是这些事潜在的重要生理学参数，可以通过将测量数据拟合到Tofts模型上进行估计。 最初的Tofts-Kermode模型假设组织中钆的总浓度可以忽略血管内钆的贡献。换句话说，血浆体积分数Vp非常小，在分析中可忽略。因此简单的TK模型只有两个自有参数，这个微分方程可以通过积分解决， 对逐个像素使用非线性最小二乘估计，可以加计算出Ktrans和ve。 上述公式假定组织中钆的总浓度可以忽略血管内钆的贡献，Ct仅仅由EES中的钆得到。尽管这对某些病变是成立的，如多发性硬化斑块和低级别肿瘤，但对许多恶性肿瘤和其他严重血管病变并不成立。 对原始Tofts模型的修改通常就是将血管的贡献考虑在内，引入一个新的参数Vp，含血浆组织的体积分数。与Ve一样，Vp是无量纲的，因为它表示组织每单位体积中的血浆容量。扩展后的Tofts模型现在有两部分，含3个参数，用下面这个引入了新术语（VpCp）的方程表示。 应当指出的是模型中增加更多的自由参数并不一定能够改进此模型，它需要更多的数据点来估计多出来的变量。非线性最小二乘拟合算法已经有些不稳定和病态，可能受到更多噪声的干扰从而收敛到不切实际的值。 其他用于DCE成像的组织模型 在Tofts和Kermode（英国）研究药代动力学模型的同时，Brix和他的同事（德国）也研究出了一个药代动力学模型。最初的Brix公式（现在已扩展）是一个中央（血管/血浆）和外周（组织细胞外空间）的开放-交换模型。钆在两者之间正向和反向的交换速率分别表示K12和K21，与Tofts模型中的Ktrans和Kep大致对应。然而，Brix模型明确将血流从渗透效应中分离出来（在Ktrans概念中二者是混在一起的）。最初的Brix模型根据信号改变的比例计算钆浓度，这是一个相对不太准确的方法，但是也有优点，这种方法不需要扫打造影剂之前的T1 Mapping序列，也不需要测量动脉输入函数。 分布参数模型，也被成为组织同质化模型，摒弃了Tofts模型和Brix模型中使用的钆造影剂在组织中\"充分混合\"的概念，而是假设沿每根毛细血管存在钆浓度梯度，这需要将传输时间纳入模型，但此模型有直接从分析中提取血流信息的潜力。 参考材料 Brix G, Semmler W, Port R, et al. Pharmacokinetic parameters in CNS Gd-DTPA enhanced MR imaging . J Comput Assist Tomogr 1991; 15:621-628. Tofts PS. Modeling tracer kinetics in dynamic Gd-DTPA MR imaging . J Magn Reson Imaging 1997; 7:91-101. Tofts PS, Brix, G, Buckley DL, et al. Estimating kinetic parameters from dynamic contrast-enhanced T1-weighted MRI of a diffusable tracer: standardized quantities and symbols . J Magn Reson Imaging 1999; 10:223-232. Tofts PS, Kermode AG. Measurement of the blood-brain barrier permeability and leakage space using dynamic MR imaging. 1. Fundamental concepts . Magn Reson Med 1991; 17:357-367 Zaharchuk G. Theoretical basis of hemodynamic MR imaging techniques to measure cerebral blood volume, cerebral blood flow, and permeability . AJNR Am J Neuroradiol 2007; 28:1850-8. 相关问题 Is Ktrans the same as permeability？ How do calculated DCE parameters relate to patterns of enhancement we see on clinical images?","tags":"DCE","title":"Question-DCE参数：从DCE数据中能够提取哪些量化参数？"},{"url":"http://chunshan.github.io/MRI-QA/dce/dce-signal-v-gd.html","text":"原文链接: How is the concentration of gadolinium in blood and tissue determined from the DCE signal? 概要 完全量化的DCE研究第一步是根据MR信号强度计算组织中钆造影剂浓度[Gd]。该过程类似于DSC成像，T1弛豫率的改变ΔR1 (=1/ΔT1)，与[Gd]成正比。这个假设只在造影剂的稀释水溶液中是成立的，并不能严格适用于生物大分子之间的相互作用影响了弛豫或条块分割影响了水分子快速交换的组织。 通常的DCE脉冲序列时扰相梯度回波（FLASH/SPGR/T1-FFE），信号强度(S)由下式给出： 这里的k是一个比例常数，[H]是自旋密度，α是RF翻转角。信号强度与T1之间的关系不像在DSC中描述的那么直接，是一个简单对数比例关系，但关系仍然是确定的。计算的精度依赖于背景组织没有造影剂时的T1，这个T1值可以通过一个打造影剂前单独的校正序列得到，或者使用基于大样本的平均值。如果没有校正，从MR信号中只能得到相对的钆浓度。 最后，钆基造影剂分布在血浆中，而不是全部血液中，必须考虑有效的血浆浓度。全血中血浆的比例取决于红细胞容积比（Hct = 红细胞的百分比），有如下关系 [Gd]blood = [Gd]plasma × (1−Hct)。对典型的正常红细胞容积比Hct = 40%，血浆中的造影剂浓度大约是基于全血测量的1.7倍。 注意，即使同一个病人，其红细胞容积比在不同时间也可能不同，尤其是正接受化疗的癌症患者。如果不做调整，变化的Hct 会显著影响不同时间进行的DCE量化测量。另一个在DCE计算中通常未被考虑的因素是毛细血管（钆造影剂交换发生）中的Hct 只是大一些动脉中的1/2或更少（Fåhraeus 效应）。 高级讨论 在心脏成像以及一些其他应用中，DCE成像可能使用饱和恢复（SR，Saturation Recovery）序列而不是扰相GRE序列。这种情况下，信号强度公式如下： S = k [H] (1 − e−TD/T1) e−TE/T2* 其中TD是90°脉冲和采集之间的延迟时间。 参考材料 Fåhraeus R, Lindqvist T. The viscosity of the blood in narrow capillary tubes . Am J Physiol 1931; 96:562-568. (Classic paper demonstrating what is now known as the \"Fåhraeus effect\" - that hematocrit decreases strongly with reduced vascular size below about 0.3 mm diameter. This is because blood viscosity decreases and RBCs move more quickly than plasma down the center of capillaries.) Parker GJM, Barker GJ, Tofts PS. Accurate multislice gradient echo T1 measurement in the presence of non-ideal RF pulse shape and RF filed nonuniformity . Magn Reson Med 2001; 45:838-845. Pries AR, Ley K, Gaehtgens P. Generalization of the Fåhraeus principle for microvessel networks . Am J Physiol 1986; 251:H1324-H1332. Schabel MC, Parker DL. Uncertainty and bias in contrast concentration measurements using spoiled gradient echo pulse sequences . Phys Med Biol 2008; 53:2345-2373. Tofts PS. T1-weighted DCE imaging concepts: modelling, acquisition and analysis . MAGNETOM Flash 2010; 3:30-35. Zaharchuk G. Theoretical basis of hemodynamic MR imaging techniques to measure cerebral blood volume, cerebral blood flow, and permeability . AJNR Am J Neuroradiol 2007; 28:1850-8. 相关问题 Question-DSC信号与钆：DSC中，能够从采集信号中得到量化的钆浓度实际值么？ Why would you want to use a spoiled-GRE technique? How do you pick the parameters?","tags":"DCE","title":"Question-DCE信号与钆浓度：如何根据DCE信号强度计算血液和组织中的钆浓度？"},{"url":"http://chunshan.github.io/MRI-QA/dce/breast-dce.html","text":"原文链接: Does breast DCE require any special techniques? 概要 乳腺癌 乳腺DCE成像面临几个严重的挑战是身体其他部位DCE成像不能比的：1）要求在大体积的组织中检测非常小的病变；2）在T1本就比较亮的背景脂肪组织上测量对比度增强；3）来自呼吸和心脏运动的噪声。 主要磁共振厂家都开发了针对乳腺优化的3D T1加权的梯度回波序列，这些序列都包含不同类型的压脂功能。典型的成像参数是TR = 4-6ms，TE = 1-3ms，flip angle = 10°-15°，须使用专用的多通道乳腺线圈进行并行成像。 所有的DCE检查都需要权衡时间分辨率和时间分辨率。由于潜在的肿瘤尺寸非常小，乳腺DCE检查的最小空间分辨率要求平面内分辨率 ≤1mm²，层厚≤3mm，层之间无空隙。目前乳腺肿瘤的DCE分析主要是基于观察和半定量分析，因此两个时相之间的时间分辨率1½−2分钟是可接受的。 乳腺肿块中的II型DCE增强（图像来自Philips） 肿瘤的磁共振增强类型 病变区域的对比剂吸收模式和对比剂流入/流出率都能为病变的性质提供线索。Kuhl 等基于对比剂的时间强度曲线的形状提出了一个流行的病变良恶性分类方案（上面已有图示）。有渐进对比剂摄取曲线（类型I）的乳腺肿块更可能是良性的，对比剂曲线呈快速流入快速流出的（类型III）的乳腺肿块更可能是恶性的，增强曲线表现为高原强化（类型II）的病变一般是中性的。这种分类机制也应用于其他器官的肿瘤，包括肝脏和前列腺。 参考材料 American College of Radiology. Breast Magnetic Resonance Imaging (MRI) accreditation program requirements , Revised 7/3/15, available at www.acr.org. Kuhl C, Schild HH, Morakkabati N. Dynamic bilateral contrast-enhanced imaging of the breast: trade-off between spatial and temporal resolution . Radiology 2005; 236:789-800 Miyazaki M, Wheaton A, Kitane S. Enhanced fat suppression technique for breast imaging . J Magn Reson Imaging 2013; 38:981-986. 相关问题 Our scanner offers an option called \"Water Excitation\". Is this just another name for Fat-Sat? What is the best technique for \"first- pass\" perfusion imaging?","tags":"DCE","title":"Question-乳腺DCE：乳腺DCE需要一些特殊的技术么？"},{"url":"http://chunshan.github.io/MRI-QA/dce/how-is-dce-analyzed.html","text":"原文链接: How do you evaluate the information obtained from a DCE imaging study? 概要 DCE成像数据可以使用三种方法评估：简单的视觉评估，半定量的描述性指标分析或基于模型的定量分析。 随时间变化不同生理现象对总对比增强的贡献 对不同时间点的对比增强图像的简单视觉评估是临床放射医生最常用的方法，首先寻找动态序列中造影剂首先出现的区域，病变区域对造影剂摄取的模式和流入/流出率，可以对病变性质提供线索。 动态对比增强曲线的不同部分反映了不同的解剖和生理特征。该曲线初始陡峭的上坡与组织血流量相关，曲线的峰值高度反映的总血流量和血容量。曲线的下一部分由于造影剂渗透到组织间隙，反映的是毛细血管面积和渗透功能。曲线的最后部分反映组织总的细胞外空间和血浆间质容积。 与DSC类似，也可以从原始DCE图像的强度数据中计算半定量描述性指标，包括到达时间（AT， Arrival Time），达峰时间（TTP， Time to Peak），流入率（WIR， Wash-in Rate），流出率（WOR，Wash-out Rate）曲线下面积（AUC，Area Under Curve），与基线相比的最大增强（ME， Maximum Enhancement）和最大增强百分比（%ME）。尽管这些指标的绝对值没有意义，但是与其他病变的信号强度改变比较，或与正常的背景组织比较还是有用的。 DCE数据的全定量分析需要三步：1，将信号强度转换为钆造影剂浓度；2，选择一个合适的组织模型；3，从拟合的数据中估计模型参数。能够获取的重要的量化量化组织参数包括血管渗透性，造影剂交换比率，血流量和组织的细胞外空间体积。如何计算这些参数的细节和他们的生理意义是后续几个Q&A的主题。 参考材料 Choi YJ, Kim JK, Kim N, et al. Functional MR imaging of prostate cancer . RadioGraphics 2007; 27:65-77. (use of semi-quantitive DCE parameters to detect prostate cancer.) Kuhl CK, Mielcareck P, Klaschik S, et al. Dynamic breast MR imaging: Are signal intensity time course data useful for differential diagnosis of enhancing lesions ? Radiology 1999; 211:101-110. (original paper describing Type I, II, and III kinetic patterns of contrast uptake in breast tumors). Schnall MD, Blume J, Bluemke DA, et al. Diagnostic architectural and dynamic features at breast MR imaging: multicenter study . Radiology 2006; 238:42-53. (showed Kuhl classification not so accurate as thought). Verma S, Turkbey B, Muradyan N, et al. Overview of dynamic contrast-enhanced MRI in prostate cancer diagnosis and management . AJR Am J Roentgenol 2012; 198:1277-1288. 相关问题 Question-DCE脉冲序列：使用什么脉冲序列进行DCE检查？ Can myocardial perfusion be accurately quantified? How do calculated DCE parameters relate to patterns of enhancement we see on clinical images?","tags":"DCE","title":"Question-DCE成像：如何评估从DCE检查中获得的信息？"},{"url":"http://chunshan.github.io/MRI-QA/dce/how-is-dce-performed.html","text":"原文链接: What pulse sequences are used to perform a DCE study? 概要 任何器官都可以做DCE成像，但是通常会用于脑，心脏，乳腺，肝脏，前列腺和肾脏。DCE一般使用表现为T1加权的3D扰相梯度回波技术，但不同应用使用的序列结构和脉冲时序参数也有稍微的不同。心脏灌注序列有一些独特的特性，在前面的Q&A中已经有描述。 用于脑，乳腺或前列腺DCE的典型脉冲序列可能规定使用如下参数：3D SPGR或FLASH序列，TR = 4-6毫秒，TE = 1-3毫秒，flip angle = 10°-15°，并行加速系数 = 2。 扫描的视场（FOV， Field of View），层厚，层数，成像矩阵大小取决于不同的应用。乳腺和前列腺的DCE检查通常是为了发现小病灶，这些检查一般要求层厚≤ 3 毫米，平面内像素尺寸≤ 1平方毫米。大脑DCE成像可能对空间分辨率要求不这么苛刻，层厚可以大至5毫米，像素尺寸也可以大50%。 不同的器官系统，不同的图像分析类型，要求的时间分辨率（不同时相的间隔时间）和总成像时间有明显不同。空间分辨率和时间分辨率之间的权衡总是存在的。 乳腺MRI一般只会进行半定量的DCE分析，通常每1½−2分钟采集一次，共持续5-7分钟。前列腺肿瘤通常比乳腺肿瘤对对比剂吸收和冲洗（流出）更快，前列腺DCE的时间分辨率要求更高，图像在注射造影剂后必须至少每10s采集一次，持续约5分钟。 脑DCE成像往往是为了获得基于药代动力学模型的组织灌注参数，这样一个完整的定量分析通常需要打造影剂前扫描额外的T1映射协议。T1映射协议可以是一个Look-Locker类型序列（见相关的Q&A）或者是一系列使用不同翻转角度和回波时间采集的容积数据。T1映射协议完成后，与上面类似的3D扰相梯度回波序列就开始运行，时间分辨率约为5s，数据采集至少5分钟。 参考材料 Buckley DL, Roberts C, Parker GJM, et al. Prostate cancer: evaluation of vascular characteristics with dynamic contrast-enhanced T1-weighted MR imaging — initial experience . Radiology 2004; 233:709-715. Choi YJ, Kim JK, Kim N, et al. Functional imaging of prostate cancer . RadioGraphics 2007; 27:63-77. Jahng G-H, Li K-L, Ostergaard l, Calamante F. Perfusion magnetic resonance imaging: a comprehensive update on principles and techniques . Korean J Radiol 2014; 15:554-577. (good recent review). Larsson HB, Hansen AE, Berg HK, et al. Dynamic contrast-enhanced quantitative perfusion measurement of the brain using T1-weighted MRI at 3T . J Magn Resona Imaging 2008; 27:754-762 Sourbron S, Ingrisch M, Siefert A, et al. Quantification of cerebral blood flow, cerebral blood volume, and blood-brain-barrier leakage with DCE-MRI . Magn Reson Med 2009; 62:205-217. Tofts PS. T1-weighted DCE imaging concepts: modelling, acquisition and analysis . MAGNETOM Flash 2010; 3:30-35. Verma S, Turkbey B, Muradyan N, et al. Overview of dynamic contrast-enhanced MRI in prostate cancer diagnosis and management . AJR Am J Roentgenol 2012; 198:1277-1288. (Prostate DCE requires high temporal resolution, with images acquired every 5-10 sec for several minutes). 相关问题 Question-乳腺DCE：乳腺DCE需要一些特殊的技术么？ How is cardiac T1 mapping performed? When is it useful?","tags":"DCE","title":"Question-DCE脉冲序列：使用什么脉冲序列进行DCE检查？"},{"url":"http://chunshan.github.io/MRI-QA/dce/what-is-dce.html","text":"原文链接: What is DCE imaging and how does it differ from DSC imaging? 概要 动态对比增强（DCE，Dynamic Contrast Enhancement）成像测量注射钆造影剂后组织T1随时间的变化。它与动态磁敏性对比（DSC，Dynamic Susceptibility Contrast）不同，后者测量T2或T2*的变化。 胶质瘤中血脑屏障被破坏 钆造影剂注射后，它会驻留在血浆中，并随血液流动到各个器官。这些相对小的药物分子（500-1000Da）会以被动扩散的方式穿过血管内皮细胞进入大多数组织的细胞外空间。唯一的例外是脑和脊髓，内皮细胞紧密连接构成了血脑屏障（BBB， Blood Brain Barrier）阻碍了扩散过程。如果血脑屏障被肿瘤，感染或者其他疾病破坏，钆造影剂就会累积，T1缩短使得T1对比度增强。 观察和量化对比度增强随时间的变化是DCE成像的主要目标。一般来讲，对比度增强的程度取决于局部血流量（F），血管的大小和数量（由组织单位质量的表面积S和渗透性P进行量化）。 虽然不可能将F，S，P每个部分单独分离出来，但是通过数学建模，我们可以测量它们的综合效应，反映在所谓的转移常数（K trans ）中。K trans 表征钆对比剂穿过血管内皮细胞的扩散净流入。DCE计算出来的指标如K trans 在肿瘤治疗评价中越来越重要，特别是针对肿瘤血管的非细胞毒性靶向药物。K trans 也被用来评估肺，关节和其他器官的炎症过程。 除了K trans ，DCE也可以计算组织的其他参数，如：组织的血管外细胞外体积分数（v e ），组织的血浆体积分数（v p ）和钆造影剂从组织细胞外空间返流回血浆的流出常数（k ep ）。 这些不同DCE参数的意义和计算将在接下来的几个Q&A中阐述。 参考材料 相关问题 Question-MR灌注概述：MRI中的DSC，DCE和ASL灌注方法有何不同？ Question-DCE成像：如何评估从DCE检查中获得的信息？ What quantitative parameters can be extracted from the DCE data?","tags":"DCE","title":"Question-DCE概述：DCE成像是什么？与DSC成像有何不同？"},{"url":"http://chunshan.github.io/MRI-QA/dsc/quantitative-dsc.html","text":"原文链接: How is the arterial input function used to extract more quantitative flow information from the DSC data? 概要 原始的DSC成像数据转化为定量的血流量测量值有三个步骤： 1. 将组织的MR信号s(t)转换为钆造影剂浓度c(t)； 2. 选择合适的动脉输入函数a(t)； 3. 数学建模和计算。 前两个步骤已经在前面的Q&A中有描述。本部分将介绍在知道c(t)和a(t)情况下如何计算血流信息的数学方法，这些分析基于线性系统理论，并且需要几个重要的假设。 1. 血流量（F）和血容量（V）在测量期间是常量； 2. 注射的所有示踪剂分子最终都会从系统中流出，换句话说，没有持久的陷阱或血池，组织内也没有示踪剂损失。 3. 系统对输入的响应是线性的并且遵循叠加原理。也就是说，两个独立输入的总输出响应与分别考虑这两个输入的响应再求和是一样的。 注：读者很快就会意识到这个简单的模型在实际中可能会失效。例如，血脑屏障泄露时脑肿瘤会聚集钆对比剂，这不满足假设2. 血容量（V）是第一个也是最容易提取的参数。假设没有泄露和再循环的影响，血容量与造影剂首次通过时组织浓度曲线c(t)下方的面积成正比。理论上，这种关系可以通过除以仅含血液的体素的钆造影剂浓度进行定量。通常选择一条供血动脉内的体素作为参考体素，也就是可以选择动脉输入函数的曲线a(t)。CT灌注研究中通常也会用大静脉中的一个体素作为参考体素。数学关系如下： 血流量是（F）下一个可被计算的参数，但是这个计算过程有点\"绕\"。理解这个方法需要首先简要介绍一下线性系统理论。 对线性系统（如组织的毛细血管床）进行分析，可以考虑它对一个假设的无限高强度，无限短时间的脉冲（狄拉克函数， Dirac delta function δ(t)）的响应。对我们的系统而言，δ(t)可视为在t=0 时刻将造影剂分子通过一个动脉口瞬间团注入组织。注射后，一些分子会找到通往静脉口比较直接的路径，其他的分子则会选择更加迂回的路径，花更长的时间才能通过毛细血管床。这导致注射的对比剂团在组织中变得分散，对比剂分子的通过时间也不一致。 这样一个脉冲注入之后，注射的对比剂分子留在组织中的部分是t的无量纲函数，称为残留函数，记为R(t)。刚注射后（没有任何分子离开系统前）R(t)处于最大值R(0) = 1。随着对比剂分子流出系统，R(t)变小，最终达到终值R（∞）= 0，也就是对比剂不残留在组织中。 残留函数宽度反映的是对比剂分子通过组织时间的分布，通过时间短的组织的残留函数曲线比较窄且陡峭，相反，通过时间长的组织残留函数曲线比较宽。残留函数下的面积反映对比剂分子通过组织毛细血管床花的平均时间，这就是平均通过时间MTT（Mean Transit Time），是一个重要的生理参数。数学表达式为: 上图：实际的动脉输入函数AIF和相应的组织浓度曲线c(t)；下图：由一组狄拉克函数建模的组织响应 在实际中，不可能将动脉注射的对比剂瞬间递送到组织，动脉输入函数a(t)，时间上总是分散的，如图所示。但是这种普遍的动脉输入可以表示为一组延迟不同时间(τ)的狄拉克函数，每一个产生一个独立的响应。对这些独立的脉冲响应缩放并求和以求得组织对比剂浓度曲线c(t)的数学操作成为卷积。数学上表示为： 其中F表示血流量，符号是卷积操作子。卷积过程就是对每个加权（乘以注射后不同延迟时间(τ)的残留函数）的动脉输入求和（积分）。事实上钆造影剂仅分布于血管的细胞外空间，这个方程的一些形式会在F前包含一个常数因子(ρ/h)，其中ρ是组织密度，单位是g/mL，h表示毛细血管和大血管间红细胞容积比的差。 在DSC灌注实验中，a(t) 和 c(t) 可以直接测量得到，但是不知道血流量F和残余函数 R(t)。因为这个方程中未知数比已知数多，唯一解不存在。但是，有不同的数学方法可以合理估计这些参数，尤其是血流量(F)。 有三种通用的策略可进行数学上的反卷积运算。最常用的方法是将这个方程转换为矩阵形式，用奇异值分解（SVD，Singular Value Decomposition）做迭代运算。第二种不太常用的方法被称为\"参数化\"，因为这种方法假设残余函数有事先确定的形状，如衰减的指数形式。其他反卷积技术需要用到傅里叶变换或随机估计。 所有反卷积方法的最终结果就是对血流量(F)的量化估计。由于血容量(V)已经计算出来，最后的步骤是使用中心容积定律（Central Volume Theorem）逐个体素计算平均通过时间MTT， MTT = V/F。 应该指出的是，选取的AIF不同，或者使用的商业软件计算方法不同，所得结果会有明显的差异。即使软件声称使用相同的方法，相同的原始数据可能也会给出不同的结果。建议谨慎地依赖这些定量方法所获得的绝对数。 卷积（反卷积）概念对那些没有很强数学背景的人而言会比较困惑，但是我的同事Josh Shimony在这个 YouTube视频 中（离开头约33分钟）浅显易懂地介绍了这个概念。整个视频是对DSC和ASL很好的介绍，如果你有时间，我建议你全部看完它。 高级讨论 傅里叶方法用于反卷积，首先对求取血流量的卷积方程两边都进行傅里叶变换(FT, Fourier Transform)，这种方法根据的是著名的卷积定理，两个函数乘积的傅里叶变换是每个函数傅里叶变换的卷积。数学上表示为 F • R(t) = FT−1{FT[c(t)] / FT[a(t)]} 注意残余函数的初始值为1（R(0) = 1），这个函数第一个时间点的幅度就等于血流量(F)。尽管概念上很直接，由于不稳定和噪声问题，这个方法并不常用。 最常用的奇异值分解（SVD， Singular Value Decomposition）方法也有许多变种。SVD是矩阵代数中一种常用的求解逆问题的分解方法。由于噪声和舍入误差SVD可能是病态的（不稳定），必须施加一些限制（正则化）。最直接的正则化方法（截断）是将所有低于一定水平的矩阵奇异值设为0。另一种正则化方法（Tikhonov 正则化）通过操纵对角线元素，从而对奇异值有更平滑的截断。 标准奇异值分解的第二个问题是结果对组织不同部分之间的对比剂到达延迟非常敏感。诸如reformulated SVD和block-recirculant SVD很大程度上可以克服这些限制，逐渐被软件制造商在他们的软件中实现。 一些较新的统计学方法更侧重提高残余函数的估计，减少其震荡。哪一种方法更具优势，现在还不好预测。 我为什么不喜欢T max 在中风文献中，大量临床试验使用一种称为T max 的灌注度量参数，T max 被定义为残留函数R(t)到达最大值的时间，残留函数R(t)从反卷积中计算得到。理论上，Tmax是动脉输入函数（AIF）峰值与残留函数峰值之间的时间。 T max 与MTT不同。MTT反映的是造影剂达到感兴趣组织后通过毛细血管床的时间。相反，T max 反映造影剂从测量AIF到到达毛细血管系统途中的延时和分散。 T max 高度依赖AIF的选择位置。AIF位置离感兴趣组织越远，计算得到的T max 值会越大。另外，矩阵奇异值分解（SVD）的正则化（滤波）可以通过产生震荡和峰值位移改变R(t)，从而减少反卷积中噪声的影响，这个过程也会影响T max 。 尽管T max 有些方法上的问题，许多中风神经学家似乎喜欢T max 并且推荐在临床实践中使用这个参数。我相信它如此受欢迎的原因之一是T max 参数图在脑的正常区域图像对比度相对比较\"平\"，而在低灌注或临界区域图像对比度有显著不同。 总之，T max 确实提供了一些对MTT和CBF互补的信息，但是这是一个\"混乱\"的参数，反映的是选择的AIF位置到感兴趣组织间造影剂的延迟和分散。因此它是非常依赖于AIF的选择，在比较不同患者的脑卒中研究中应谨慎使用。 参考材料 Boxerman JL, Rosen BR, Weisskoff RM. Signal-to-noise analysis of cerebral blood volume maps from dynamic NMR imaging studies . J Magn Reson Imaging 1997; 7:528-37. Calamante F, Christensen S, Desmond PM, et al. The physiological significance of the time-to-maximum (Tmax) parameter in perfusion MRI . Stroke 2010; 41:1169-1174. (See Advanced Discussion tab for why I don't favor this parameter in practice.) Fieselmann A, Kowarschik M, Ganguly A, et al. Deconvolution-based CT and MR brain perfusion measurement: theoretical model revisited and practical implementation details . Int J Biomed Imag 2011; doi:10/1155/2011/467563 Orsingher L, Piccinini S, Crisi G. Differences in dynamic susceptibility contrast MR perfusion maps generated by different methods implemented in commercial software . J Comput Assist Tomogr 2014; 38:647-654. (different software gives different results, even when methods are said to be the same!) Østergaard L, Weisskoff RM, Chesler DA, et al. High resolution measurement of cerebral blood flow using intravascular tracer bolus passages. Part I. Mathematical approach and statistical analysis . Magn Reson Med 1996; 36:715-725. (good description of deconvolution techniques including Fourier and SVD). Zaharchuk G. Theoretical basis of hemodynamic MR imaging techniques to measure cerebral blood volume, cerebral blood flow, and permeability . AJNR Am J Neuroradiol 2007; 28:1850-8. 相关问题 Question-动脉输入函数（AIF）：动脉输入函数是什么，为什么需要测量动脉输入函数？ Question-灌注参数：血流量（BF，Blood Flow），血容量（BV，Blood Volume），平均通过时间（MTT， Mean Transit Time）等参数是怎么定义的？在灌注成像中如何使用?","tags":"DSC","title":"Question-DSC高级处理：如何使用动脉输入函数从DSC数据中提取更多量化的血流信息？"},{"url":"http://chunshan.github.io/MRI-QA/dsc/arterial-input-aif.html","text":"原文链接: What is the arterial input function (AIF) and why do you need to measure it? 概要 理想的DSC实验中，我们希望钆能够以短而紧凑的静脉推注递送到组织，然而实际上，血液要经过心脏和肺，最初的静脉推注变得延迟并且分散，DSC实验中测得的组织浓度曲线形状依赖于到达的动脉输入函数（AIF, Arterial Input Function， a(t)）的形状。如果没有AIF，组织灌注动力学中内在有价值的信息就可能会丢失。 组织对比剂浓度曲线c tissue (t) 的形状高度依赖于动脉输入函数的形状 获取AIF的最简单方法是使感兴趣区域能够覆盖一条容易识别的动脉，在腹部影像学检查中，可能是主动脉或肾动脉，在头部，往往主要是脑动脉（ACA, MCA）或其近侧分支。如果以这种方式得到的AIF应用于一个片层内的所有体素，称之为全局AIF(Global AIF)。但是测得的AIF位置与感兴趣体素的位置距离可能比较远，对比剂团注的延迟和分散在计算血流量时会产生明显的错误。潜在更好的方法是从与每一个成像的组织体素很近的小动脉中识别局部AIF（Local AIF），这也是过去十年众多研究的主题。 现在的灌注软件包提供了自动或半自动的方法来识别最优的局部AIF，下图所示的例子中，从大脑一个小区域可能的AIF数组中可以选出最佳的候选者。被选为AIF的体素理想上有比较平坦的基线，陡峭的峰，和紧凑的形状。下图的例子中，第二（或第三）列的体素可能是最佳选择。 逐个体素查询来确定大脑中动脉附近1cm 2 区域的最优AIF。最优AIF一般有平坦的基线和陡峭的峰 一旦选择了合适的AIF，软件就可以产生每个像素的重要灌注参数，形成参数图，包括血容量，血流量和平均通过时间。这是如何完成的是下一个Q&A的主题。 参考材料 Bleeker EJW, van Buchem MA, van Osch MJP. Optimal location for arterial input function measurements near the middle cerebral artery in first-pass perfusion MRI . J Cereb Blood Flow Metab 2009; 29:840-852. (Best location for the AIF may be just outside the MCA, not within it). Calamante F, Mørup M, Hansen LK. Defining a local arterial input function for perfusion MRI using independent component analysis . Magn Reson Med 2004; 52:789-797. Carroll TJ, Rowley HA, Haughton VM. Automatic calculation of the arterial input function for cerebral perfusion imaging with MR imaging . Radiology 2003; 227:593-600. Mlynash M, Eyngorn I, Bammer R, et al. Automated method for generating the arterial input function on perfusion-weighted MR imaging: validation in patients with stroke . AJNR Am J Neuroradiol 2005; 26:1479-1486. (Computers generally due a more consistent/reliable job of finding the best AIF than people!) 相关问题 Question-DSC高级处理：如何使用动脉输入函数从DSC数据中提取更多量化的血流信息？","tags":"DSC","title":"Question-动脉输入函数（AIF）：动脉输入函数是什么，为什么需要测量动脉输入函数？"},{"url":"http://chunshan.github.io/MRI-QA/dsc/dsc-signal-v-gd.html","text":"原文链接: Is it possible to quantify the actual concentration of Gd from its signal in a DSC study? 概要 在前面的Q&A中，我们已经阐述了随着钆造影剂团的通过，T2*加权的DSC图像中MR信号强度如何降低。从这些原始数据中，一些有用的半定量参数可以提取出来，例如达峰时间（反映血流量）。为了从该数据提取更精确的和有意义的生理信息，第一步是将信号强度信息转换为实际钆浓度。 通常使用的从信号强度到钆浓度的转换假设钆浓度[Gd]正比于观察到的T2*弛豫率（ΔR2* = 1/ΔT2*）的改变，也就是正比于相对信号强度的负对数。 这里的So是给定体素的基线信号强度，St 是钆对比剂团通过时时刻t的信号强度。这个方程的推导在高级讨论中给出。 信号强度与钆浓度之间的转换本质上是一个对数变换，从一个商业灌注软件中得到如下的图示。 DSC信号强度随时间变化的曲线（原始数据） 变换后的浓度曲线，用伽马变量函数拟合 高级讨论 下面是上文提到的钆浓度[Gd]和信号强度转换方程的简要推导。 根据造影剂生理浓度的简化理论，观察到的弛豫率改变(ΔR2=1/ΔT2 and ΔR2*=1/ΔT2*) 与钆浓度[Gd]线性相关，因此测量对比剂团通过时一个体素的弛豫率改变，此位置任意时刻的钆浓度可以近似计算出来。 回想一下，DSC实验中的信号（S）由一个简单的梯度回波序列产生，强度随时间指数衰减，表示如下： S = k e−TE/T2* = k e−TE•R2* 其中k是常量，由组织相关属性（如T1, ρ, χ）和技术参数（如Bo, TR, NEX, α）共同决定。通过对方程两边取对数并重排，R2*可以计算出来。 ln(S/k) = − TE • R2* R2* = − (1/TE) • ln(S/k) 在钆造影剂团到达前，我们假设组织体素的初始弛豫率为R2*o，信号强度为So。在造影剂通过的时刻t时，我们假设弛豫率升高至 R2*t，信号强度下降为St，也就是 R2*o = − (1/TE) • ln(So /k) R2*t = − (1/TE) • ln(St /k) R2*的改变正比于钆浓度，可以写为： ΔR2* = R2*t − R2*o = − (1/TE) • [ ln(St /k) – ln(So /k) ] 使用对数的定义 ln(A) − ln(B) = ln(A/B) ，重写最后一个方程为： ΔR2* = − (1/TE) • ln(St /So) 弛豫率的改变与钆浓度成正比这一主要假设可能会被质疑，具体上讲，这样的线性关系仅对稀释匀质水溶液，并且使用自旋回波脉冲序列时成立。 参考材料 Kiselev VG. On the theoretical basis of perfusion measurements by dynamic susceptibility contrast MRI . Magn Reson Med 2001; 46:1113-1122. Østergaard L, Johannsen P, Host-Poulsen P, et al. Cerebral blood flow measurements by magnetic resonance imaging bolus tracking: comparison with [15O]H2O positron emission tomography in humans . J Cerbral Blood Flow Metab 1998; 18:935-940. (Early paper showing good agreement between DSC and PET measurements of cerebral blood flow. However, the MR data had to be \"calibrated\" to absolute flow rates measured by PET, meaning that absolute quantification of CBF by DSC alone was not possible). Simonsen CZ, Østergaard L, Smith DF, et al. Comparison of gradient- and spin-echo imaging: CBF, CBV, and MTT measurements . J Magn Reson Imaging 2000; 12:411-416. (spin-echo techniques may be more accurate than GRE for quantification of microvascular flow) 相关问题 What is meant by the relaxivity of a contrast agent? How is it measured? Question-注钆效应：在常规MR增强图像中钆对比剂用于增强信号，为什么在DSC灌注图像中信号减弱?","tags":"DSC","title":"Question-DSC信号与钆：DSC中，能够从采集信号中得到量化的钆浓度实际值么？"},{"url":"http://chunshan.github.io/MRI-QA/dsc/dsc-curve-analysis.html","text":"原文链接: What parameters can be extracted from the DSC intensity curve? 概要 一些半定量灌注参数可以通过分析对比剂通过时各个体素的DSC信号强度曲线得到，这些参数很容易计算，因此被广泛使用。但是它们缺乏准确度和一致性，高度依赖于对比剂的有效性/紧凑性。这些参数的绝对值本身没有多大意义，但相对意义是有用的（如对大脑两侧比较对应区域）。这些被称为\"摘要\"参数的最常见几个在下面给出图示和定义。 简化的DSC信号强度曲线半定量分析 到达时间（AT，Arrival Time）是从静脉注射造影剂到第一次在组织（或一个大的供血动脉）中被检测到的时间间隔。MR信号由于噪声和运动而随机变化，必须取对比剂到达前的十几个甚至更多时间点的平均作为基线，然后可以任意设置一个检测阈值（例如，低于基线5%）定义对比剂的到达。或者，该阈值可以通过观察信号强度曲线而手动设置。尽管AT可以计算，但它反映的是影响对比剂到达组织的所有因素（喷射率，心输出量，局部血流量等）的总和。大脑两侧对比剂到达时间明显不同可能预示单侧颈动脉狭窄。 达峰时间（TTP，Time to Peak）通常被定义为从开始注射对比剂到感兴趣器官信号损失到达峰值（最大）的时间间隔。TTP与AT有相同的用处和局限，但是峰值非常容易识别，不需要设置对比剂首次到达的检测阈值，TTP较AT有一定的优越性。一些软件应用中，TTP不包括到达时间，被定义为首次检测到对比剂和信号损失峰值之间的时间间隔。 负性增强积分（NEI，Negative Enhancement Integral）表示钆首次通过的信号强度下总面积（\"积分\"），有时候也被成为曲线下面积（AUC，Area Under Curve）。NEI表示穿过局部血管系统的对比剂总量，大致与血容量成正比。由于再循环效应，前面Q&A中解释过，基线在对比剂首过后不会恢复正常，为了处理基线漂移，必须要对积分的右方极限进行处理。通常会使用信号强度曲线的数学模型（如伽马变量函数）校正再循环和基线漂移效应，从而使NEI计算更有一致性。 平均增强时间（MTE，Mean Time to Enhance）表示注射的全部造影剂团穿过组织区域的平均时间。MTE的绝对值高度依赖于到达的对比剂团的形状（紧凑性），其次是灌注的组织。MTE虽然经常与MTT（Mean Transit Time）混淆，要认识到MTE与MTT（平均通过时间）并不相同，MTT反映的是单个对比剂分子（不是整个对比剂团）穿过组织的平均时间。在模拟实验中，MTE可能比真正的MTT长3倍。不同的制造商对MTE可能有略微不同的名字，计算方法也不太相同，或者采用NEI的一阶矩（质心），或者采用信号强度曲线的半高全宽（FWHM）。一些软件应用还提供了使用这些数据，计算相对血流量（rBF）的简单方法，NEI/MTE，作为对真实血流量（BF = BV/MTT）的模拟，但是这种方法有比较明显的局限性和错误。 基线峰值百分比（Percent Baseline at Peak）和信号恢复百分比（Percent Signal Recovery）分别被定义为信号强度的最小值（峰值）或再循环阶段（恢复）的强度值除以基线值得到的比值。这两个值虽然容易计算，但是受实验和生理现象同时影响，因此很少使用。 达峰时间（TTP，左）和负性增强积分（NEI，右），根据一个DSC实验中逐个像素的首过信号强度曲线计算得到。虽然它们的绝对值没有意义，但是很容易计算，相对意义上比较大脑相应区域的灌注情况是有用的。 为了得到更多量化的参数图如血流量和血容量，需要进行更复杂的数学处理。这是后续几个Q&A的主题。 参考材料 Jahng G-H, Li K-L, Ostergaard l, Calamante F. Perfusion magnetic resonance imaging: a comprehensive update on principles and techniques . Korean J Radiol 2014; 15:554-577. McGehee BE, Pollock JM, Maldjian JA. Brain perfusion imaging: how does it work and what should I use ? J Magn Reson Imaging 2012; 36:1257-1272. Perthen JE, Calamante F, Gadian DG, Connelly A. Is quantification of bolus tracking MRI reliable without deconvolution ? Magn Reson Med 2002; 47:62-67. (The answer is NO). Welker K, Boxerman J, Kalnin A, et al. ASFNR recommendations for clinical performance of MR dynamic susceptibility contrast perfusion imaging of the brain . AJNR Am J Neuroradiol 2015; 36: E41-E51. 相关问题 Question-DSC：如何做一个DSC灌注研究？","tags":"DSC","title":"Question-半定量参数：从DSC时间强度曲线中能够提取什么参数？"},{"url":"http://chunshan.github.io/MRI-QA/dsc/dsc-recirculation.html","text":"原文链接: Why doesn't the DSC curve return to its baseline after passage of the contrast bolus? 概要 DSC灌注研究中总观测信号的成分：团注首过（早）和再循环效应（晚） 当钆造影剂通过组织时，T2/T2*失相位，MR信号强度随之降低，占主导地位的负峰主要反映的是钆造影剂首次通过局部动脉循环时的情况。然而很快，第二波钆造影剂会穿过组织，影响了第一峰的大小和时间。这第二波表示含钆血的再循环，血液分流通过肾脏、冠脉循环后又返回心脏。除了影响主峰，再循环也防止DSC信号恢复到原来的基线。 研究者经常采用不同的数学方法校正或补偿DSC数据中的再循环效应。最常用的方法之一是使用伽马变量拟合，伽马变量函数与上图中团注首过红色动脉曲线类似，有比较陡峭并且较大幅度的下坡，然后逐渐回到基线。其他校正这些效应的方法有单室再循环和随机模型。 高级讨论 1,伽马变量函数可以有几种不同的形式，一个常用于造影剂首过法实验的形式为：S(t) = A(t-to)α e-(t-to)/β，其中A是一个比例因子，t0是造影剂团到达时间，α和β确定了分布的形状。为了避免伽马变量中隐含的再循环效应，通常只用对比度曲线的第一部分来估计这些参数。 2,是否校正和如何校正再循环效应是有争议的。矛盾的是，不去除再循环效应影响时血容量估计会更加准确。同时，伽马变量拟合本身是带有噪声的，因为只使用了信号曲线第一部分的采样，从而产生了它自己的问题； 3，如果采用了伽马变量方法，推荐生成另一个参数图（χ2参数图）用于检验拟合的好坏。 4，典型的DSC扫描序列采集数据的时间小于30秒。严重缺血情况下，首团造影剂这段时间中还不能到达靶器官。血容量和其他生理参数因此被低估。 参考材料 Boxerman JL, Rosen BR, Weisskoff RM. Signal-to-noise analysis of cerebral blood volume maps from dynamic NMR imaging studies . J Magn Reson Imaging 1997; 7:528-37. (Disadvantages of gamma variate fitting). Patil V, Johnson G. An improved model for describing the contrast bolus in perfusion MRI . Med Phys 2011; 38:6380-3. (An alternative to gamma variate fitting, the single compartment recirculation (SCR) model). Thompson HK Jr, Starmer CF, Whalen RE, McIntosh HD. Indicator transit time considered as a gamma variate . Circ Res 1964; 14:502-515. (Original classic paper describing gamma variate fitting in indicator dilution experiments) 相关问题 Question-注钆效应：在常规MR增强图像中钆对比剂用于增强信号，为什么在DSC灌注图像中信号减弱?","tags":"DSC","title":"Question-DSC再循环效应：为什么DSC曲线在对比剂通过后不能恢复到基线？"},{"url":"http://chunshan.github.io/MRI-QA/dsc/t1-effects-on-dsc.html","text":"原文链接: What about areas of contrast enhancement? Surely some T1 effects of gadolinium are present there... 概要 由于血脑屏障（BBB，Blood Brain Barrier）的阻隔，含钆造影剂正常情况下不能进入大脑和脊髓的血管外空间。血脑屏障的内皮细胞之间紧密连接，只让离子和小分子（如O2）穿过血管壁。如果血脑屏障由于疾病（如恶性肿瘤和感染）被破坏，造影剂漏入脑实质，使T1缩短，T1信号增强。 血脑屏障紧密连接的内皮细胞阻止血管内的钆造影剂进入大脑的细胞外空间（此图来自维基百科） 有渗漏的血脑屏障会使造影剂在组织中累积，这违反了简单示踪剂动力学模型的基本假设，也就是违反了DSC成像的基础，没有池或造影剂滞留。血脑屏障破坏时，血流量/血容量的估计会出现明显的错误。 钆造影剂累积造成T1缩短使DSC灌注成像出现两种效应： 1，迟钝的T2*信号损失。DSC方法依赖于钆造影剂团通过时T2*失相位导致的信号下降。血管外钆造影剂的T1效应使得信号升高，延迟了希望的T2*缩短，造成一些情况下反常的灌注后信号过冲。 2，稳态信号效应。DSC图像采集通常使用相对较短的TR（一般为1000-2000ms），由于钆累积导致T1缩短的区域在射频脉冲之间恢复更快，因此有更强的稳态信号。翻转角（α）大时，这种现象更加明显。 有几种措施补偿钆外渗造成的T1效应。一种常用方法是使用钆\"预负荷\"，在常规注射和DSC序列采集前约5-10分钟注射造影剂总剂量的 ¼ 到 ⅓。钆预负荷会升高对比度增强区域的基准信号，在DSC团注期间获得更好的T2*改变。 第二种减少钆外渗造成的T1效应的方法是减小DSC采集序列的射频脉冲翻转角，然而翻转角减小也会导致信噪比下降。其他补偿组织中钆累积效应的方法是基于软件的泄露校正算法。 参考材料 \"Blood-brain Barrier\" , Wikipedia, The Free Encyclopedia. Boxerman JL, Prah DE, Paulson ES, et al. Gadolinium-based cerebral blood volume estimation determined by comparison with MION as a criterion standard . AJNR Am J Neuroradiol 2012; 33:1081-87. Boxerman JL, Schmainda KM, Weisskoff RM. Relative cerebral blood volume maps corrected for contrast agent extravasation significantly correlate with glioma tumor grade, whereas uncorrected maps do not . AJNR Am J Neuroradiol 2006; 27:859-67. Welker K, Boxerman J, Kalnin A, et al. ASFNR recommendations for clinical performance of MR dynamic susceptibility contrast perfusion imaging of the brain . AJNR Am J Neuroradiol 2015; 36: E41-E51. 相关问题 Question-DSC：如何做一个DSC灌注研究？","tags":"DSC","title":"Question-钆的T1效应：钆的T1效应出现情况下，对比增强区域有何表现？"},{"url":"http://chunshan.github.io/MRI-QA/dsc/bolus-gd-effect.html","text":"原文链接: If gadolinium contrast is used to increase signal intensity on routine MR images, why does it decrease signal on DSC perfusion images? 概要 作为顺磁性对比剂，钆螯合物既能加速T1弛豫，又能加速T2（T2*）弛豫，哪种效应占主导地位取决于它的位置和浓度。 血管内阻隔钆化合物引起磁敏感性变化，导致主磁场（B0）畸变 传统磁共振成像中，钆浓度比较低并且广泛分布于组织细胞外空间时进行图像采集，这种情况下，T1缩短效应占据主导地位，钆化合物在T1加权像中比较明亮。 在DSC研究中，当钆化合物首次通过血管时进行图像采集，此时，钆螯合物浓度很高（通常超过2-3毫摩尔）。这缩短了T2（由于偶极-偶极相互作用）和T2*（由于血管壁内外对比剂浓度不同导致的磁敏感性变化）。周围扩散的水分子在变化的磁场中横向弛豫加速，导致T2或T2*加权序列中信号损失。 DSC T2*加权图像，分别在钆对比剂经过前，经过时和经过后采集。中间图像为大脑信号减少的峰值，尤其是血管中 高级讨论 你可能已经想到，血管中的Gd和其T2*效应之间的关系比上面的简单讨论更加复杂。 首先，常规的钆造影剂被限制在血浆中，不进入血红细胞。因此，由于血管内血管外空间的分隔导致血管内空间有磁敏感性效应，分隔的程度与血细胞比容有关，而大血管和毛细血管的血细胞比容就是不同的。 磁场强度也很重要，磁敏感性效应一般与B0 2 成正比。 所使用的脉冲序列也会决定不同血管中磁敏感性的相对贡献。GRE序列对所有血管中T2*失相位都很敏感，尤其是大血管；SE序列对小动脉，静脉和毛细血管中的T2效应更加敏感。 最后，血管相对于B0的方向影响血管内和血管外的磁敏感现象。例如血管平行于B0将没有血管外磁敏感性变化而垂直于B0的血管会有最强的磁敏感效应。这种奇怪的现象由偶极-偶极弛豫的角度依赖性导致，这在前面的一个Q&A中有解释。 参考材料 Boxerman J, Hambert L, Rosen B, Weisskoff R. MR contrast due to intravascular magnetic susceptibility perturbations . Magn Reson Med 1995; 34:555-566. (explains susceptibility effect differences between large and small vessels). Villringer A, Rosen BR, Belliveau JW et al. Dynamic imaging with lanthanide chelates in normal brain: contrast due to magnetic-susceptibility effects . Magn Reson Med 1988; 6:164-174. 相关问题 Can the T2-shortening effects of gadolinium ever be observed on routine MR imaging? What is the difference between T2 and T2*?","tags":"DSC","title":"Question-注钆效应：在常规MR增强图像中钆对比剂用于增强信号，为什么在DSC灌注图像中信号减弱？"},{"url":"http://chunshan.github.io/MRI-QA/dsc/how-to-perform-dsc.html","text":"原文链接: How do you perform a DSC perfusion study? 概要 动态磁敏感对比（DSC）灌注成像在1.5T或更高场强的设备上效果更好。将18或20号静脉导管插入右肘窝，使用高压注射器注射钆螯合物。虽然所有钆基对比剂都可以使用，但是我们更喜欢标准剂量（0.1mmol/kg）的钆贝酸盐（莫迪司，MultiHance®），它安全性好，T2弛豫率高。 对脑灌注成像，在动态研究之前，我们使用大约¼到⅓的总剂量作为预负荷。预负荷可以减少对比剂渗漏引起的T1效应，特别是采用大翻转角度序列时（并不是所有中心都使用预负荷，但我们认为它是有帮助的，尤其是肿瘤中对比剂渗漏到组织可能比较明显）。5分钟过后，剩余的钆注射速率不少于3-5mL/s，然后是20mL生理盐水\"驱逐舰\"。 注射对比剂后需要马上以类似放电影的形式获取大脑（或其他感兴趣器官）的快速T2*或T2加权像，目前大多数中心采用单次激发的平面回波成像（EPI）技术，用约20片层覆盖全脑，时间分辨率为1至1.5s。1.5T设备下，我们使用T2*加权的GRE EPI序列，参数TR/TE/α = 2000/50/35°或者T2加权的SE EPI序列， 参数TR/TE/α = 1500/30/90°。 当钆螯合物团首次通过局部循环区域时，大部分或全部仍留在血管内空间，血管壁造成钆螯合物在血管内外浓度不同，从而导致血管周围局部磁场不均匀（磁敏感效应），T2（T2*）失相位，信号强度降低。值得注意的是，这种效应与在CT灌注成像中看到的现象相反，CT灌注成像中碘造影剂穿过时组织吸收率升高。 MR信号强度可以基于像素逐个绘制出来，如下面的图像所示。定性和半定量灌注参数都可以从时间强度曲线中获得，包括到达时间（AT），达峰时间（TTP），和曲线下面积（AUC），也被称为负性增强积分（NEI）。这些参数和其他参数在后续Q&A中有更详细的描述。 钆造影剂通过时脑内的时间信号强度曲线图 高级讨论 为了不浪费预负荷和全剂量造影剂注射之间约5分钟左右的等待时间，通常在此期间我们会扫常规的T2加权成像序列或者采集T1加权像用于这个阶段的DCE研究。 参考材料 Essig M, Shiroishi MS, Nguyen TB, et al. Perfusion MRI: the five most frequently asked technical questions . AJR Am J Roentgenol 2013; 200:24-34. Jahng G-H, Li K-L, Ostergaard l, Calamante F. Perfusion magnetic resonance imaging: a comprehensive update on principles and techniques . Korean J Radiol 2014; 15:554-577. McGehee BE, Pollock JM, Maldjian JA. Brain perfusion imaging: how does it work and what should I use ? J Magn Reson Imaging 2012; 36:1257-1272. Welker K, Boxerman J, Kalnin A, et al. ASFNR recommendations for clinical performance of MR dynamic susceptibility contrast perfusion imaging of the brain . AJNR Am J Neuroradiol 2015; 36: E41-E51. 相关问题 If gadolinium contrast is used to increase signal intensity on routine MR images, why does it decrease signal on DSC perfusion images? Question-MR灌注概述：MRI中的DSC，DCE和ASL灌注方法有何不同?","tags":"DSC","title":"Question-DSC：如何做一个DSC灌注检查？"},{"url":"http://chunshan.github.io/MRI-QA/dsc/dsc-v-dce-v-asl.html","text":"原文链接: What are the differences between DSC, DCE and ASL perfusion methods used in MRI? 概要 MRI测量灌注有三种常用方法：动态磁敏感对比度成像（DSC，Dynamic Susceptibility Contrast），动态对比增强成像（DCE，Dynamic Contrast Enhanced）和动脉自旋标记（ASL，Arterial Spin Labeling）。DSC和DCE都需要静脉注射钆螯合物，而ASL不需要外源性对比剂。这些技术将在下面简要说明，在后续的Q&A中有更详细的解释。 磁共振动态磁敏感性对比成像-DSC DSC灌注成像首先静脉团注钆螯合物，随后对感兴趣器官快速获取一系列梯度回波或自旋回波图像。当钆螯合物首次通过局部循环时，它仍然主要局限在血管内空间。由于钆基的顺磁性特征，团注通过时钆基在血管周围产生局部磁场扰动，T2(T2*)失相位造成信号损失。通过测量随时间变化的信号强度，并且按照一定的数学模型拟合，各种灌注参数（如，血容量，血流量，平均通过时间）都能够计算出来。由于DSC成像仅依赖于对比剂的首次通过，它有时被称为造影剂跟踪检查。，图像采集时间非常短（约2分钟）。 恶性脑肿瘤，钆螯合物增强的T1加权像 DSC的脑血容量参数图 DCE的K trans 参数图 ASL的脑血流量参数图 磁共振动态对比增强成像-DCE 与DSC类似，DCE也需要注射钆基造影剂。但是DCE利用钆螯合物的T1缩短效应，在大约5-10分钟时间内重复获取T1加权图像。在此期间，钆造影剂在组织内的细胞外空间聚集，速度由灌注，毛细血管通透性和毛细血管表面积共同决定。这些图像数据可以直观地分析或半定量分析。应用房室模型可以得到量化结果，计算出多个生理参数，包括转移常数（K trans ），血浆体积分数（VP）和组织细胞外空间的体积分数（VE）。 动脉自旋标记-ASL 与DSC和DCE不同，ASL不需要注射钆基对比剂，而是通过在近端血管用射频脉冲\"磁标记\"水分子，使用病人自己的水分子作为内源性扩散示踪剂。当这些水分子流到感兴趣的器官，他们会减少组织的信号强度，与灌注成比例。典型的ASL脉冲序列中，会在有标记脉冲和无标记脉冲情况下都采集图像，然后相减。通过应用数学模型，可以得到各种灌注参数（主要是血流量）。ASL技术本身的信噪比就比较低，所以需多次测量取平均，导致成像时间至少需要3-5分钟才能获得有用的数据。由于信噪比的限制，3T下的ASL明显好于1.5T。 DSC，DCE和ASL更详细的描述在后续的Q&A中会提供。如下的汇总表提供了各种技术的比较。 参考材料 Borogovac A, Asllani I. Arterial spin labeling (ASL) fMRI: advantages, theoretical constrains and experimental challenges in neurosciences . Int J Biomed Imaging 2012; Article ID 818456:1-13. Diebler AR, Pollock JM, Kraft RA, et al. Arterial spin-labeling in routine clinical practice, Part 1: techniques and artifacts . AJNR Am J Neuroradiol 2008; 29:1228-1234. Essig M, Shiroishi MS, Nguyen TB, et al. Perfusion MRI: the five most frequently asked technical questions . AJR Am J Roentgenol 2013; 200:24-34. Ferré J-C, Bannier E, Raoult H, et al. Arterial spin labeling (ASL) perfusion: techniques and clinical use . Diagn Interv Radiol 2013; 94:1211-1223 Jahng G-H, Li K-L, Ostergaard l, Calamante F. Perfusion magnetic resonance imaging: a comprehensive update on principles and techniques . Korean J Radiol 2014; 15:554-577. (good recent review). McGehee BE, Pollock JM, Maldjian JA. Brain perfusion imaging: how does it work and what should I use ? J Magn Reson Imaging 2012; 36:1257-1272. Tofts PS. T1-weighted DCE imaging concepts: modelling, acquisition and analysis . MAGNETOM Flash 2010; 3:30-35. Zaharchuk G. Theoretical basis of hemodynamic MR imaging techniques to measure cerebral blood volume, cerebral blood flow, and permeability . AJNR Am J Neuroradiol 2007; 28:1850-8. 相关问题 Question-DSC：如何做一个DSC灌注研究？","tags":"DSC","title":"Question-MR灌注概述：MRI中的DSC，DCE和ASL灌注方法有何不同？"},{"url":"http://chunshan.github.io/MRI-QA/dsc/meaning_of_cbf_mtt_etc.html","text":"原文链接: How are parameters like BF, BV, and MTT defined and used in perfusion imaging? 概要 最简单的局部循环模型包含一个动脉输入，一个组织毛细血管床和一个静脉输出。这个模型有悠久的历史，最早被19世纪的Fick用来研究心脏输出。20世纪40年代，Kety和Schmidt修改了此模型以用于指示剂稀释测定血流量技术中，20世纪50年代，Meier和Zierler进一步扩展了此模型。 局部循环的简单模型有一个动脉输入和一个静脉输出，并且假设血流量（BF）和血容量（BV）是恒定的 假设通过系统的血流量和组织中的血容量都是恒定的。BF和BV通常会与灌注组织的绝对质量相除而进行归一化，其单位分别为mL/min/100g和mL/100g。此模型还假设没有血液滞积，也没有失血，所以流入的血液会最终全部流出。 穿过组织的血管通路有些相对直接而有些则有很多分叉，这意味着不同的红细胞分子或对比剂分子穿过毛细血管床的时间会很不相同（尽管最终所有分子都会从静脉流出）。平均通过时间（MTT，用秒或分钟度量）反映了注射的示踪剂随血液流动驻留在组织中的平均时间。 血流量BF，血容量BV以及平均通过时间MTT通过中心容积定律（central volume theorem）相联系，如果两个已知，第三个就可以计算出来。它们之间的关系如下：BF = BV / MTT. 考虑一下上文提到的血流量和血容量的单位，这个关系很容易记，血流量就表示单位时间内的血容量。 在灌注成像研究中，BF，BV和MTT计算出来后一般用施加伪彩的参数图显示，这些参数图提供了互补的灌注相关信息，对做出临床决策很有帮助。 T2加权像，显示胼胝体上的脑肿瘤 显著升高的BV，高度恶性的成胶质细胞瘤 例如脑梗死区域一般显示为BV和BF减小，而MTT上升。相反地，没有梗死的局部缺血区域（缺血半暗带）一般BF减小，MTT上升，而BV正常。 治疗中的脑肿瘤的对比剂增强的T1加权像，显示肿瘤变大 减少的BV预示更可能是肿瘤放射性坏死而不是肿瘤进化 如何从图像数据中计算这些量化的灌注参数图的细节将会在后面的几个Q&A中给出。 参考材料 Fick A. Ueber die Messung des Blutquantums in der Herzventrikeln . Sitz der Physik-Med Ges Wurzburg 1870; 2:16–28. (Classic paper where the \"Fick Principle\" is formulated\"). Kety SS, Schmidt CF. The determination of cerebral blood flow in man by the use of nitrous oxide in low concentrations . Am J Physiol 1945; 143:53–66. (classic paper; worth a look) Meier P, Zierler KL. On the theory of the indicator-dilution method for measurement of blood flow and volume . J Appl Physiol 1954; 6:731-744. (Lays out proof for the central volume theorem and derivation of mean transit time). Zaharchuk G. Theoretical basis of hemodynamic MR imaging techniques to measure cerebral blood volume, cerebral blood flow, and permeability . AJNR Am J Neuroradiol 2007; 28:1850-8. 相关问题 How is the arterial input function used to extract more quantitative flow information from the DSC data? Question-灌注方法：灌注（Perfusion）如何定义和测量?","tags":"DSC","title":"Question-灌注参数：血流量（BF，Blood Flow），血容量（BV，Blood Volume），平均通过时间（MTT， Mean Transit Time）等参数是怎么定义的？在灌注成像中如何使用？"},{"url":"http://chunshan.github.io/MRI-QA/dsc/measuring_perfusion.html","text":"原文链接: How is perfusion defined and measured? 概要 灌注是指通过一个器官或组织的毛细血管循环的血流量。考虑到器官的大小不同，灌注的量化通常需要归一化，血流量（mL/min）除以器官质量（每100g），所以灌注的单位一般被表示为mL/min/100g。 脑的动脉自旋标记的灌注参数图，有血管性脑胶质瘤 不同的器官灌注情况不同，而且对同一器官，灌注也会随着其病理改变或代谢需要而改变。例如，脑灰质和白质灌注分别约60和20mL/min/100g。心肌灌注则大得多，休息时约100mL/min/100g，最大运动时可达400mL/min/100g。 灌注的测量需要使用示踪剂（分子，分子聚集体或小颗粒），示踪剂与血流充分混合，分布在组织中并且可以被检测。一些示踪剂会留在血管内，其他的示踪剂则分布更加广泛。示踪剂可分为： 血管内示踪剂，限制在血管中。用于MR的血管内示踪剂包括钆膦维司（Ablavar，与血清白蛋白结合）和超小超顺磁性铁氧化合物分子（USPIO）。 细胞外示踪剂，不进入细胞，但可自由地通过血管壁，分布在组织的细胞外空间。大多数钆基造影剂属于此类。 可扩散示踪剂，分布在组织所有部位，包括细胞内。通常用于MRI的可扩散示踪剂是磁标记的水分子，用于动脉自旋标记（ASL，arterial spin labelling ）。 高级讨论 血管内示踪剂 实验室灌注测量使用的约15微米直径的可注射微球体 虽然没有完美的方法，传统测量组织灌注的实验室\"金标准\"是动脉内注射约15微米直径的微球体，这些颗粒会被困毛细血管床处，困住的比例与局部血流量呈正比，然后采集解剖标本，使用光学或电子学显微镜对颗粒计数，也可以对微球体进行放射性或者荧光标记从而能够使用半自动计数方法。 由于上述方法需要插入动脉导管收集组织进行测量，实验室微球体对于常规临床灌注是不可行的。然而有几种能够被无创影像学方法检测的微球体已经被开发出来用于临床，最常见的有放射性同位素标记的血细胞，大颗粒聚合白蛋白（核医学）和包膜微泡（超声），但还没有真正市售的微球体用于MR灌注成像。钆膦维司（ablavar）与血清白蛋白结合并且在注射后几小时都会局限于血管内空间，与上述微球体性质相仿。超小超顺磁性铁氧化合物（USPIO）粒子也在MR成像中被尝试使用以达到类似目的。 首过法心肌灌注检查的电影图像，使用饱和恢复的扰相GRE序列 细胞外示踪剂 CT灌注成像和MR灌注成像中分别广泛使用碘基和钆基造影剂作为示踪剂，这些低分子量（500-1000Da）化合物注射后最初分布在血浆中，随即很快扩散到大多数组织的细胞外空间。唯一的例外是在中枢神经系统中，沿血脑屏障紧密的内皮细胞连接会阻断细胞外通道，阻止造影剂进入正常的大脑和脊髓。虽然一些新的专门的MR造影剂（如gadoxetate/eovist）有肝摄取，大部分造影剂不能进入正常细胞，局限在细胞外空间中。 可扩散示踪剂 基于 15 O水的PET是无创测量血流量最准确的方法 自由扩散的示踪剂是放射性或磁性标记的离子或能在细胞内外轻松穿梭的小分子。在核医学（PET）中众所周知的有 15 O标记的O 2 ，H 2 O，CO 2 ; 13 NH 2 ; 82 Rb; 201 TI. 另一种扩散性示踪剂，吸入性疝气，用于CT灌注成像，曾经在20世纪90年代获得一定的关注，现在已经基本被抛弃了。MRI中磁标记的水分子被广泛用作扩散性示踪剂，这也是动脉自旋标记（ASL）技术的基础。 使用 15 O的PET通常被认为是无创测量大多数器官灌注的金标准。但这是一项繁琐的技术，需要在线产生示踪剂，然后通过连续动脉采血输送给病人。这不是一个完美的解决方案，受部分容积效应的影响尤其在小且复杂的大脑结构周围。相比于微球体，基于 15 O水的PET往往会低估高流量时的灌注而高估低流量时的灌注。 使用 15 O水的PET和使用DSC或ASL的MR灌注的详细比较几乎没有。已经进行的研究表明，MR灌注方法具有可重复性，能够获得血流量可靠的定性信息，准确的定量测量是可能的但是具有挑战性，依赖于MR成像方法（DSC或ASL）和使用的复杂数学模型。 参考材料 Cuenod CA, Balvay D. Perfusion and vascular permeability: basic concepts and measurement in DCE-CT and DCE-MRI . Diagn Interven Imaging 2013; 94:1187-1204. (Good review of basic mechanisms; some terminology is slightly different than abbreviations used in Tofts models). Frackowiak RSJ, Lenzi G-L, Jones T, Heather JD. Quantitative measurement of regional cerebral blood flow and oxygen metabolism in man using 15O and positron emission tomography: theory, procedure, and normal values . J Comput Assist Tomogr 1980; 4:727-736. Ito H, Inoue K, Goto R, et al. Database of normal human cerebral blood flow measured by SPECT: I. Comparison between I-123-IMP, Tc-99m-HMPAO, and Tc-99m-ECD as referred with O-15 labeled water PET and voxel-based morphometry . Ann Nucl Med 2006; 20:131-138. Prinzen FW, Bassingthwaighte JB. Blood flow distributions by microsphere deposition methods . Cardiovasc Res 2000; 45:13-21. Salerno M, Beller GA. Noninvasive assessment of myocardial perfusion . Circ Cardiovasc Imaigng 2009; 2:412-424. (comparison of different imaging methods for myocardial perfusion measurement) Zhang K, Herzog H, Mauler J, et al. Comparison of cerebral blood flow acquired by simultaneous [15O]water positron emission tomography and arterial spin labeling magnetic resonance imaging . J Cerebr Blood Flow Metab 2014; 34:1373-1380. 相关问题 Can myocardial perfusion be accurately quantified? What are the differences between DSC, DCE and ASL perfusion methods used in MRI?","tags":"DSC","title":"Question-灌注方法：灌注（Perfusion）如何定义和测量？"},{"url":"http://chunshan.github.io/MRI-QA/parallel-imaging/artifacts-in-pi.html","text":"原文链接: Are there any artifacts specific to parallel imaging? 概要 导致\"常规\"MR成像伪影的因素也同样会影响并行成像（PI），如噪声，运动，混叠，化学位移，吉布斯（Gibbs），磁敏感，射频干扰等。但是这些伪影在并行成像中可能看起来会略有差异因为它们受并行成像复杂重建过程的影响，包括线圈敏感性映射的产生，阈值化/蒙版，多项式拟合，和空间谐波或图像展开权重因子的估计。 SENSE鬼影 混叠（Aliasing）是公认的造成所有类型磁共振成像中伪影的原因。当采样频率不足信号最高频率的2倍时就会发生混叠，在非并行磁共振成像中混叠伪影通常表现为解剖结构的\"卷折\"，特别在频率编码方向。标准的混叠伪影及其补救措施在 后续的Q&A 中有详细的描述。 SENSE鬼影是在重建FOV（field-of-view）比成像物体小时发生的一种特殊类型的混叠伪影，SENSE鬼影是一种折叠伪影，出现在图像相位编码方向的中间（有时在边缘）。 SENSE算法须在执行展开步骤前考虑减小FOV后每个像素的所有贡献。如果FOV非常小，这等同于忽略成像物体FOV外部对信号的贡献，造成对成像像素的污染，SENSE算法不能打开这个额外的卷折。被排除的外围组织的鬼影沿重建图像等间距地重复出现，间距等于单个线圈数据减小的FOV。 SENSE中运动可能发生在校正阶段和成像阶段之间。 SENSE类型的并行成像序列中的运动伪影可能发生在校正扫描和图像采集开始之间的时间，由此产生的伪影在相位编码方向看起来像一组重复的边缘，图像的其他部分则没有什么异常。重复的边缘来自图像最明亮的部分，一般是皮下的脂肪，其信号在校正扫描中非常强。如果这种现象造成问题，解决方法是在训练患者和对成像部位采取更好的保护措施后重新进行校准扫描和成像序列。自校正并行成像序列（如mSENSE）也会消除这种特殊类型的运动伪影。 并行成像中的噪声通常分布并不均匀。 并行成像中的噪声与使用更高的加速因子（R）直接相关。并行成像噪声的特有之处在于其在图像上的分布并不均匀，而是取决于有空间依赖性的参数称为几何因子（g）。这个现象可以在膝盖图像中得到很好的展示（左），噪声频带被投影在图像的前部和后部，中间部分却没有。这种非均匀的噪声分布在SENSE/ASSET中比在GRAPPA/ARC方法中更常见。 有几种方法可以用于减小并行成像中残留的混叠伪影和噪声。可以对校正步骤进行调整，如SENSE方法中重复进行线圈敏感性映射，GRAPPA方法中采集更多的ACS线。如果可能的话，还可以将有最多线圈元素的方向设置为相位编码轴。 减小加速因子R也会有帮助，尽管这样会增加成像时间。如果使用3D扫描，在相位编码和层面（分区）编码方向都进行加速通常会更好。例如，假设想要整体的加速因子为R=4，最好分解为在两个方向加速因子分别为R=2，好过在一个方向上R=4。先进的并行成像采集技术如CAIPIRINHA通过减少彼此混叠的像素数目也会提高图像质量。 参考材料 Breuer F. Artifacts and pitfalls in parallel imaging . European Society for Magnetic Resonance in Medicine and Biology (ESMRMB) Teaching Session, Leipzig, 6 Oct 2011. Goldfarb JW. The SENSE ghost: field-of-view restrictions for SENSE imaging . J Magn Reson Imaging 2004; 20:1046-1051. Yanasak NE, Kelly MJ. MR imaging artifacts and parallel imaging techniques with calibration scanning: a new twist on old problems . Radiographics 2014; 34:532-548. 相关问题 Why do parallel imaging studies look so noisy? What is CAIPIRINHA? Isn't it some sort of a drink?","tags":"Parallel-Imaging","title":"Question-并行成像中的伪影：并行成像中有什么特别的伪影么？"},{"url":"http://chunshan.github.io/MRI-QA/parallel-imaging/noise-in-pi.html","text":"原文链接: Why do parallel imaging studies look so noisy? 概要 并行成像（PI，Parallel Imaging）的检查有时候确实看起来噪声很大。这是并行成像技术减少成像时间带来的直接后果。这样做，采集的数据点变少，用于平均的数据点也变少，因此信噪比（SNR）相应的下降。因此，并行成像序列的SNR总是比同等的非并行成像序列低。 所有影响非并行成像序列SNR的因素也会影响并行成像序列：磁场强度，磁体硬件，线圈加感，成像组织，脉冲序列，脉冲序列时序参数，体素大小，相位编码步数，接收器带宽，信号平均次数等。除此以外，并行成像序列的SNR（SNRparallel）受另外两个因素的影响进一步降低，用如下的方程表示： 其中R是并行成像加速因子，g为具有空间依赖性的项称为几何因子。 √R项表示预期的信噪比损失是由减少扫描时间（加速因子R）引起的。由于仅采样k空间中1/R条线，这一项与非并行成像中减少相位编码步数或信号平均次数有相似的影响。因此，选择R = 2可以将成像时间减为原来的1/2，但信噪比降低为原来的1/√2 ≈ 0.71。SNR的显著影响如下图所示，其中R从1增加到3，再增加到6。 没有加速（R=1） 加速因子R=3 加速因子R=6 膝关节SENSE MRI成像R=4。注意图像中噪声分布并不均匀，与随空间变化的因子g相关。 几何因子g更加有趣，是并行成像特有的。g取决于每一个点被重复采集的个数以及对应的线圈敏感性差异。g因子不是一个常数，而是随图像位置变化而变化，对于常用的典型线圈设计，整个成像容积内g因子的范围在1.0至2.0之间。 g因子依赖于1）表面线圈的数目和位置，2）线圈加感，3）成像平面，4）扫描平面内的相位编码方向，5）成像区域中体素的位置。它与表面线圈元素的数目，尺寸和方向都相关，可以认为它是对线圈分离的一个度量，有时也被称为\"噪声放大因子\"。 参考材料 Aja-Fernandez, Vegas-Sanchez-Ferrero G, Tristan-Vega A. Noise estimation in parallel MRI: GRAPPA and SENSE . Magn Reson Imaging 2014; 32:281-290. Breuer FA, Kannengiesser SA, Blaimer M, Seiberlich N, Jakob PM, Griswold MA. General formulation for quantitative g-factor calculation in grappa reconstructions . Magn Reson Med 2009; 62:739–46. Pruessmann KP, Weiger M, Scheidegger MB, Boesiger P. SENSE: Sensitivity encoding for fast MRI . Magn Reson Med 1999; 42:952-962. Robson P, Grant A, Madhuranthakam A, Lattanzi R, Sodickson D, McKenzie C. Comprehensive quantification of signal-to-noise ratio and g-factor for image-based and k-space-based parallel imaging reconstructions . Magn Reson Med 2008; 60:895. Sodickson DK, Griswold MA, Jakob PM, et al. Signal-to-noise ratio and signal-to-noise efficiency in SMASH imaging . Magn Reson Med 1999; 41:1009-1022. 相关问题 并行成像中有什么特别的伪影么？","tags":"Parallel-Imaging","title":"Question-并行成像中的噪声：为什么并行成像的检查看起来噪声如此大？"},{"url":"http://chunshan.github.io/MRI-QA/parallel-imaging/caipirinha.html","text":"原文链接: What is CAIPIRINHA? Isn't it some sort of a drink? 概要 Caipirinha是巴西的一种鸡尾酒，由甘蔗酒（cachaça），糖，冰和酸橙制成。2014FIFA世界杯上有这种鸡尾酒的大量新闻，使得它在世界范围内的知名度又获得了提升。 但是在MRI中，CAIPIRINHA是一种由Siemens提供的一种并行成像方法，主要用于三维的屏气腹部图像，CAIPIRINHA是Controlled Aliasing in Parallel Imaging Results in Higher Acceleration的缩写。 SENSE和GRAPPA都可以用于3D采集模式，在两个相位编码方向同时加速。然而由于线圈的几何形状和敏感性不同，当选择比较大的R值时可能会出现严重的残余混叠伪影和放大的噪声。 CAIPIRINHA使用一组独特的k空间采样模式减少像素混叠和重建图像上的重叠。由于在相位编码梯度表中施加了额外的偏移，k空间中采集的数据点也被平移了。 以下是GRAPPA类并行成像序列三种可能的k空间填充方式，其中R=4。注意读出方向（kx）是进入页面的。红圈表示采集的数据点，白圈表示缺失的数据点，必须在重建过程中从已知数据（红点）估计出来。 在一个方向上加速（R=4） 在两个方向上加速（R = 2x2 = 4） CAIPIRINHA的加速模式，在两个方向加速加交替行的相移 第一个图中，加速仅沿一个方向（kz），每4行采集一行。这种策略通常会增加噪声和残余的混叠伪影。 第二个图中，使用了一个稍微好点的策略，加速在ky和kz方向均分，因此，在两个相位编码方向都会出现每隔一条线会缺失，总的加速仍然保持为4（R = 2 x 2）。 第三个图中，使用了CAIPIRINHA模式的采样，每一个相位编码方向的R = 2但是中间列数据采样有相移（每4列）。此相位偏移提高了重建的准确性，减少了噪声和混叠。混叠伪影仍然存在但是被平移到图像空间的角落上，不再集中于几个位置。 目前CAIPIRINHA通常用于3D肝脏检查，在对比剂通过时可以得到质量非常优秀的图像，而且加速比很高。下面显示了一个临床的例子，CAIPIRINHA也被建议用于弥散加权成像和MRA。 使用CAIPIRINHA的3D T1-VIBE，加速因子R = 4。在对比剂通过过程中保持屏气，每隔2秒重复采集覆盖整个肝脏的72层图像（3mm厚）。 高级讨论 CAIPIRINHA的附加笔记 虽然上面的例子使用的是GRAPPA，但CAIPIRINHA既可以与SENSE算法一起使用也可以与GRAPPA算法一起使用，甚至可以与非笛卡尔方法一起使用。 除了第三个图中被称为Δ=2的交替相位方法，许多不同的CAIPIRIINHA采样模式也是可行的。可能的采样模式数量随加速因子R的增加指数增加。 参考材料 Caipirinha . Wikipedia, the Free Encyclopedia. Breuer F, Blaimer M, Griswold M, Jakob P. Controlled aliasing in parallel imaging results in higher acceleration (CAIPIRINHA) . MAGNETOM Flash 2012;1:2-7. (Siemens promotional brochure). Breuer FA, Blaimer M, Mueller MF, et al. Controlled aliasing in volumetric parallel imaging (2D CAIPIRINHA) . Magn Reson Med 2006; 55:549-556. Yutzy SR, Seiberlich N, Duerk JL, Griswold MA. Improvements in multislice parallel imaging using radial CAIPIRINHA . Magn Reson Med 2011; 65:1630-1637. 相关问题 什么是并行成像？与常规成像有什么不同？","tags":"Parallel-Imaging","title":"Question-CAIPIRINHA：CAIPIRINHA是什么？难道不是一种饮料么？"},{"url":"http://chunshan.github.io/MRI-QA/parallel-imaging/grappaarc.html","text":"原文链接: How does GRAPPA/ARC work? 概要 GRAPPA (GeneRalized Autocalibrating Partial Parallel Acquisition) 和 ARC (Autocalibrating Reconstruction for Cartesian imaging)都是多线圈并行成像技术。像其他的并行成像技术（如SENSE/ASSET）一样，GRAPPA/ARC仅采样数量有限的相位编码步骤。相位欠采样大大减少成像时间但是导致信号混叠，必须展开。SENSE/ASSET中，线圈敏感性用于在傅里叶变换后的图像域区分这些信号，而GRAPPA/ARC则是在傅里叶变换前的k空间中进行校正。可以说： SENSE/ASSET方法是先重建，然后校正 GRAPPA/ARC方法是先校正，然后重建 下表说明了GRAPPA/ARC过程中四个主要的步骤： 数据采集。对采集的MR信号进行数字化，解调，填充每个线圈的k空间矩阵。因为跳过了多个相位编码步骤，许多k空间中的线会丢失。然而穿过k空间中心的线是全采样的，构成自动校准信号（ACS）区域。这些额外的ACS线就是在图像采集过程中完成的（因此术语为\"自校准\"）。 估计缺失的线。ACS中得到的已知数据用于计算每个线圈的权重因子。这些权重因子反应了每个线圈在全FOV的k空间数据中如何扭曲，变形和空间频率错置。估计k空间中缺失的点采用迭代方式，使用全局权重因子结合每个小区域（称为块或核）的局部已知数据。需要指出的是，使用所有线圈的权重因子和已知数据估计一个线圈的缺失数据。 生成单个线圈的图像。将k空间中缺失的线填充后，进行傅里叶变换得到每个线圈的单张图像。与SENSE/ASSET中的线圈图像不同，GRAPPA/ARC得到的图像是没有混叠的。 组合。最终对单个线圈的图像进行平方和运算得到最终的幅度图像。 GRAPPA/ARC重建过程概览。注意：相位编码方向为水平轴。 GRAPPA/ARC中的关键步骤是估计缺失的点，这个步骤中有很多可能的变量，包括重建核的大小和使用参数的数目。GRAPPA和ARC主要的不同是后者使用3D的核，将所有三个方向邻域的源数据考虑进去计算缺失的数据。ARC中的估计过程也有一点不同，使得3D数据计算是可控的。 GRAPPA/ARC中估计k空间中缺失的线。此处的相位编码沿垂直轴。 高级讨论 除了标准的产品，GE还提供了在\"Turbo Mode\"下使用ARC的选择，可使扫描速度再提高一倍。TurboARC调整数据采样模式，在k空间外围采集更少的数据点。数据的填充模式（中心圆vs中心椭圆）可能也会调整。 参考材料 Blaimer M, Breuer F, Mueller M, Heidemann RM, Griswold MA, Jakob PM. SMASH, SENSE, PILS, GRAPPA. How to choose the optimal method . Top Magn Reson Imaging 2004;15:223-236 [review]. Brau A. New parallel imaging method enhances imaging speed and accuracy . GE Signa Pulse, 2007; 36-38. (Promotional piece describing GE's ARC method). Brau ACS, Beatty P, Skare S, Bammer R. Comparison of reconstruction accuracy and efficiency among autocalibrating data-driven parallel imaging methods . Magn Reson Med 2008; 59:382-395 Deshmane A, Gulani V, Griswold MA, Seiberlich N. Parallel MR imaging . J Magn Reson Imaging 2012;36:55-72. (review) Griswold MA, Jakob PM, Heidemann RM, et al. Generalized autocalibrating partially parallel acquisitions (GRAPPA) . Magn Reson Med 2002; 47:1202-1210 相关问题 我们的扫描仪中并行成像有两种不同的选择SENSE和GRAPPA。它们的原理是什么？应该选择哪一个？","tags":"Parallel-Imaging","title":"Question-GRAPPA/ARC：GRAPPA/ARC的原理是什么？"},{"url":"http://chunshan.github.io/MRI-QA/parallel-imaging/senseasset.html","text":"原文链接: How does SENSE/ASSET work? 概要 SENSE(SENSitivity Encoding)和ASSET(Array coil Spatial Sensitivity Encoding)是被最广泛使用的并行成像方法。这些技术主要在从单个线圈重建后的图像空间进行（与此相反，GRAPPA/ARC主要在图像重建前的k空间数据上操作）。主要的MR厂商都提供了不同版本的SENSE技术，有不同的商品名字：Siemens（mSENSE），GE（ASSET），Philips（SENSE），Hitachi（RAPID-\"Rapid Acquisition through Parallel Imaging Design\"），Toshiba（SPEEDER）。 SENSE/ASSET有四个步骤： 产生线圈敏感性映射图； 采集部分k空间MR数据； 从每个线圈重建部分FOV的图像； 通过矩阵求逆展开/合并部分FOV图像。 计算线圈敏感性是SENSE技术中第一步也最重要的步骤，使用每个表面线圈单独采集全视野下的低分辨率图像，低分辨率体线圈图像除以这些图像得到归一化数据。然后对这些数据使用滤波，阈值和点估计产生线圈敏感度映射（右图所示）。这些映射图能够量化的表示每个线圈接收区域内来自不同原点信号的相对权重。 线圈敏感性的计算需要在图像实际扫描之前进行，大约花20秒钟（GE的ASSET就使用这种方式）。另外，线圈自动校准也可以集成入脉冲序列本身（Siemens的mSENSE），后一种方法的优势是对发生在校准和扫描开始之间的运动不那么敏感。 一旦线圈敏感性映射图被计算出来，磁共振脉冲序列就开始。假如并行成像的加速因子为2，跳跃采集k空间中交替的行，每个线圈会产生一个½-FOV的卷折图像。矩阵求逆的过程被用于展开和组合从每个线圈获得的混叠图像。此反演过程并不像第一眼看上去那么复杂，2个像素的简单例子如下所示： 在扫描前的校正阶段，扫描仪为每个表面线圈计算每个点上的敏感性，并且在内存中存储为大的阵列。对于患者A点产生的磁共振信号，线圈1和2检测此信号的敏感性分别记为S1A和S2A，相似的，对另一个点B，线圈1和线圈2的敏感性分别记为S1B和S2B。 每个线圈的数据被重建为图像后会有显著的卷折（折叠）伪影，这种现象称为混叠，是因为成像过程中频率部分的采样数不足以区分所有的空间位置导致的。 ½-FOV图像中的每一个像素点（P）其实是两个点（A和B）的贡献之和。线圈1和线圈2中的这两个像素值分别表示为P1和P2，可以写为： P1 = A•S1A + B•S1B P2 = A•S2A + B•S2B 由于Pi和Si都是已知的，真正的信号（A和B）可以通过简单的代数方法计算得到，两个联立的方程组两个未知数。在磁共振扫描仪中会对所有的数据点使用矩阵求逆的技术，与上述过程相似，想法是完全相同的。希望这个例子可以帮助消除围绕SENSE技术重建过程的神秘感。 高级讨论 正如你所预料的，实际中重建过程比上面讨论的要复杂一些。SENSE典型的描述是使用矩阵形式，包含如下部分：I为全FOV下的最终图像，P为有混叠的部分FOV图像，S为每个线圈粗略的敏感性分布，通过体线圈进行归一化，λ为从完整体线圈得到的粗分辨率图像，用于限制正则化过程中的解，ψ为噪声协方差矩阵，表示由具有患者特异性的线圈元素之间相关作用导致的噪声增加。 求逆过程需要解如下的矩阵方程，在图像域使用最小二乘优化： I = (S H ψ -1 S + λ -1 ) -1 S H ψ -1 P 参考材料 Blaimer M, Breuer F, Mueller M, Heidemann RM, Griswold MA, Jakob PM. SMASH, SENSE, PILS, GRAPPA. How to choose the optimal method . Top Magn Reson Imaging 2004;15:223-236 [review]. Deshmane A, Gulani V, Griswold MA, Seiberlich N. Parallel MR imaging . J Magn Reson Imaging 2012;36:55-72. (review) Glockner JF, Hu HH, Stanley DW, et al. Parallel MR imaging: a user's guide . Radiographics 2005;25:1279-1297. Larkman DJ, Nunes RG. Parallel magnetic resonance imaging . Phys Med Biol 2007;52:R15-R55 [review] Pruessmann KP, Weiger M, Scheidegger MB, Boesiger P. SENSE: Sensitivity encoding for fast MRI . Magn Reson Med 1999; 42:952-962. 相关问题 并行成像是一种特殊的脉冲序列么？可以在任何线圈任何方向上进行么？ 什么是并行成像？与常规成像有什么不同？","tags":"Parallel-Imaging","title":"Question-SENSE/ASSET：SENSE/ASSET的原理是什么？"},{"url":"http://chunshan.github.io/MRI-QA/parallel-imaging/two-types-of-pi.html","text":"原文链接: Our scanner has two different options for parallel imaging (SENSE and GRAPPA). What are they and which should I use? 概要 并行成像技术一般分为两类：1）在图像域进行重建的技术，这类技术需要展开或反转的过程；2）在k空间进行的技术，这类技术需要在重建之前计算缺失的谐波数据。结合这两种技术的混合技术正变得越来越受欢迎。 图像域并行成像 是目前最广泛使用的方法，或许也是最容易理解的方法。我们将这一技术称为SENSE，这是此技术最初广泛使用的缩写（SENSitivity Encoding）。每一个主要的MR制造商对此技术有不同的商品名：Siemens（mSENSE），GE（ASSET），Philips（SENSE），Hitachi（RAPID），Toshiba（SPEEDER）。 K空间并行成像 技术操作的是复频率域信号，在这些信号转换为图像之前。这些方法都归在GRAPPA这一类下，GRAPPA最初是GeneRalized Autocalibrating Partial Parallel Acquisition的缩写，GRAPPA没有SENSE用得广泛，某种程度上更难理解。Siemens使用术语GRAPPA，而GE称为ARC（Autocalibrating Reconstruction for Cartesian imaging）。据我所知，其他的主要厂商尚未将K空间中的并行成像方法发布为一个产品。 每个技术的相对优点和缺点 在目前技术不断发展的状态下，哪种技术更优越尚没有达成共识。使用图像域的方法（SENSE/ASSET）还是使用k空间的方法（GRAPPA/ARC）与厂商有关，也与具体的情况有关。然而，以下的一般规则仍然是适用的。 总成像时间。GRAPPA/ARC序列的时间一般比SENSE/ASSET长，因为它需要额外的时间用于k空间线数据的自校正。这个时间消耗对低分辨率的图像而言更加严重，这种情况下校正时间在总采集时间中所占的比例更高。随着成像矩阵尺寸的增加，GRAPPA/ARC序列此相对缺点降低。 信噪比。SENSE/ASSET随着加速因子增加有稍高的SNR和更好的图像质量。R=2的情况下，这种差异几乎可以忽略。 身体部位。SENSE/ASSET在异质的身体部位（如肺）上表现很差，这些部位上很难获得准确的线圈敏感映射图，此时GRAPPA/ARC更有优势。 运动。如果在校准扫描和采集扫描之间有运动，SENSE/ASSET可能效果很差，导致重建伪影。一个明显的例子是患者在序列之间发生运动，即使此患者在每一个单独的序列扫描时保持完美的静止。第二个更微妙的例子适用于屏住呼吸的肝脏成像。这种情况下，在SENSE/ASSET的校正和成像时，患者可能很难暂停呼吸在完全相同的程度。此时，带自校正技术的GRAPPA/ARC会更受欢迎（假如全部序列可以在一次屏住呼吸的时间内完成）。应该指出的是，一些SENSE更新的变种（mSENSE，RAPID）也使用了自校正，因此这种区别就没有了。 视野（FOV）。GRAPPA/ARC更能容忍小视野。当整个FOV比成像物体还小时，SENSE/ASSET可能在相位编码方向上产生伪影/卷折。相反，GRAPPA/ARC允许选择更小的FOV，但没有明显的伪影。 在单次激发的平面回波成像（EPI）中的使用。GRAPPA/ARC在磁敏感引起场扭曲的情况下不太会影响重建过程，这比SENSE/ARC有显著的优势。 尽管这些细微的区别，SENSE和GRAPPA对几乎所有的应用中都可互换使用。在高级讨论和参考文献中有更多额外的细节。 高级讨论 下面列出的是一些更高阶的后续问题和解释。 为什么在高度不均匀的区域如肺和腹部GRAPPA比SENSE表现好？ 答案在于SENSE需要对每个线圈产生准确的敏感性映射，这可能是很难获取的。GRAPPA中，估计缺失的k空间线数据更多是一个全局的过程，涉及三个线圈的数据，同时还有自动校准区域。它不受局部不均匀性的影响。在k空间中心额外采集的线数据还会增加信噪比和估计的准确性。 为什么GRAPPA对单次激发的平面回波成像（EPI）效果更好？ 这儿也是线圈敏感性映射的问题。EPI方法本身的图像扭曲就比较严重，主要是由磁敏感效应引起的局部共振频率差异导致的。使用SENSE方法，由磁敏感效应引起的图像扭曲和由线圈敏感性映射导致的图像扭曲可能是不同的。由于上面描述的原因，GRAPPA方法中，这些图像扭曲对估计缺失的k空间线影响相对较小。 为什么GRAPPA对小FOV的场景效果更好？ 对一些并行成像应用（如心脏磁共振）而言，需要相对小的FOV来观察感兴趣的解剖结构。减小FOV势必会带来混叠伪影，这并不是并行成像才特有的。在SENSE/ASSET中，这种混叠不能使用常规的并行成像展开算法进行校正，因而通常在图像的中心会观察到\"SENSE Ghost\"伪影。相反，GRAPPA/ARC可以不对重建算法进行任何修改就能产生部分混叠的全FOV图像。回忆一下，小FOV需要比通常的k空间线间距要大。简单增加线间距不会显著影响GRAPPA/ARC对缺失线数据的估计。因此小FOV应用中GRAPPA/ARC更受欢迎。 参考材料 Blaimer M, Breuer F, Mueller M, Heidemann RM, Griswold MA, Jakob PM. SMASH, SENSE, PILS, GRAPPA. How to choose the optimal method . Top Magn Reson Imaging 2004;15:223-236 [review]. Brau A. New parallel imaging method enhances imaging speed and accuracy . GE Signa Pulse, 2007; 36-38. (Promotional piece describing GE's ARC method). Griswold MA, Jakob PM, Heidemann RM, et al. Generalized autocalibrating partially parallel acquisitions (GRAPPA) . Magn Reson Med 2002; 47:1202-1210 Pruessmann KP, Weiger M, Scheidegger MB, Boesiger P. SENSE: Sensitivity encoding for fast MRI . Magn Reson Med 1999; 42:952-962. 相关问题 什么是并行成像？与常规成像有什么不同？ GRAPPA/ARC的原理是什么？","tags":"Parallel-Imaging","title":"Question-两种类型的并行成像（PI）：我们的扫描仪中并行成像有两种不同的选择SENSE和GRAPPA。它们的原理是什么？应该选择哪一个？"},{"url":"http://chunshan.github.io/MRI-QA/parallel-imaging/why-and-when-to-use.html","text":"原文链接: Should parallel imaging acceleration be used in every case? 概要 大多数现代磁共振系统建立在并行架构上，包含一个体发射线圈和一组局部接收线圈，可以接入并行通道进行信号放大和处理。当以并行成像（PI，Parallel Imaging）模式操作时，关于线圈位置和敏感性的信息就会用于减少相位编码步数加速成像。并行成像的加速因子可以用R量化表示，这个数字通常在2和6之间。 是否要使用并行成像进行加速取决于一个特定检查所需的空间和时间分辨率，进行此检查的场强和感兴趣的部位。 并行成像主要的优势可以简单列举为： 图像采集时间的显著减少。这与加速因子（R）成反比，如R = 2，图像采集时间减半，节省下来的时间就是金钱（时间=美元/欧元），可以用于扫描额外的序列，或者在原来成像时间中获得更高的空间分辨率或时间分辨率。 减少磁敏感伪影。使用并行采集和重建过程可以减少磁共振信号中相位相关的失真。这在平面回波成像中是特别有利的。 在使用并行成像的弥散加权图像中可以看到磁敏感导致的失真变小 尽管有这些好处，也必须考虑并行成像的限制： 信噪比（SNR，singal-to-noise）的减少。即使没有运动，所有的并行成像技术都会导致信噪比的显著降低，如果R = 2，图像信噪比减少√2，也就是40%。这个缺点在高场（高场时其本身的信噪比更高）和某些解剖区域（如相对对称并且均匀的大脑）通常不是问题。 并行成像特有的伪影增加。因为并行成像取决于线圈敏感度或它们协调贡献的估计，额外图像处理相关的伪影总是会出现，并且非均匀地分布。这样的重建错误随着加速因子（R）增大而增加，但是随着线圈单元数量的增加而减少。 没有加速（R=1） 加速时（R=4）出现伪影 那么，什么时候应该选择并行成像加速，什么时候不应该？ 没有明确\"正确\"或\"错误\"的答案，总体而言，需要根据成像时间和图像质量不断进行尝试才能做出最终的决定。如果不使用并行成像时时间仍可接受，并且能够获得所需的体素分辨率和空间覆盖，那么最好不要用并行成像技术。在我们中心，神经和肌肉骨骼成像一般不使用并行成像，但是胸部和腹部成像广泛使用并行成像，而且3T比1.5T时并行成像更常用。随着技术和线圈的不断发展，我们期待并行成像在所有领域的使用都会增加。 参考材料 Deshmane A, Gulani V, Griswold MA, Seiberlich N. Parallel MR imaging . J Magn Reson Imaging 2012;36:55-72. (review) Glockner JF, Hu HH, Stanley DW, et al. Parallel MR imaging: a user's guide . Radiographics 2005;25:1279-1297. Larkman DJ, Nunes RG. Parallel magnetic resonance imaging . Phys Med Biol 2007;52:R15-R55 [review] 相关问题 什么是并行成像？与常规成像有什么不同？","tags":"Parallel-Imaging","title":"Question-使用并行成像：任何情况下都应该使用并行成像进行加速么？"},{"url":"http://chunshan.github.io/MRI-QA/parallel-imaging/pi-coils-and-sequences.html","text":"原文链接: Is PI a special type of pulse sequence? Can it be performed with any coil in any direction? 概要 两个问题的答案都是No。 并行成像（PI，Parallel Imaging）不是一种脉冲序列，而是一种 图像重建技术 。实际上任何一种脉冲序列（SE, GRE, DWI, IR, MRA等）都可以将并行成像作为一种选择。 对脊柱成像而言，并行成像在S-I方向进行。 并行成像利用两个或多个接收线圈在空间和/或频率敏感性上的不同，每个线圈的输出都可以被独立地记录，数字化和处理。通常情况下，接收器线圈阵列使用4,8,16,32,64甚至更多的线圈。因此，并行成像不会是仅有一对正交输出通道的表面线圈，头线圈，膝盖线圈或大型的体线圈。 可进行并行成像的方向取决于线圈阵列的排列方向，具体而言，这些线圈沿并行成像的方向必须有不同的敏感性曲线。 对脊柱成像而言，接收线圈通常沿脊柱中轴以线性的方式排列，从头到尾骨。从上到下（S-I）的线圈敏感性差异最大，这是用于并行成像标准的方向。 下面的插图显示了两个可能的头接收线圈配置。左边所有的线圈在从上到下（S-I）的方向都有相似的敏感性曲线，但从左到右（L-R）和从前到后（A-P）敏感性曲线有显著差异。因此并行成像可在L-R方向或A-P方向进行，但不能在S-I方向进行。右边的多元线圈阵列则没有此限制。 并行成像可能仅在L-R或A-P方向进行 并行成像也可能在所有方向进行 参考材料 Deshmane A, Gulani V, Griswold MA, Seiberlich N. Parallel MR imaging . J Magn Reson Imaging 2012;36:55-72. (review) Glockner JF, Hu HH, Stanley DW, et al. Parallel MR imaging: a user's guide . Radiographics 2005;25:1279-1297. 相关问题 什么是并行成像？与常规成像有什么不同？","tags":"Parallel-Imaging","title":"Question-并行成像的线圈和序列：并行成像是一种特殊的脉冲序列么？可以在任何线圈任何方向上进行么？"},{"url":"http://chunshan.github.io/MRI-QA/parallel-imaging/how-is-pi-different.html","text":"原文链接: Isn't parallel imaging (PI) just \"regular\" MRI using multiple receiver coils? 概要 并行成像和\"常规\"磁共振成像都会使用多个接收线圈，这一点上是相同的，但处理信息的方式完全不同。考虑如下两个接收线圈（#1 and #2）放置在头两侧的简单情况，正如预期的一样，从每个表面线圈接收到的信号在靠近线圈处最强，并随距离减弱。 在\"常规\"磁共振成像中，我们将结合来自每个表面线圈的数据产生全视野（full field-of-view）大脑的组合图像。这种安排会比只使用一个大的头线圈增加信噪比和空间分辨率，但不会提高成像速度。 并行成像中相位编码太少会导致卷折伪影，大脑左侧（b）卷折到右侧（a），反之亦然。此处相位编码方向是从左到右。 为了缩短并行成像的时间，需要减少相位编码步骤的数目。要使分辨率不变而成像时间减半，需仅能采集k空间行数的一半。但是这种策略导致采集到的空间频率不能充分表示要成像的物体。在重建的图像上视野减小并且出现\"卷折\"伪影。 使用单个表面线圈（#1 和 #2）采集到的数据也会出现卷折和视野减小，常规图像重建（如在\"常规\"MRI所做的）由于对伪影未进行校正会导致许多重叠的边缘和阴影。并行成像中最基础的问题是如何使用线圈本身的信息\"展开\"卷折的数据。 在频域中也存在等效的问题，如何估计k空间中缺失的行从而避免卷折伪影。 已经开发了两种基本策略用于校正并行成像中的重叠伪影。第一种方法（SENSE，ASSET）中，从单个线圈重建图像，然后在图像/空间域进行校正。第二种方法（GRAPPA，ARC）是在频率域进行操作，也就是在k空间中校正然后进行重建。 后续的Q&A中会介绍两种技术的细节。 参考材料 Deshmane A, Gulani V, Griswold MA, Seiberlich N. Parallel MR imaging . J Magn Reson Imaging 2012;36:55-72. (review) Glockner JF, Hu HH, Stanley DW, et al. Parallel MR imaging: a user's guide . Radiographics 2005;25:1279-1297. Larkman DJ, Nunes RG. Parallel magnetic resonance imaging . Phys Med Biol 2007;52:R15-R55 [review] 相关问题 我们的扫描仪中并行成像有两种不同的选择SENSE和GRAPPA。它们的原理是什么？应该选择哪一个？","tags":"Parallel-Imaging","title":"Question-并行成像（PI）-进一步的不同：并行成像（PI）难道不就是使用多个接收线圈的\"常规\"MRI么？"},{"url":"http://chunshan.github.io/MRI-QA/parallel-imaging/what-is-pi.html","text":"原文链接: What is parallel imaging? How does this differ from \"regular\" imaging? 概要 并行成像是广泛使用的技术，此技术使用已知放置位置和敏感度的接收线圈协助定位MR信号的空间位置。有了线圈的这些额外信息就可以在图像采集时减少相位编码步数，反过来，造成的潜在结果是成像时间成倍减少。 虽然特定的线圈数据如何转换为图像信息的细节有些复杂，但是并行成像的基本想法并没有这么复杂，实际上，并行成像的核心原理比频率编码和相位编码对大多数学生而言更容易掌握。 并行成像基本原理：使用线圈敏感度信息辅助空间定位。 例如，使用一组围绕头部的4个接收线圈探测如左图中所示的一个像素产生的磁共振信号。因为每个线圈到此像素的距离不同，每个线圈记录的信号都不同，是其位置的函数（近的线圈信号强）。仅通过观察每个线圈信号的相对强度，就可以对MR信号的近似源位置进行粗略估计。即使不使用相位，频率或傅里叶变换，我们已经可以知道信号来自大脑左顶叶的某处！ 在\"常规\"（非并行）成像中，也会使用多个表面线圈探测MR信号，但它们的单个输出组合成一个聚合的复杂信号，然后被数字化并被处理为最终的图像。相反，在并行成像中，来自单个线圈的信号被放大，数字化，并在各自的通道中同时（\"并行\"）处理，直到临近结束时仍保持它们的特性。 用于全身成像的并行线圈阵列（来自Siemens） 由于电子技术的进步显著降低了射频数字处理系统的成本，现代磁共振成像中并行成像已经成为现实。现在，磁共振厂商提供的商用系统能够支持2000+个线圈和128+个接收通道。 参考材料 Blaimer M, Breuer F, Mueller M, Heidemann RM, Griswold MA, Jakob PM. SMASH, SENSE, PILS, GRAPPA. How to choose the optimal method . Top Magn Reson Imaging 2004;15:223-236 [review]. Deshmane A, Gulani V, Griswold MA, Seiberlich N. Parallel MR imaging . J Magn Reson Imaging 2012;36:55-72. (review) Glockner JF, Hu HH, Stanley DW, et al. Parallel MR imaging: a user's guide . Radiographics 2005;25:1279-1297. Larkman DJ, Nunes RG. Parallel magnetic resonance imaging . Phys Med Biol 2007;52:R15-R55 [review] 相关问题 How does the scanner know the locations of all the MR signals? 并行成像是一种特殊的脉冲序列么？可以在任何线圈任何方向上进行么？","tags":"Parallel-Imaging","title":"Question-并行成像：什么是并行成像？与常规成像有什么不同？"},{"url":"http://chunshan.github.io/MRI-QA/rapid-imaging/hastess-fse.html","text":"原文链接: What is HASTE? 概要 HASTE是Siemens对平面回波的快速自旋回波序列的商标名。其扩展的缩写相当完整地描述了其内涵：Half-Fourier Acquisition Single-shot Turbo spin Echo imaging。 其他厂商也有相似的序列，但是名字略有不同：GE（Single-shot fast spin echo, SS-FSE），Philips（Single-shot turbo spin echo, SSH-TSE; ultra-fast spin echo, UFSE)， Hitachi (Single-shot fast SE)，Toshiba (Fast Advanced Spin Echo, FASE, SuperFASE)。 HASTE/SS-FSE是一种单次激发技术。这意味着k空间所有的数据都是来自一个90°激发脉冲，要求有很长的回波链，对现代扫描仪而言，可能达到128，256甚至更高。 相比之下，常规的FSE/TSE是一种多次激发技术，这意味着虽然k空间的填充比传统SE快很多，但仍然需要多次RF激发才能采集所有的数据。例如，如果需要在k空间中采样128行，ETL（Turbo factor）为16的FSE/TSE序列需要128/16 = 8次激发才能完整地收集数据。 为了最小化k空间中采样的行数，HASTE/SS-FSE利用k空间的相位共轭对称性（一种部分傅里叶方法），仅直接采集比k空间的一半儿多一点儿的数据，其余行的数据可以利用k空间的\"镜像\"性质估计出来。一个典型的HASTE/SS-FSE脉冲序列时序图如下所示。 代表性的HASTE/SS-FSE脉冲序列。注意到相位编码方向非对称采样，k空间一侧外围的行没有采集而是使用共轭对称性进行估计。 HASTE/SS-FSE技术的应用已经遍及全身，包括常规的定位像，儿童或不配合患者的头或身体的图像，胎儿成像，非屏气的腹部成像，磁共振胆胰管成像，磁共振脊髓造影，非增强的磁共振血管造影。不可避免的，回波时间相对长，HASTE图像通常是T2加权的，然而，与预备的反转脉冲相结合，也可以生成某种程度上T1加权或质子密度加权的对比度。下面是几个代表性的例子。 参考材料 Patel MR. Klufas RA, Alberico RA, Edelman RR. Half-Fourier acquisition single-shot turbo spin-echo (HASTE) MR: Comparison with fast spin-echo MR in diseases of the brain . AJNR Am J Neuroradiol 1997; 18:1635-1640. 相关问题 How does phase-conjugate symmetry work? Why is it used?","tags":"Rapid-Imaging","title":"Question-HASTE/SS-FSE：什么是HASTE？"},{"url":"http://chunshan.github.io/MRI-QA/rapid-imaging/echo-planar-imaging.html","text":"原文链接: What is echo-planar imaging (EPI)? Is this the same as Fast Spin Echo (FSE)? 概要 梯度和数字化数据采集技术的进步使得50-100ms内获取一帧MR图像成为可能，从而最大限度减少患者运动的影响。一般来讲，这种采集模式称为平面回波成像（EPI，Echo-Planar Imaging）。 虽然EPI看起来像一个新的发展，实际上此技术是MRI中空间定位最早的方法之一，由Mansfield在1977年首先提出。Mansfield组在1981年产生第一幅跳动兔子心脏的生物学EPI图像，在1983年产生第一幅婴儿心脏图像。 MBEST是他们的一个早期EPI技术，在1980年代比较流行，如下图所示。一个自旋预备模块（可以就是一个简单的射频脉冲）之后，一个强切换频率编码梯度与一个间歇性的\"尖峰状\"低幅值相位编码梯度同时施加。随着每一个读出（频率）梯度的震荡采集梯度回波（GREs）。 MBEST(Modulus-blipped echo-planar single-pulse technique)，早期EPI序列之一。 MBEST中k空间的zig-zag遍历。频率编码沿水平轴，相位编码沿垂直轴。 最终的结果是对k空间的\"zig-zag\"遍历，第一个向下的频率和相位编码叶将最初的负相位偏移施加给所有的自旋，将信号从k空间中心移到左下角的一点，之前我们定义此点为（-kxmax，-kymax）。后续正的和负的频率编码叶分别从左到右和从右到左横扫k空间。同时，尖峰状的低幅值相位编码梯度脉冲产生沿ky轴的一个逐步阶跃增加。 如最初定义的那样，平面回波成像指的是整个2D平面k空间所有的数据是在一个RF激发脉冲之后采集的。最近，这个词已经扩展到包括任何快速梯度回波或自旋回波序列，只要k空间是在一个或少数几个激发后遍历的。使用现代的称呼，分别是单次激发EPI和多次激发EPI。 不同的厂商对这些概念定义了不同的术语，GE和Toshiba把一次激发中采集的k空间线（回波）的数目称为回波链长度（ETL，Echo Train Length），Siemens和Philips称之为\"EPI factor\"，Hitachi称为\"shot factor\"。多次激发序列中一次激发划分的k空间区域称为段（segment），因此，通常将每段所含的线（或视图）作为k空间覆盖力度的一个度量。 从广义上说，有非常高的turbo factor/ETL的快速自旋回波序列也可以认为是多次激发EPI序列。HASTE/SS-FSE技术就是一个例子。 参考材料 Mansfield P. Snap-shot MRI . Nobel Lecture, 8 Dec 2003 from www.nobelprize.org Mansfield P. Multi-planar image formation using NMR spin echoes . J Phys C: Solid State Phys 1977; 10:L55-L58. Ordidge R. The development of echo-planar imaging (EPI):1977-1982. Magn Reson Mater Phys Biol Med 1999;9:117-121. Poustchi-Amin M, Mirowitz SA, Brown JJ, et al. Principles and applications of echo-planar imaging: a review for the general radiologist . Radiographics May, 2001 (online only). Redzian R, Mansfield P, Doyle M, et al. Real-time nuclear magnetic resonance clinical imaging in paediatrics . Lancet 1983; 322:1281-2. (First human EPI image). Stehling MK, Turner R, Mansfield P. Echo-planar imaging: magnetic resonance imaging in a fraction of a second . Science 1991; 254:43-50. 相关问题 Who invented MR imaging? 什么是HASTE？","tags":"Rapid-Imaging","title":"Question-平面回波成像（EPI）：什么是平面回波成像（EPI）？与快速自旋回波是一回事么？"},{"url":"http://chunshan.github.io/MRI-QA/rapid-imaging/spacecubevista.html","text":"原文链接: What are the SPACE/CUBE/VISTA techniques? 概要 T2-FLAIR-CUBE大脑图像 它们是密切相关的快速自旋回波技术，做了一些特殊的修改实现各向同性3D成像的最优化。各向同性指的是3D采集产生的体素在每个方向上尺寸一致，比如0.6mm x 0.6mm x 0.6mm，使得图像在任何一个方向上重建时有相同的分辨率。 CUBE仅是GE此序列的名字而不是简称，VISTA是Philips的版本，是\"Volume ISotropic Turbo spin echo Acquisition\"的简写，Hitachi的名字是isoFSE，Toshiba则成为3D MVOX（\"MultiVOXel\"），Siemens的名字可能最有创意，SPACE（\"Sampling Perfection with Application optimized Contrasts using different flip angle Evolution\"）。 厂商之间对此技术的具体实现各有不同，但有如下通用的元素： * 3D快速自旋回波采集 * 很长的回波链长度，通常100-250个回波 * 超短的回波间隔，通常3-4ms * 非选择性地回聚脉冲 * 减小的翻转角（可能是常数但通常是可变的，一般30°-120°，减少组织发热） * 1D或2D并行采集减少成像时间 * 使用零填充的部分傅里叶成像减少成像时间 * 使用最优化/有效的k空间采样轨迹，包括信号演变过程中在平面内和平面间的相位编码方向上同时采样 * 能够产生T1加权，T2加权，质子密度加权或FLAIR图像 * 合理的成像时间（5-10min） SPACE/CUBE/VISTA技术已经被证明在广泛的临床应用中都有价值，主要可以分为两大类： 复杂解剖结构（大脑，内耳，关节，MRCP）所需的高分辨率，连续，薄层各项同性图像 部分2D采集（脊柱，盆腔）的替代 SPACE MR膝关节检查，使用3D数据集进行多平面可交互的重建 高级讨论 SPACE/CUBE/VISTA技术的补充解释 虽然回聚脉冲一般是非选择性的，激发脉冲可以是非选择性地也可以是层面选择性的。 有时候会一起使用部分信号平均与相位循环减少伪影。为了减少测量时间，可能会使用不均匀数目的信号平均，换句话说，仅针对k空间中心部分的线进行平均。 图像对比度与标准FSE/TSE序列中并不完全一致，总体而言，有效回波时间（TEeff）需设置为比标准FSE的长20%才能获得相同水平的T2加权。 SPACE/CUBE/VISTA与很多协议都有兼容性，包括T1，T2，PD，T1-FLAIR，T2-FLAIR，双IR和相位校正的IR技术。 参考材料 Busse R. 3D FSE reduces scan time, generates thinner slices . Signa Pulse, A GE Healthcare MR Publication, Autumn, 2007, pp 34-5. Kitajima M, Hirai T, Shigematsu Y et al. Comparison of 3D FLAIR, 2D FLAIR, and 2D T2-weighted MR imaging of brain stem anatomy . AJNR Am J Neuroradiol 2012; 33:922-927. Mugler JP III. Optimized three-dimensional fast-spin-echo MRI . J Magn Reson Imaging 2014; 39:745-767. 相关问题 什么是快速自旋回波成像？","tags":"Rapid-Imaging","title":"Question-3D FSE：什么是SPACE/CUBE/VISTA技术？"},{"url":"http://chunshan.github.io/MRI-QA/rapid-imaging/hyperechoes.html","text":"原文链接: What are \"hyper-echoes\" and how do they differ from regular echoes? 概要 强回波是高幅值的受激回波，当射频脉冲以特定的一种对称次序排列时就会产生。这个概念是由弗莱堡大学医院的Juergen Hennig提出的，在一些Siemens机器中作为快速自旋回波的一种选择。 快速自旋回波序列中RF脉冲特定的排列如下图所示。脉冲链的中心是180°脉冲，两侧的脉冲呈镜像排列，极性和相位相反。180°脉冲后的反对称脉冲完全撤销了180°脉冲前的脉冲造成的复杂的旋转，使得强回波在期望的回波时间处出现。强回波有与常规自旋回波几乎相同的幅值，没有任何干扰脉冲。 令人惊讶的是，只要对称关系保持，不管单个脉冲的翻转角和相位偏移，强回波都会出现。强回波在快速自旋回波链中可以重复出现几次，通常会使强回波的出现与最低阶的相位编码步骤相匹配，使信噪比最大。虽然目前强回波主要与快速自旋回波序列结合使用，但也有用于弥散加权成像，梯度回波成像和磁共振波谱的潜力。 参考材料 Frank LR, Wong EC, Liu TT, Buxton RB. Increased diffusion sensitivity with hyperechos . Magn Reson Med 2003; 49:1098-1105. Hennig J, Weigel M, Scheffler K. Multiecho sequences with variable refocusing flip angles: optimization of signal behavior using smooth transitions between pseudo steady states (TRAPS) . Magn Reson Med 2003;49:527–535. Hennig J, Scheffler K. Hyperechoes . Magn Reson Med 2001;46:6–12. Mugler JP III. Optimized three-dimensional fast spin echo MRI . J Magn Reson Imaging 2014;39:745-767. (Excellent up-to-date review). Weigel M., Hennig J. Contrast behavior and relaxation effects of conventional and hyperecho-turbo spin echo sequences at 1.5 and 3T . Magn Reson Med 2006;55:826-35. 相关问题 为什么想要在FSE中减小翻转角？小翻转角难道不会使MR信号消失么？","tags":"Rapid-Imaging","title":"Question-强回波：什么是\"强回波\"？与普通回波有什么不同？"},{"url":"http://chunshan.github.io/MRI-QA/rapid-imaging/reduced-flip-angle-fse.html","text":"原文链接: Why would you want to use reduced flip angles in FSE? Wouldn't smaller flip angles kill the MR signal? 概要 快速自旋回波的一个主要限制是组织过度发热，这是FSE设计中180°脉冲密集使用必然带来的后果。RF脉冲产生的能量沉积正比于翻转角的平方（α²），因此，180°脉冲沉积的能量是90°脉冲的4倍。 RF翻转角从180°减小到50°-150°的范围，热能量沉积可以显著减少，但小翻转角不也会造成MR信号减小么？答案是yes，但可能没有想象中那么多。 当RF翻转角减小到180°以下，每一个回波的磁化矢量不再单纯回聚于横向平面。磁化强度的相当一部分\"存储\"在纵向方向，通过T1弛豫机制增长。回波链中连续的每一个非180°脉冲都会将磁化强度分解为纵向和横向分量，这些存储的纵向分量会不断产生受激回波，而且对磁共振信号的贡献逐渐变大，此时磁共振信号既依赖于T1也依赖于T2。受激回波使得当翻转角变小时获得的信号比预期要大。 对一组具有相同翻转角（α <180°）的回聚脉冲，系统最初会振荡但是横向磁化会达到一种伪稳态（PSS，pseudo-steady state），与全部为180°脉冲相比造成信号幅值减小至约sin(α/2)倍。因此，如果使用100°脉冲而不是180°脉冲，FSE信号将减少至其最大值的sin(50º) ≈ 77%。一旦稳态建立，PSS的水平随着FSE回波链中翻转角的变化而变化。这项技术可简写为TRAPS（TRansition between Pseudo-steady States），并说明如下。 减小翻转角FSE成像的三种方法。第一种情况，全部使用100°RF脉冲使得几个震荡后出现伪稳态（PSS）。第二种情况在序列一半时增加翻转角到120°使伪稳态发生转换。第三种情况开始处使用预备脉冲，然后使用倾斜变化的翻转角。由此产生的理论信号强度在下面显示（忽略T1和T2效应）。 对减小翻转角方法的其他几种改进会使得平均信号更高，能量沉积更低。在序列开始之前使用一组5-10个预备或\"启动\"脉冲可以显著增加PSS的初始水平。另外一种修改是使翻转角呈线性或正弦斜坡沿回波链从小到大。在回波链的早期使用最小的翻转角，此时纵轴储存了磁化强度的很大一部分，这些储存的磁化强度会使得在回波链的后面产生更强的信号。在最低阶的相位编码步骤中应用最大的翻转角，因为此时的信号决定整体的MR信号和基本的图像对比度。第三种修改是使用对称的强回波，这是 下面一个Q&A 的主题。 参考材料 Alsop DC. The sensitivity of low flip angle RARE imaging . Magn Reson Med 1997;37:176–184. Busse RF, Brau ACS, Vu A, et al. Effects of refocusing flip angle modulation and view ordering in 3D fast spin echo . Magn Reson Med 2008;60:640-649. Hennig J, Weigel M, Scheffler K. Multiecho sequences with variable refocusing flip angles: optimization of signal behavior using smooth transitions between pseudo steady states (TRAPS) . Magn Reson Med 2003;49:527–535. Mugler JP III. Optimized three-dimensional fast spin echo MRI . J Magn Reson Imaging 2014;39:745-767. (Excellent up-to-date review). 相关问题 什么是\"强回波\"？与普通回波有什么不同？ What is a stimulated echo?","tags":"Rapid-Imaging","title":"Question-减小翻转角的FSE：为什么想要在FSE中减小翻转角？小翻转角难道不会使MR信号消失么？"},{"url":"http://chunshan.github.io/MRI-QA/rapid-imaging/driven-equilibrium.html","text":"原文链接: What is a driven equilibrium (fast recovery) pulse? 概要 驱动平衡技术使胆汁在FSE的MRCP图像（短TR，1200ms）上显示高信号。 驱动平衡（DE，Driven Equilibrium）也称为快速恢复，是一种使用-90°\"翻转回来\"的脉冲在MR序列结束时帮助恢复纵向磁化的技术。快速成像中，长T1和长T2的物质（如脑脊液，尿液和胆汁）在一个TR间隔的后期其纵向磁化（Mz）可能仍然没有完全恢复。经过几个周期就会发生饱和，这些液体正常的高T2信号会降低，驱动平衡技术恢复这些信号特别有用，广泛用于脊柱成像，磁共振尿路造影术和胰胆管造影术（MRCP，Magnetic Resonance Cholangiopancreatography）。 如左图中所示，长T1和长T2的液体在一个周期结束时仍有明显的横向磁化，通过使用-90°脉冲，此横向磁化翻转回纵向平面，辅助T1恢复，增强MR信号。 驱动平衡脉冲实际上可与任何成像或波谱序列结合使用，但最常用于快速自旋回波成像中。所有主要的MR厂商都提供了此种序列，但有不同的商品名：Siemens称为RESTORE，GE称为FRFSE（快速恢复的快速自旋回波，Fast Recovery Fast Spin Echo），Philips称为DRIVE，Hitachi称为驱动平衡FSE，Toshiba称为T2 Plus FSE。偶尔也会使用通用的简写DEFT（Driven Equilibrium Fourier Transform），一个典型的2D快速自旋回波如下所示。 FSE序列结束时使用-90°的驱动平衡脉冲 DE模式的一簇三个非选择性脉冲（+90°/180°/-90°）可用作波谱，EPI和GRE序列（如MP-RAGE）的准备模块。因为在这些脉冲之间会发生T2衰减，使用此模块可以得知T2敏感性，因此常被称为T2准备脉冲（T2-pre pulse）。 高级讨论 因为DE脉冲的翻转角可能与理想值略有不同，会使用围绕180°脉冲的破碎梯度（crusher gradients）和\"翻转回来\"90°脉冲之后的扰相梯度（spoiler gradients）干扰残留的横向磁化。 参考材料 Becker ED, Ferretti JA, Farrar TC. Driven equilibrium Fourier transform spectroscopy. A new method of nuclear magnetic resonance signal enhancement . J Am Chem Soc 1969;91:7784-5. (This was the first use of a DE pulse — to improve the signal in NMR spectroscopy) Melhem ER, Itoh R, Folkers PJM. Cervical spine: three-dimensional fast spin-echo MR imaging − improved recovery of longitudinal magnetization with driven equilibrium pulse . Radiology 2001; 218:283-288. (Good description of how DE pulses can be used to augment CSF signal in 3D FSE imaging). van Uijen CM, den Boef JH. Driven-equilibrium radiofrequency pulses in NMR imaging . Magn Reson Med 1984;1:502-7. (One of the earliest implementation of DE pulses for imaging). 相关问题 什么是快速自旋回波成像？","tags":"Rapid-Imaging","title":"Question-驱动平衡：驱动平衡（快速恢复）脉冲是什么？"},{"url":"http://chunshan.github.io/MRI-QA/rapid-imaging/dual-echo-fse.html","text":"原文链接: How does a dual-echo FSE sequence work? It seems there is not enough room for the two sets of echoes. 概要 双回波FSE。TR = 3000ms，TEeff 分别为17和85ms，分别产生质子密度和T2加权像。 磁共振进入临床的前20年，双回波序列是几乎所有身体部位标准协议的一部分。使用长重复时间（TR），短和长回波时间（TE）时分别采集回波信号实现在一次采集中产生质子密度和T2加权像。在过去的10年里，对于神经成像而言T2-FLAIR很大程度上取代了质子密度序列，但是双回波序列在肌肉骨骼和身体其他应用中仍然有用。 双回波FSE图像可以通过一个称为视图共享的过程得到。在FSE回波链的早期和后期都进行零和低振幅相位编码，这会产生有效TE分别为短和长（通常TE1eff <20 ms，TE2eff >80 ms）的两套低空间分辨率图像，分别反映质子密度加权和T2加权占主要对比度。剩余的包含边缘细节的中等和高幅值相位编码产生的信号被两套数据集共享，用于最后的图像重建。 参考材料 Johnson B, Fram EK, Drayer BP, et al. Evaluation of shared-view acquisition using repeated echoes (SHARE): a dual-echo fast spin-echo MR technique . Am J Neuoradiol 1994;15:667-673. Mekle R, Laine AF, Wu EX. Combined MR data acquisition of mulitcontrast images using variable acquisition parameters and k-space data sharing . IEEE Transact Med Imaging 2003; 22:806-823. 相关问题 什么是快速自旋回波成像？","tags":"Rapid-Imaging","title":"Question-双回波FSE：双回波FSE序列如何工作？似乎没有足够的空间放置两套回波。"},{"url":"http://chunshan.github.io/MRI-QA/rapid-imaging/other-fse-differences.html","text":"原文链接: Besides bright fat, are there other differences in image properties between conventional spin echo and fast spin echo imaging? 概要 FSE/TSE图像上除了明显明亮一些的脂肪信号，与传统自旋回波成像相比，对比度上还有其他一些微小的差别。这些差别包括：1）对磁敏感的敏感性降低；2）磁化转移效应增强；3）边缘和对比度效应。 传统自旋回波（上）和快速自旋回波（下），TR/TE(eff)均为3000/80. 由红核处铁导致的磁敏感效应（箭头处）在CSE图像上更显著。 对磁敏感的敏感性降低 说明这种现象的一个例子是常规T2加权的大脑图像（右）。场强为1.0T或更高时，通常在基底节，黑质，红核可见低信号，因为这些结构的细胞内都有铁沉积。微观的铁沉积导致局部磁场扭曲，称为磁化率梯度。当水分子扩散通过这些梯度时，自旋失相位加速并且T2*缩短，降低了磁共振信号。 信号损失的程度取决于扩散的水在不均匀磁场中被180°脉冲重聚焦之前花费的时间。在CSE中，再回聚的时间由回波时间（TE）决定，一般50ms或更长；然而在FSE中，180°回聚脉冲间隔时间很短，由ESP（回波时间间隔，通常5-10ms）决定，由磁敏感性导致的失相位时间更短。 与CSE图像（左）相比，FSE图像（右）上暗出血灶能见度降低（来自Reimer等，经过许可） 磁敏感性降低使得FSE成为外科手术硬件或金属异物存在时首选序列，可以显著降低伪影。然而，当需要检测组织中磁敏感性的变化进行诊断时，这个优势有时也会变为劣势，如钙化或出血的检测。 磁化转移效应增强 如在 前面一个Q&A中 所描述的，磁化转移是自由水的自旋与结合水和生物大分子的自旋交换能量的过程。FSE中的多个180°回聚脉冲使得大分子偏共振饱和，其饱和过程是渐进的。在脑组织的大分子中，有T2非常短的髓磷脂和膜磷脂，它们不直接成像。随着脉冲数目的增加，磁化转移效应变得更加显著，特别是白质明显变暗，灰质也有小的信号损失。相反，脑脊液和脂肪的信号不会被抑制，这些物质看起来比大脑组织更亮。 磁化转移效应体现在随着ETL的增加，白质信号不断降低 边缘和对比度效应（k空间滤波） 如上面的例子说明的，FSE和CSE相似但脉冲序列的结构并不相同，即使使用相同的TR，而且TE=TEeff，不同组织的相对信号强度也会不一样。我们已经描述了几种物理现象（J偶联的瓦解，对磁敏感性的灵敏度降低和磁化转移），能够解释其中的一些差异。 k空间滤波。k空间中的每一条线在T2衰减曲线的不同点山采集，意味着图像对比度在采集期间不断变化 另外一个重要的现象（适用于FSE和所有的快速/平面回波技术）称为k空间滤波。基本思想是T2衰减发生在每个TR间隙k空间的线被填充时，每一个回波在T2衰减曲线不同的时间点上被采集。因此，k空间中线的加权并不一致，图像对比度在采集期间不断变化。 图像的整体对比度由k空间中心（TEeff）附近采集的数据决定，k空间外围早期或后期的回波反应高空间频率信息。这些外围的线在不同的TE值时采集得到，其信号强度受T2衰减的调制，会导致图像的模糊。采集的回波越多（ETL越长），模糊效应越明显。 当TEeff比较短时空间模糊效应最明显，因为提供边缘细节的高阶相位编码步骤使用回波链后期的回波进行填充。因此，T1和质子密度加权像的模糊效应最明显。一个好的临床引例是FSE的质子密度加权像上轻微的膝盖半月板撕裂可能会被模糊掉，从而影响临床诊断。 流体（如CSF）的T2弛豫时间比较长，因此早期和后期回波的信号强度变化相对比较小，T2长的物质在T2加权的FSE成像中由k空间导致的模糊几乎不是问题。但是对多数固体组织，T2比较短，早期和后期回波的信号强度差异比较大，T2加权的FSE图像上固体短T2组织的空间模糊更显著。这样的模糊可能会导致不能检测T2值与周围背景接近的小物体或者小病变。 当长T2和短T2组织共存时，就会发生一种称为伪边缘增强的反常现象。伪边缘增强通常见于腰椎轴状位T2加权的FSE图像，表现为围绕神经根的白色\"光环\"。 下面说明其机制，并且展示神经根和脑脊液（CSF）被模糊（改变了图像的点扩散函数）的结果。CSF固有的T2比较长，没有显示多少模糊，而神经根（T2比较短）的模糊比较明显。神经根模糊的信号溢出到相邻高信号的CSF，增加了附近的亮度。即使没有可见的光环，伪边缘增强解释了FSE图像上硬膜囊的神经根为什么如此锐利。 伪边缘增强导致腰椎神经根周围出现白色光环（箭头处）。 参考材料 Garyun BB, Major NM, Helms CA. Comparison of fast spin-echo versus conventional spin-echo MRI for evaluating meniscal tears . Am J Roentgenol 2005; 184:1740-1743. Jones KM, Mulkern RV, Mantello MT, et al. Brain hemorrhage: evaluation with fast spin-echo and conventional dual spin-echo images . Radiology 1992;182:53-58. Reimer P, Allkemper T, Schuierer G, Peters PE. Brain imaging: reduced sensitivity of RARE-derived techniques to susceptibility effects . J Comput Assist Tomogr 1996;20:201-205. Tartaglino LM, Flanders AE, Vinitski S, et al: Metallic artifacts on MR images of the postoperative spine: Reduction with fast spin-echo techniques . Radiology 1994;190:565-569. Thomas DL, De Vita E, Roberts S, et al. High-resolution fast spin-echo imaging of he human brain at 4.7T: implementation and sequence characteristics . Magn Reson Med 2004;51:1254-1264. 相关问题 What is magnetization transfer?","tags":"Rapid-Imaging","title":"Question-CSE图像 vs FSE图像：除了明亮的脂肪信号，传统自旋回波和快速自旋回波之间图像属性上还有什么不同么？"},{"url":"http://chunshan.github.io/MRI-QA/rapid-imaging/bright-fat.html","text":"原文链接: Why is fat bright on fast spin echo images? 概要 传统自旋回波图像（左）和快速自选回波图像（右），TR/TE(eff)都是3000/80。注意到FSE上头皮脂肪信号更亮。 二十世纪九十年代当快速自旋回波（FSE， Fast Spin-Echo）序列技术首次投入使用时，与传统自旋回波（CSE， Conventional Spin-Echo）技术相比最显著的不同是FSE图像中可见\"异常\"明亮的脂肪信号。这种现象如右图所示。 虽然有几个因素都会导致FSE上的\"明亮脂肪\"现象，占主导地位的机制一般认为是继发于J偶联相互作用瓦解后的T2延长，此现象通常发生在相邻脂肪质子之间。 我知道这个声明需要一些更进一步的背景和解释，所以请看一下下面的讨论！ 组织中的脂肪主要以长链甘油三酯的形式存在，每个甘油三酯分子中含有1打不同类型的¹H原子分布于不同化学环境中，这些长链中相邻的原子核通常会通过它们之间电子云的扭曲而相互作用，这个过程称为J偶联。 典型的甘油三酯（脂肪）分子的结构 相邻质子之间的J偶联相互作用是一种量子衍生效应，由电子云的扭曲介导。 J偶联相互作用的强度用因子J进行量化，J表示脂肪中不同质子的谐振频率偏移，值在6-8Hz的范围内。这种小的频率偏移意味着脂肪中不同的质子以稍微不同的频率进动。它们的信号彼此之间以循环的方式不断进行建设性和破坏性的干涉（这类似于更熟悉的水-脂肪化学位移干涉，在此单独的Q&A中有描述，不同的是这儿仅涉及脂肪中的质子而且与场强无关）。第一个失相位的干涉发生在TE=1/2J处，大约60-80ms。 需要指出的是TE为60-80ms在常规自旋回波成像中通常用于产生T2加权像。选择此范围中的TE，由于J偶联效应的影响，记录的脂肪信号实际会低一些，看起来像是选择了更短或更长TE的结果。 某种意义上应该说，T2加权的常规自旋回波成像中的脂肪异常暗，而不是快速自选回波成像中的脂肪异常亮。 FSE成像中，发生在回波间隔处的多个180°脉冲在10ms的量级，打破了J偶联失相位的模式，虽然J偶联造成的相位偏移不会被180°脉冲回聚。完全理解这一过程需要了解量子力学的知识，远远超出了本网站的范围。然而，这个过程可以从如下角度理解，多个180°脉冲施加的间隔如果比1/J短，会使得所有的J偶联自旋化学上\"等效\"，导致结果信号不再受偶联调制。因此，FSE成像上的脂肪看起来比CSE图像上的脂肪更亮。 高级讨论 虽然大多数专家认为J偶联机制瓦解是造成明亮脂肪信号的首要原因，其他因素可能也很重要。Henkelman等曾指出自旋在局部磁场敏感性不同的区域（水和脂肪）弥散时，紧密间隔的RF脉冲减少了弥散导致的失相。由多个RF脉冲导致的受激回波也会在明亮脂肪效应中占约10%的作用。Mulkern等也指出脂肪信号相对增加的程度具有场依赖性，1.5T时比更高或更低场强时更加突出。因为J偶联是不依赖于场强的，这意味着存在其他与场强相关的机制。 但其实任何情况下，我都怀疑这个问题对现代的MR用户而言是否仍然是个问题。FSE成像已经在MRI的各个方面很大程度上取代CSE。FSE图像上的脂肪不再看起来\"异常\"亮，因为FSE已经成为\"新常态\"。可能这个讨论现在更多是对MRI历史上的兴趣。但FSE上脂肪明亮的现象却可以解释我们为什么通常在T2加权像上要进行脂肪抑制，而在\"旧时代\"CSE的T2加权像一般不进行脂肪抑制。 参考材料 Henkelman RM, Hardy PA, Bishop JE, Poon CS, Plewes DB. Why fat is bright in RARE and fast spin-echo imaging . J Magn Reson Imaging 1992; 2: 533-540. Mulkern RV, Packard AB, Gambarota G. Field dependence of the bright fat effect in fast spin echo imaging: theory and experiment . Proc Intl Soc Mag Reson Med 2003; 11:1107. Stables LA, Kennan RP, Anderson AW, Gore JC. Density matrix simulations of the effects of J coupling in spin echo and fast spin echo imaging . J Magn Reson 1999;140:305-314. Stokes AM, Feng Y, Mitropoulos T, Warren WS. Enhanced refocusing of fat signals using optimized multipulse echo sequences . Magn Reson Med 2013;69;1044-55. 相关问题 什么是快速自旋回波成像？","tags":"Rapid-Imaging","title":"Question-FSE中明亮的脂肪：为什么脂肪在快速自旋回波序列的图像中是明亮的？"},{"url":"http://chunshan.github.io/MRI-QA/rapid-imaging/fse-parameters.html","text":"原文链接: How do you select parameters for fast spin echo imaging? There are several new ones to set. 概要 传统自旋回波成像（Conventional Spin-Echo，CSE）中，仅需指定两个基本的时间参数，重复时间（TR）和回波时间（TE）。在快速自选回波（Fast/Turbo Spin-Echo，FSE/TSE）成像中，简单TE被有效回波时间（TEeff）代替，有效回波时间是填充k空间中中心线的时间。因此需要两个额外的新参数： * 回波数量 -- GE和Toshiba称之为回波链长度（ETL），Siemens和Philips称之为Turbo因子，Hitachi称为Shot因子； * 回波之间的时间 -- GE，Philips，Siemens和Toshiba称为Echo Spacing（ESP），Hitachi称之为Inter Echo Time（ITE）。 随着ETL增加T2权重增加。所有图像TR=4000并且其它参数一致。 回波链长度（ETL，Echo Train Length）是最重要的一个参数。一般来说，图像采集时间与ETL成反比。换句话说，固定TR/TE/空间分辨率，如果一个传统自旋回波序列采集时间需要8分钟，ETL=8的快速自选回波序列只需要1分钟。 ETL还对图像质量有重要影响，ETL越长，T2加权效应越明显，因为TE越长，会有更多后期的回波对整体信号产生贡献。 ETL越长还会导致整体信噪比（SNR，Signal-to-Noise Ratio）和对比度噪声比（CNR，Contrast-to-Noise Ratio）下降，因为后期的回波较弱。 TE非常长的情况下，后期产生的回波会带来更多的空间模糊。空间模糊效应来自于晚期回波上T2相关的信号损失。这些回波是在高阶相位编码情况下采集的，高阶相位编码对应于图像中的高空间频率和细节。 给定TR间隔内采集覆盖一个解剖区域所需的层数也是ETL选择时需考虑的一个因素。回忆一下传统的二维傅里叶变换（2D FT）自旋回波成像中，每一个TR间隔末期的\"死时间\"并没有浪费，在多层采集中，这段时间被用于激发其它片层（如果需要温习一下，可以看一下 之前的Q&A ）。FSE成像中，对于一个给定的TR，需要权衡ETL和能够采集的片层数。如果ETL太大，可能需要两次单独的FSE采集（双倍的成像时间）才能包含所需的层数。 增加回波间隔（ESP，Echo Spacing）使得TE更长，但是给SNR和CNR带来不利的影响，运动，磁敏感性和边缘相关的伪影增加。一般来说，增加ESP主要是给图像质量带来有害的后果，在大多数应用中应该选择所允许的最短的ESP。 如果将FSE的图像对比度与传统的自旋回波技术相类比，可以使用期望的TE值，将传统自旋回波在低阶相位编码采集的数据聚合在一起。这种对比是行得通的，因为图像的全局对比度主要是由k空间中心处低阶相位编码采集的信号决定（高阶相位编码步骤主要对边缘有贡献）。因此，尽管回波链中的每个回波用不同的TE采集，有效TE（决定图像整体对比度）是由进行低阶相位编码时的TE决定，一般选择在回波链的中间，但是在特殊的应用中也会往前移或者往后移。 参考材料 Constable RT, Smith RC, Gore JC. Signal-to-noise and contrast in fast spin echo (FSE) and inversion recovery FSE imaging . J Comput Assist Tomogr 1992; 16:41-47. Li T, Mirowitz SA. Fast T2-weighted MR imaging: impact of variation in pulse sequence parameters on image quality and artifacts . Mag Reson Imaging 2003;21:745-753. Sze G, Kawamura Y, Negishi C, et al. Fast spin-echo MR imaging of the cervical spine: influence of echo train length and echo spacing on image contrast and quality . AJNR Am J Neuroradiol 1993; 14:1203-13. 相关问题 什么是快速自旋回波成像？","tags":"Rapid-Imaging","title":"Question-FSE参数：你如何选择快速自选回波的成像参数？有几个新参数需要设置。"},{"url":"http://chunshan.github.io/MRI-QA/rapid-imaging/what-is-fsetse.html","text":"原文链接: What is Fast (Turbo) Spin Echo imaging? 概要 快速自旋回波（Fast Spin Echo， FSE）成像也称为TSE（Turbo Spin Echo），是RARE（Rapid Acquisition with Refocused Echoes）技术的商业化实现，最早是Hennig等在1986年提出的。从那时起，FSE/TSE就成为现代磁共振成像中的一个\"主力\"脉冲序列。 FSE/TSE脉冲序列（如上所示）表面上类似于传统自旋回波（conventional spin-echo，CSE）序列，在一个90°脉冲后使用一系列180°聚焦脉冲产生一连串回波。可简单记为： * CSE: 90º−180º−echo………………………………………………………90º−180º−echo * FSE: 90º−180º−echo−180º−echo−180º−echo−180º−echo……………90º−180º−echo 然而，FSE/TSE技术会对每一个回波改变相位编码梯度（传统的多回波序列使用相同的相位编码采集所有的回波）。回波之间改变相位编码梯度的结果是给定的重复时间（TR）内可以采集k空间中的多条线（如相位编码步骤）。 由于每个TR间隔内可以采集多条相位编码线，FSE/TSE技术可以显著减少成像时间。 给定TR间隔内采集的回波数目称为回波链长度（Echo Train Length，ETL）或者涡轮因子。ETL在常规扫描中的典型范围是4到32，但是在快速成像/平面回波技术中，可能会超过200。 如果层数不是限制因素，成像时间反比于ETL，即使用相同的TR，ETL=8的FSE/TSE序列所需时间仅是传统SE序列的八分之一。 除了速度之外，FSE技术还有其它的优势。首先，k空间扫描多条线节省的大量时间可用于延长TR，使得纵向磁化的恢复时间更长，从而提高信噪比。其次，可以使用更多的相位编码步骤，提高空间分辨率。最后，磁敏感导致的信号损失减少，使得FSE在对颅底和金属周围物体成像时优于CSE。 然而，FSE能够降低磁敏感伪影也可能是其缺点，使得FSE图像不太可能检测小面积的钙化或出血。FSE的其他局限性包括T2加权像上脂肪信号过于明亮，质子密度加权像上CSF信号过于明亮。多个180°脉冲会导致组织发热增加，也会限制FSE在婴儿及小孩儿中的使用。 高级讨论 关于FSE/TSE序列的附加说明 虽然上面的脉冲图与后面的讨论都集中在笛卡尔/直线轨迹上，其实FSE/TSE可以用于几乎所有的k空间采样策略，包括螺旋（Spiral），径向（Radial），圆形（Circular）和螺旋桨（PROPELLER）方法。 FSE/TSE可用于2D或3D模式中。2D采集中，多个层面几乎都采用隔行扫描的方式，因为TR一般比序列长度要长。FSE/TSE技术节省的时间首次使得3D采集称为可能。 在上面的FSE/TSE脉冲序列图中，你可能已经注意到每一个正相位编码梯度总是与回波后一个立刻施加的负相位编码梯度成对出现，这会将每个步骤的相位回退，使得k空间中的每一行都从相同的方向开始遍历。 回聚脉冲不需要是准确的180°，为了减少组织中的能量沉积（特定吸收率-Specific Absorption Rate/SAR），会产生一些有趣的现象称为\"强回波（hyperechoes）\"，在后面的一个Q&A中会讲到。 不管使用何种翻转角度的回聚脉冲，FSE/TSE序列的信号包含来自最近的一对RF脉冲的主要的自旋回波信号，也包含来自前面多个RF脉冲组合作用的受激回波。回波链中特定相位编码值的分布决定了图像的对比度，影响图像的伪影。通常最好是以阶梯模式缓慢改变回波之间的相位，从而减少由于k空间不连续导致的伪影。不同的厂商做法并不相同，可以看一下下面参考文献中Hitachi的\"Prime FSE\"策略。 参考材料 Hennig J, Nauerth A, Friedburg H. RARE imaging - a fast imaging method for clinical MR . Magn Reson Med 1986; 3: 823-833. Hitata Y, Sasaki M, Esashika K, Gakumazawa H. Hitachi's Prime Fast Spin Echo technology: efficacies in improving image quality and usability . (Sales brochure for Hitachi's version of FSE, giving some insight into how various manufacturers have different approaches to echo ordering and data collection in what is essentially the same basic sequence). Walker MT, Partovi S, Karis JP, Fram EK. Fast, versatile, and cost-effective FSE MR imaging: technical considerations and clinical applications . Barrow Quarterly 2000;16:1-5. 相关问题 你如何选择快速自选回波的成像参数？有几个新参数需要设置。","tags":"Rapid-Imaging","title":"Question-快速自旋回波：什么是快速自旋回波成像？"},{"url":"http://chunshan.github.io/MRI-QA/k-space/zip.html","text":"原文链接: A option called ZIP is available for some sequences. Is this a type of file compression? 概要 处理MRI数据通常在阵列处理器上运行快速傅里叶变换（Fast Fourier Transform，FFT）算法。这些计算一般要求输入数据（一个矩阵）的维度是2的幂，比如128x128, 256x256, 或者512x512。如果采集k空间数据不能完全填充这样的矩阵，习惯上以零点填充缺失的数据，这种技术称为零填充或者零插值填充（Zero-Interpolation Filling，ZIP）。 MRI中的ZIP与文件压缩中的*.zip技术毫无关系，与邮政编码也毫无关系！ 零填充通常用于扩展图像矩阵在相位编码方向上的尺寸，对2D成像而言，图像矩阵尺寸的增加是\"平面内\"（如从256个像素变为512个像素），对3D成像而言，零填充可\"跨平面\"用于增加选层方向上的显示分辨率（如从64层变为128层）。图像矩阵尺寸的第一次翻倍时这种技术会带来好处，此后，将没有任何收益。 虽然零填充不会增加输入裸数据的任何信息，但它可以提高图像显示的空间分辨率，减少了部分容积伪影。零填充实际上利用临近体素的信号进行插值的方法，会使得图像看起来更平滑，降低图像的\"马赛克\"效应。 使用/不使用零填充（Zero-Interpolation Filling, ZIP）技术的头部MRA。左边，使用128x128和256x256（全部数据）矩阵获得的图像；右边，使用了零填充，图像矩阵尺寸分别变为256x256和512x512。注意图像质量上的改进，特别是128x128的数据集 高级讨论 为什么零填充与图像空间中的像素插值效果类似？背后的数学有些难，感兴趣的读者可以参考下面的文献（尤其是Bartholdi-Ernst的文章）。 简单来说，无论选择多大的矩阵，总是比一个物体理论上无限的k空间表示要小，必须在某个点上截断（缩短）。截断等效于k空间数据与一个\"厢式车\"/矩形函数相乘，等效于在图像空间与SINC函数（矩形函数的傅里叶变换）进行卷积。零填充会在显示矩阵中产生额外的SINC插值的像素。 一个令人着迷的结果是，使用零填充将数据点首次翻倍时实际上增加了\"新鲜的信息\"，而不只是简单的插值。额外的零怎么会添加\"新数据\"？原因是普通的FFT不会提取FID中所有可用的信息，通过将数据点翻倍，FFT在提取所有\"真实数据\"时变得更加有效。也就是说并不是ZIP创造了新信息，而是标准FFT不能挖掘出所有可用的信息。初始的倍增之后，优势不会继续增加，因为傅里叶系数变得彼此完全相关，所以数据处理时只会进行一次ZIP处理。 如上所述，2D成像中，ZIP的应用是\"平面内\"的；3D成像中，ZIP可以在\"平面内\"，\"平面间\"或二者同时应用。各厂商对这两种类型的ZIP技术也有不同的命名，比如，GE将平面内的ZIP技术称为\"ZIP 512\"或\"ZIP 1024\"，将跨平面的ZIP技术称为\"ZIP x 2\"或\"ZIP x 4\"。 参考材料 Bartholdi E, Ernst RR. Fourier spectroscopy and the causality principle . J Magn Reson 1973; 11:9-19. Bernstein MA, Fain SB, Riederer SJ. Effect of windowing and zero-filled reconstruction of MRI data on spatial resolution and acquisition strategy . J Magn Reson Imaging 2001;14:270-280. Du YP, Parker DL, Davis WL, Cao G. Reduction of partial volume artifacts with zero-filled interpolation in three dimensional MR angiography. J Magn Reson Imaging 1994; 4:733-741 Ebel A, Dreher W, Leibfritz D. Effects of zero-filling and apodization on spectral integrals in discrete Fourier-transform spectroscopy of noisy data . J Magn Reson 2006;182:330-338. 相关问题 为什么k空间被画为网格状？k空间的轴意味着什么？","tags":"K-space","title":"Question-零插值填充：某些序列中可选择使用零插值填充（ZIP，Zero-Interpolation Filling）技术，这是一种文件压缩方式么？"},{"url":"http://chunshan.github.io/MRI-QA/k-space/why-not-use-both.html","text":"原文链接: Why don't you combine the read conjugate symmetry and phase conjugate symmetry techniques? That way you really save time by collecting only 1/4 the k-space data. 概要 K空间\"对角对称\"的性质使得不能仅使用四分之一k空间数据重建图像 k空间对称性是读出共轭对称技术和相位共轭对称技术赖以成功的基础，这种对称性本质上是成对角的。仅采集k空间一个角上的数据可以估计/合成关于原点对称的另一个角上的数据（其它的数据不能合成），因此读出共轭对称技术和相位共轭对称技术不能一起使用，四分之一k空间不足以准确地重建整幅图像。 参考材料 McGibney G, Smith MR, Nichols ST, Crawley A. Quantitative evaluation of several partial Fourier reconstruction algorithms used in MRI . Magn Reson Med 1993;30:51-59 Williams LR. Symmetry . Lecture Notes for Computer Science 530, University of New Mexico, 2011. Available at http://www.cs.unm.edu/~williams/cs530/symmetry.pdf 相关问题 什么是部分傅里叶成像？ 相位共轭对称如何工作？为什么会使用这种技术？","tags":"K-space","title":"Question-共轭对称性：为什么读出共轭对称技术和相位共轭对称技术不结合使用？那样的话可以仅采集1/4的k空间数据，大大节省时间。"},{"url":"http://chunshan.github.io/MRI-QA/k-space/read-symmetry.html","text":"原文链接: What is read-conjugate symmetry (fractional echo) imaging? Why would one only want to sample part of an echo? 概要 读出共轭对称是部分傅里叶技术的一种，使用k空间的一半数据合成(预测)另一半数据。与相位共轭对称不同的是，其使用的对称方向是读出方向（频率编码方向）。 因为图示中的kx轴通常用于表示频率编码，读出对称性可以看做是获取k空间的右半部分，估计左半部分的数据。k空间采样的右半部分来自每一个MR回波的后面部分。 各厂商对此技术的命名也反映了每个回波只采样一部分。\"部分回波（Partial Echo）\"（GE, Philips）；\"半回波（Half Echo）\"（Hitachi）；\"不对称回波（Asymmetric Echo）\"（Siemens）。与相位共轭对称性不同，全部的相位编码步骤都需要采集，因此不会直接节省时间。 为什么仅想采样一个回波的一部分？答案是通过仅采样回波的一部分，回波时间（TE）可以短于其他情况下可能的最小值。这对于快速成像技术和平面回波技术特别有用，但也在许多其他的应用中使用如磁共振血管造影和T1加权的自旋回波成像。 当回波时间（TE）比较短时，RF脉冲所产生的自由感应衰减（FID）信号会混入回波的早期信号，通过只采样每个回波的后半部分，并且使用读出共轭对称重建前半部分，我们可以使用短TE获取图像，并且FID和回波信号之间干扰小。 此外，对于给定的回波时间（TE），回波右半部分有充分时间进行采样，因此部分回波技术可产生更好的信噪比（SNR）。由于采样时间更远的地方梯度幅值更小，读出共轭对称技术也可用于给定回波时间时采集更小的FOV，或者斜扫，不使用此技术时是不可能的。最后，读出共轭对称的另一个优势是读出方向上梯度场施加时间减少，减少了频率编码方向上的血流和运动伪影。 参考材料 Feinberg DA, Hale JD, Watts JC et al. Halving MR imaging time by conjugation: demonstration at 3.5 kG . Radiology 1986; 161:527-531. MacFall JR, Pelc NJ, Vavrek RM. Correction of spatially dependent phase shifts for partial Fourier imaging . Magn Reson Imaging 1988; 6:143-145. McGibney G, Smith MR, Nichols ST, Crawley A. Quantitative evaluation of several partial Fourier reconstruction algorithms used in MRI . Magn Reson Med 1993;30:51-59 相关问题 什么是部分傅里叶成像？ 相位共轭对称如何工作？为什么会使用这种技术？","tags":"K-space","title":"Question-读出共轭对称：什么是读出共轭对称（部分回波）成像？为什么仅采样回波的一部分？"},{"url":"http://chunshan.github.io/MRI-QA/k-space/phase-symmetry.html","text":"原文链接: How does phase-conjugate symmetry work? Why is it used? 概要 相位共轭对称。通过减少相位编码步骤，仅采样大约k空间的一半即可，合成或重建k空间的另一半 相位共轭对称技术使用k空间的上半部分来估计k空间的下半部分。在二维自旋卷折成像中，ky方向通常是相位编码方向的同义词，因此，\"相位共轭对称\"是描述这种从顶部到底部数据合成（估计）的通用术语。 理论上，相位共轭对称可以仅采集正常相位编码步骤的一半数据，从而成像时间可以最多减少至50%。实际上，节省的时间接近40%，但这个收益仍然是相当可观的，在现代磁共振成像协议中被广泛使用。 相位共轭对称方法，不同的厂商有不同的商标名字。Siemens称之为\"半傅里叶（Half Fourier）\"，Toshiba使用简称AFI\"非对称傅里叶成像（Asymmetric Fourier Imaging）\"，Philips和Hitachi则称他们的序列为\"半扫描（Half Scan）\"。 GE一直称他们的技术为\"1/2-NEX\"，\"3/4-NEX\"或\"部分NEX（Fractional NEX）\"，取决于k空间数据获取:估计的比例。\"1/2-NEX\"有些误导，因为减半的是相位编码总的步数（Np），而不是每个步骤中激发（NEX）的次数。但GE的这个叫法提醒我们k空间欠采样的程度与成像时间的减少是相关的。 虽然相位共轭对称技术减少了成像时间的同时保持了空间分辨率，但这是以牺牲信噪比（SNR）为代价的。对半傅里叶成像而言，SNR比对应的使用全相位编码步骤的序列减少了约30%（√½）。 参考材料 Feinberg DA, Hale JD, Watts JC et al. Halving MR imaging time by conjugation: demonstration at 3.5 kG . Radiology 1986; 161:527-531. MacFall JR, Pelc NJ, Vavrek RM. Correction of spatially dependent phase shifts for partial Fourier imaging . Magn Reson Imaging 1988; 6:143-145. McGibney G, Smith MR, Nichols ST, Crawley A. Quantitative evaluation of several partial Fourier reconstruction algorithms used in MRI . Magn Reson Med 1993;30:51-59 相关问题 什么是部分傅里叶成像？","tags":"K-space","title":"Question-相位共轭对称：相位共轭对称如何工作？为什么会使用这种技术？"},{"url":"http://chunshan.github.io/MRI-QA/k-space/partial-fourier.html","text":"原文链接: What is partial Fourier imaging? 概要 部分傅里叶成像技术是仅使用一半k空间数据产生完整MR图像的重建方法。怎样才能做到？ P和Q的共轭对称性。如果已知其中一个点的值，另一个可以计算出来 这个有些惊奇的结果来源于这样一个事实，k空间中的一些信息是多余的。假设在数据采集过程中没有相位错误发生，k空间具有独特的镜像属性称为共轭（Hermitian）对称性。 一对点如P和Q的共轭对称性指的是它们关于k空间原点对称，如果P点的值为复数[a+bi]，那么Q点的值就是P点的共轭复数，[a-bi]。 对任何实数函数进行傅里叶变换，结果都有共轭对称性，这是一个高级但直接的结论。对于2D MR成像这个更具体的例子，共轭对称点代表两个相反相位编码步骤获得的回波中相呼应的两个上升和下降点。换句话说，一个使用正相位编码步骤获得的回波上升部分数据点的信号强度是另一个使用对应的负相位编码步骤获得的回波下降部分数据点信号强度的共轭复数。 k空间的共轭（Hermitian）对称性。k空间关于原点对称的镜像位置，实部相同但是虚部符号相反 理论上，共轭对称性造成的结果是只需采集k空间一半儿的数据，另一半儿可以计算出来。这可以减少成像时间，减少最小回波时间，或者两者同时减少。 所有图像数据集都会包含一些相位错误，因此使用共轭对称性进行近似并不完美。相位错误的根源包含那些常见的\"嫌疑人\"：B0不均匀性，磁敏感效应，涡电流，生理运动，射频不均匀性造成的空间变化或表面线圈敏感性。所以部分傅里叶技术的商业实现需要比k空间的一半儿稍微多采集一些（通常常规成像的60%，平面回波成像比例会更高）。这些多余的线用于产生k空间的相位校正图，可以对缺失的值进行更准确的预测。 日常使用中有两种类型的部分傅里叶成像技术，并且在多数主流扫描仪中都提供了这两种方法，这两种方法通常分别称为\"读出共轭对称（read conjugate symmetry）\"和\"相位共轭对称（phase conjugate symmetry）\"，后面两个Q&A分别详述这两个技术。 高级讨论 目前用于部分傅里叶估计的流行方法是零差重建。这个技术需对已获取的k空间数据使用两个串行的滤波器。第一个滤波器（高通滤波）将数据的幅值翻倍，然后丢弃傅里叶变换后的图像的虚部。第二个零差滤波器（低通滤波）根据已获取数据的一小部分，利用关于k空间中心的对称性创建一幅\"校正图像\"。在丢弃图像的虚部之前，从图像经过第一个滤波器（高通）的相位中减去\"校正图像\"的相位。 在平面回波成像（EPI）中，射频激发脉冲晚期获得的回波与早期获得的回波有不同的相位。这是相位误差额外的来源，使得相位估计更加困难。对EPI而言，部分傅里叶技术通常需采样k空间的6/8或7/8，才能准确估计剩余的部分。 参考材料 Feinberg DA, Hale JD, Watts JC et al. Halving MR imaging time by conjugation: demonstration at 3.5 kG . Radiology 1986; 161:527-531. MacFall JR, Pelc NJ, Vavrek RM. Correction of spatially dependent phase shifts for partial Fourier imaging . Magn Reson Imaging 1988; 6:143-145. McGibney G, Smith MR, Nichols ST, Crawley A. Quantitative evaluation of several partial Fourier reconstruction algorithms used in MRI . Magn Reson Med 1993;30:51-59 Williams LR. Symmetry . Lecture Notes for Computer Science 530, University of New Mexico, 2011. Available at http://www.cs.unm.edu/~williams/cs530/symmetry.pdf 相关问题 相位共轭对称如何工作？为什么会使用这种技术？ 什么是读出共轭对称（部分回波）成像？为什么仅采样回波的一部分？","tags":"K-space","title":"Question-部分傅里叶技术：什么是部分傅里叶成像？"},{"url":"http://chunshan.github.io/MRI-QA/k-space/rectangular-fov.html","text":"原文链接: How does one obtain a rectangular field of view? Why would you want to use it? 概要 在相位编码方向隔行采样得到的矩形FOV（1:2） 在 前一个Q&A 中，我们说明了FOV与k空间中采样之间的间隔（Δk）成反比。为了简化说明，我们考虑正方形的像素，而且在每一个方向上有相同的FOV。然而，通过改变频率和相位轴上的采样率，独立地更改每一个图像维度的FOV也是可能的。 FOVf = 1 / Δkf FOVp = 1 / Δkp 对于二维自旋卷折成像，获取比例为1:2的矩形FOV需要交替采样k空间中的相位编码线，但是保留最大和最小相位编码梯度的幅值不变。这个过程使得相位编码步骤（Np）只有原来的一半，但是相邻两个步骤之间的增量翻倍。 因此在频率编码方向上的FOV（FOVf）和采样率不受影响，此外，由于FOVp和Np都减少一半，相位编码方向上的像素尺寸（FOVp/Np）和图像总体的空间分辨率也不变。 所有的MR厂商都提供矩形FOV作为适用于大多数脉冲序列的标准选择，但是名称略有不同：\"矩形FOV（Rectangular FOV）\"（Philips, Hitachi, Toshiba），\"相位FOV（Phase FOV）\"（Siemens），\"部分FOV（Partial FOV）\"（GE）。 选择矩形FOV在扫描脊柱和四肢时特别有用，因为这些场景中一个解剖方向上的尺寸比其他方向长很多。大多数扫描仪允许在一个大范围内调整相位采样率，因此，矩形FOV的尺寸和形状可调整的自由度还比较大。 但是，矩形FOV技术有两个主要的缺点。首先，因为采集的相位编码步数变少，信噪比（SNR）与整FOV成像相比会降低。其次，如果成像物体的尺寸超过了定义的FOVp（相位编码方向上的FOV），卷折（混淆）就会发生。要想消除这些伪影，需要对病人仔细摆位，并且使用饱和带。 参考材料 Mezrich R. A perspective on k-space . Radiology 1995; 195: 297-315. [review]. Miller K. MRI image formation (ppt) . On-line lecture notes available at users.fmrib.ox.ac.uk/~karla/teaching/image_formation.ppt 相关问题 k空间与视野（FOV）和像素宽度的关系是什么？ Why does phase wrap-around occur?","tags":"K-space","title":"Question-矩形FOV：如何获得矩形FOV？我们为什么要使用这样的FOV？"},{"url":"http://chunshan.github.io/MRI-QA/k-space/field-of-view-fov.html","text":"原文链接: How does k-space relate to field-of-view (FOV) and pixel width? 概要 视野（Field-of-view，FOV）指的是MR图像采集或显示时的距离（用cm或mm表示）。FOV一般被分为几百个图像元素（像素），每一个的尺寸大约为1mm²。虽然不同方向上FOV和像素尺寸可以不同，为了能够解释地更清楚，我们仅考虑对称的情况，二维的情况下，FOVx = FOVy = FOV 并且 Δx = Δy = Δw。 定义好了视野（FOV）和像素宽度（Δw）就决定了k空间中数字化采样的数目，必须采集够这些数目，才能重建出所需分辨率的图像。像下表所示，FOV反比于k空间中采样之间的间距，具体来说，Δk = 1/FOV。 从对称性上考虑，像素宽度（Δw）和k空间中空间频率最大的正值（+kmax）和负值（−kmax）之间的范围也成反比。假设定义kFOV = (+kmax) − (−kmax) = 2kmax，Δw和kFOV之间的关系为Δw = 1/kFOV。 对大多数人而言，Δk = 1/FOV 或者 Δw = 1/kFOV这样的关系并不是显而易见的，反而因此增加了混乱。希望下面的讨论能够让你对这些重要的结果感觉比较舒服一些。首先我们考虑为什么Δk = 1/FOV。 回忆前面一个Q&A中讲到傅里叶分析会将一个简单的信号分解为一系列不同谐波频率（ω, 2ω, 3ω等）的正弦波的和。 在k空间中成像物体空间频率的傅里叶投影也遵循傅里叶分析中简单的模式，只是复指数(cos nωt + i sin nωt)代替了简单的正弦波，但振荡频率仍然是ω（1/FOV）的整数倍。k空间中连续的两条采样线相差1/FOV。例如，线kn+1和kn之间的空间频率差异（Δk = kn+1 − kn）为Δk = (n+1)/FOV − n/FOV = 1/FOV。 与表达式Δk = 1/FOV一样，方程Δw = 1/kFOV也不是一眼就能看出来的。这种情况下，我们要考虑需要k空间中的多少相位周期来近似表征最小所需尺寸（Δw）的图像。 如下图所示，答案是至少需要一个完整的相位周期以唯一区分每个像素。如果视野FOV内有宽为Δw的N个像素，那么需要N个相位周期。我们前面定义kFOV = 2kmax对应于此要求的空间频率。由于空间频率(k)为[周期/距离]，我们可以将kFOV表示为kFOV = N /FOV。但是像素宽度（Δw）等于FOV / N。所以直接有kFOV = 1 /Δw。 这两个成对儿的方程之所以重要是因为它们揭示了k空间中的间距或者采样的位置如何影响FOV和像素宽度。 数据采样间隔(Δk)和图像FOV之间的反比关系 第一个例子演示了数据间隔和图像FOV之间的反比关系。左边，k空间数据采样率对应于FOV为30cm的图像。右边，数据点之间的间隔（Δk）翻倍了，结果是图像的像素尺寸不变但是FOV仅有原来的一半（15cm）。在此小FOV外部的脑的外缘\"卷折\"到重建图像的对侧，这种现象称为混叠。 像素宽度（Δw）和k空间频率的采样范围（kFOV）之间的反比关系 第二个例子中，我们保持数据采样率和间隔（Δk）不变，但是我们仅取k空间中间三分之一的采样数据，也就是将kFOV减少为原来的1/3。对k空间进行这种操作后，FOV保持不变，但是像素宽度（Δw）翻了三倍，从1mm变为3mm。变大的像素尺寸意味着平面内的空间分辨率下降了，这个结果在意料之中，因为只有k空间中间低频率的点被采样了。 如果你仍然感到困惑，不要担心，毕竟这个话题属于\"k空间高级话题\"。对于更想从数学上一窥究竟的好学者，下面由Eric Wong给的YouTube视频可以提供更进一步的视角。 参考材料 Mezrich R. A perspective on k-space . Radiology 1995; 195: 297-315. [review]. Miller K. MRI image formation (ppt) . On-line lecture notes available at users.fmrib.ox.ac.uk/~karla/teaching/image_formation.ppt 相关问题 How does one obtain a rectangular field of view? Why would you want to use it?","tags":"K-space","title":"Question-视野与k空间：k空间与视野（FOV）和像素宽度的关系是什么？"},{"url":"http://chunshan.github.io/MRI-QA/k-space/negative-frequencies.html","text":"原文链接: What is the meaning of negative frequencies? I don't understand how kx and ky can have negative values. 概要 普通的物理现象如声波一般没有必要使用负频率描述。比如，\"中央C调\"的频率为261.63Hz或者电源插座中的电压在60Hz震荡，这样的描述是完全足够的。在这样的场景中，我们将频率考虑为是一个没有符号的标量，有时也称之为时间频率。 在其他情况下，将频率考虑为既有幅度又有方向的矢量更合适。假设有两个轮子，以相同的转速（rpm revolution per minutes，rpm）旋转但是方向不同。这种场景中，对角频率指定正和负（+ω and −ω）以区分顺时针和逆时针方向的运动会更加合理。 傅里叶分析中区分正负频率也很重要，原因是傅里叶变换并不是将一个信号分解为简单的正弦波，实际上，傅里叶变换会将信号分解为复指数函数，可以认为是在两个方向旋转的正弦波和余弦波。 另一个视角看正负频率，回忆一下，频率（ω）即相位（ϕ）随时间（t）的变化速率。在微积分中表示为ω = dϕ/dt（这是有道理的，因为频率的单位可以表示为周期，度或弧度每秒）。 因此正频率（+ω）意味着相位随时间增加，而负频率（−ω）意味着相位随时间减小。 因此−kx和−ky轴对应于负空间频率，也就是累积相位减小。一般情况下，负极性梯度叶会将空间频率和相位\"吹向\"图表的左侧或下侧（依赖于沿哪个轴施加），相反，一个正极性梯度叶将空间频率和相位\"吹向\"上方或右方。 参考材料 Johnson, D. Elemental Signals . OpenStax-CNX Web site. http://cnx.org/content/m0004/2.29/ , Jul 6, 2009. Lyons R. A Quadrature Signals Tutorial: Complex, But Not Complicated . Available at http://www.dsprelated.com/showarticle/192.php Negative Frequency . Wikipedia, the Free Encyclopedia. Signal Processing Stack Exchange. What is the physical significance of negative frequencies? Available at http://dsp.stackexchange.com/ 相关问题 为什么k空间被画为网格状？k空间的轴意味着什么？","tags":"K-space","title":"Question-负频率：负频率的意思是什么？我不能理解kx和ky怎么会有负频率？"},{"url":"http://chunshan.github.io/MRI-QA/k-space/k-space-grid.html","text":"原文链接: Why is k-space drawn as a grid? What do the axes in k-space mean? 概要 像宇宙外太空一样，k空间也是没有边界的，包含无限多的数据点。为了完美的表示一个物体，需要测量所有的空间频率，要求MR信号的采样有无限的精度，这显然是一个不可能完成的任务。 相反，用于填充k空间的MR信号都被离散采样，然后将这些数据点放置到有限的k空间\"网格\"（矩阵）中，网格中通常有几千到几十万个单元。每一个数据点(kx, ky)表示一个特定空间频率对图像的贡献。主轴线kx和ky上的点表示图像在x和y方向上的空间频率。不正好在轴上的点表示不同角度上空间频率的贡献。 k空间网格通常是正方形的，并且间隔是均匀的，但这并不是必须的。规则的间隔会使得数据采集和处理更容易，更快，更高效。 相邻行或列的距离表示为Δk，k空间中心点到一条边的距离称为kmax。Δk和kmax共同决定最终图像上的像素尺寸和视野（FOV， field-of-view）。这两个参数如何影响图像属性是 后续Q&A 的主题。 高级讨论 理论上，使用恒定振幅的相位和频率编码梯度对MR信号进行规则采样会将数据放置在规则的正方形矩阵中，如上图所示。但是，数据采样，特别是快速回波或平面回波序列，会在梯度的上升或下降沿时进行。这种情况下，时间上的均匀采样不会产生空间频率上的均匀采样，造成k空间数据被挤到边缘。 出于类似的原因，如果梯度在采集过程中不是恒定的，k空间数据的间隔将是不均匀的。几乎所有的非笛卡尔方法（螺旋，径向，PROPELLER）使用正弦变化的梯度，都会遇到这样的问题。 为了有效地处理非均匀采集的数据，已经开发了许多方法将这些数据做一些\"变形\"放置到长方形矩阵或\"网格\"中。这种迭代的过程称为\"网格化\"。 尽管存在不同的方法，典型的网格化算法首先将原始数据和一组密度补偿量相乘，并与一个网格化核函数卷积，然后对结果数据进行插值，放置到均匀间隔的矩阵（\"网格\"）中，然后做离散傅里叶变换，最后，对视野进行裁剪，并使用变迹校正函数与变换后的数据相乘。 感兴趣的读者如果想了解更多细节，可以阅读下面参考文献中列出的John Pauly的文章。 参考材料 \"Discrete Fourier Transform\" . Wikipedia, the Free Encyclopedia. Pauly J. Non-Cartesian reconstruction . 2005. Available from ee-classes.usc.edu. 相关问题 k空间是什么？","tags":"K-space","title":"Question-k空间\"网格\"：为什么k空间被画为网格状？k空间的轴意味着什么？"},{"url":"http://chunshan.github.io/MRI-QA/k-space/k-space-trajectories.html","text":"原文链接: You alluded to different trajectories for filling k-space. What are they? 概要 鸽子的k空间 在产生MR信号之前，k空间是等待数据到来的一系列空格子。打个比方，想象k空间为有很多空\"鸽子洞\"的箱子，等待接收鸽子，目标是一个洞中放一个鸽子。只要箱子被填满，顺序并不重要。 下边是现代MR成像中4种常见的k空间填充轨迹。传统上，笛卡尔方法（一行接一行）占主导地位，但是现在所有这些模式都被广泛使用。 上图：k空间的笛卡尔填充方法，频率编码从左到右 下图：k空间的螺旋填充方法，从中心向外围 高级讨论 选择何种k空间填充策略取决于不同的应用，这种选择也许对平面回波成像（EPI）最为关键，EPI中很长的读出链使得序列对磁敏感伪影和快速切换产生的多余涡电流效应非常敏感。理解这些效应的一般分析方法是沿三个标准的成像轴（相位编码，频率编码，层面选择）进行分解。 沿频率编码方向的梯度导致图像错切和模糊，这种效应与读出链长度成正比。沿相位编码方向的梯度会缩放图像并改变有效TE。由于沿相位编码轴的带宽通常远低于其他方向的带宽，偏离共振的自旋（如脂肪质子）将明显错位。因此EPI序列通常使用脂肪饱和技术减少相位编码方向的化学位移伪影。最后，沿层面选择轴上的梯度会使得信号相散，产生信号缺如。 遍历k空间的笛卡尔方法最容易实现，很长时间都是大多数MR成像序列(含EPI或其他序列)的标准方法。现在，径向和螺旋读出方法逐渐成为常态，因为它们对运动天生不太敏感，而且允许更短的TE值。螺旋方法可以是\"螺旋进\"，\"螺旋出\"或二者联合。由于在径向和螺旋技术中频率和相位编码方向没有分开，伪影有些不同（包括环形带和环形模糊）。螺旋扫描受不正确的梯度时间和伴随产生的梯度场影响更大。图像重建也更加复杂，需要\"网格化\"或其他方法将测量的k空间数据点移至矩形矩阵中，然后应用快速傅里叶变换的数值处理。 参考材料 Mezrich R. A perspective on k-space . Radiology 1995; 195: 297-315. [review]. Miller K. MRI image formation (ppt) . On-line lecture notes available at users.fmrib.ox.ac.uk/~karla/teaching/image_formation.ppt 相关问题 从哪儿获得数据填充k空间？","tags":"K-space","title":"Question-填充k空间的方法：你提到的用不同轨迹填充K空间。它们是什么？"},{"url":"http://chunshan.github.io/MRI-QA/k-space/big-spot-in-middle.html","text":"原文链接: Why does k-space have a big spot in the middle? 概要 k空间的2D和3D视图 k空间的正中间是kx = ky = 0的点，这个位置对应于图像傅里叶表示中的常数项，它的幅值等于图像的平均亮度。此中心点有比k空间中其他任何点更高的幅值，在3D表示中可以看得更明显（右图）。 k空间中心区域最亮，原因有二。首先，中心行（ky = 0）在没有相位编码梯度的情况下（因此没有相位编码步骤中破坏性的干扰波）采集，其次，k空间的中心列(kx = 0)与MR回波的峰值重叠。 这些特征说明如下，比较了k空间中心行(左)和外周(右)行的MR信号。 k空间接近中心行的MR信号幅值高 k空间外周行的MR信号幅值低 参考材料 Mezrich R. A perspective on k-space . Radiology 1995; 195: 297-315. [review]. 相关问题 从哪儿获得数据填充k空间？","tags":"K-space","title":"Question-k空间的不同部分：为什么k空间在中间有个大的亮斑？"},{"url":"http://chunshan.github.io/MRI-QA/k-space/spin-warp-imaging.html","text":"原文链接: What is spin-warp imaging? Isn't this just \"regular\" MRI? 概要 傅里叶变换自从二十世纪八十年代初被引入，Edelstein和其同事发明的这一基于自旋-卷折的成像技术已经成为对MR信号空间编码的主导方法。如果你认为\"常规磁共振成像\"是连续应用相位和频率编码梯度进行数据采集，你正在思考的就是自旋-卷折方法的一些变种。 使用自旋-卷折成像的传统2D自旋回波脉冲序列的原型如上所示。这儿，施加90°-180°射频脉冲对之后产生MR信号，选层梯度与每一个射频脉冲同时打开使得只有一个层面被激发。 每一个时间点MR信号数字化的值插入k空间矩阵中水平的一行，从左到右填充 频率编码会使用90°和180°脉冲之间的失相叶和180°脉冲之后的读出叶。失相叶会对扫描轴上的质子造成相位偏移，此相位偏移是因为梯度场中空间位置不同的质子其共振频率不同导致的。这些自旋的相位会被180°脉冲反转，然后通过读出叶相位回聚为一个回波。 自旋-卷折序列独特的特征是在信号生成过程中会施加一个幅度变化的相位编码梯度，通常在90°和180°脉冲之间。此片层中其它的MR信号会在下一个TR间隔内收集，使用相同的频率编码梯度，但是不同的相位编码梯度。相位编码梯度提供了一种沿此方向根据空间位置区分信号的方法。 相位编码梯度连续应用，产生的数字化MR信号会用于填充k空间的不同行。对于常规磁共振成像，这个过程通常会按顺序重复256次。一旦所有的行都填充了数据，就可以使用傅里叶变换重建图像。 关于k空间，既然你已经看到了这儿，我建议你花一刻钟时间看一下下面的两个视频，由已故的Paul Callaghan提供。Callaghan博士仔细勾画了2DFT自旋卷折成像的原理，展示了k空间和MR信号是如何关联的( 视频来自youtube，可能不能显示 )。 参考材料 Edelstein WA, Hutchison JMS, Johnson G, Redpath T. Spin warp NMR imaging and applications to human whole-body imaging . Phys Med Biol 1980; 25:751-6. Wald L. MR image encoding . (From MIT OpenCourseWare http://ocw.mit.edu ) 相关问题 从哪儿获得数据填充k空间？","tags":"K-space","title":"Question-自旋-卷折成像：什么是自旋-卷折成像？它是不是\"常规\"MRI？"},{"url":"http://chunshan.github.io/MRI-QA/k-space/why-signal-harr-k-space.html","text":"原文链接: I don't understand how you can simply plug the digitized MR signal data directly into k-space. How are these points the same as spatial frequency? 概要 产生MR信号需要施加一个频率编码梯度，回波（或FID，自由感应衰减）中连续采集的数据点反映了逐渐增加的空间频率。这使得从MR信号中采样的原始数据可以直接插入到k空间矩阵中。 换句话说，MR信号的每一个数据点已经是\"傅里叶格式\"。我称此令人惊讶的事实为k空间的\"奇迹\"。为什么会发生此奇迹并不非常直观，需要一些解释。 下面的图表显示了一个假想的通过上腹部片层的MR FID信号，此FID信号会因为沿水平轴的失相位梯度G(x)的施加而加速衰减，G(x)既可以是频率编码梯度也可以是相位编码梯度，简化起见，我们假设G(x)随位置(x)线性变化，形式为G(x) = G • x，其中G的单位是mT/m或者等价单位。 当G(x)施加时，给定位置x的总磁场强度为B(x) = Bo + G(x)，此位置相应的共振频率为 f(x) = γB(x) = γBo + γG(x) = fo + γGx 其中γ是旋磁比，fo是主磁场(Bo)的拉莫尔频率。在梯度场施加的过程中，共振频率沿图像从左到右增加。一旦梯度场关闭，共振频率恢复到fo。 当施加梯度时，磁场更高部分的质子与磁场较低部分的质子相比进动更快，相位增加更多。即使梯度已经关闭，这种相位偏差仍然存在。由于相位 = 频率 x 时间，相位增益与梯度施加时间(t)的长度成正比。相位增益也是位置(x)的函数，表示为： ϕ(x,t) = (γGx) • t = (γGt) • x = kx(t) • x 其中kx(t) = γGt。这儿的kx就是k空间中的kx，表示沿x方向相位在单位距离内的周期数。 另一种思考k(t)的方法是用旋磁比(γ)乘以梯度(G)曲线在时刻(t)下的面积。虽然像上面简单例子中那样假设线性、矩形的梯度波形沿x轴变化，但是此定义对任意梯度形状和方向(r)也适用。具体而言， 当t = tearly，kx比较小，整个图像的相位传播比较小，当t = tlate，kx比较大并且图像中含多个相位周期。由此在每一个时间点(t)产生的MR信号反映了增加的空间频率和图像中所有位置相位角的加和。因此MR信号中连续的点反映了连续增高的空间频率，其值可以\"奇迹般地\"直接用于填充k空间。 梯度施加于两个物体，一个均匀(蓝色)，一个具有周期性(红色)。如果相位编码匹配红色物体的周期，将产生一个很强的信号。 如果上面的讨论过于数学化，左边的例子可提供额外的视角。这儿有两个物体，其中一个密度比较均匀（蓝色），另一个密度呈周期性（红色，像一个围栏），两个物体置于相同的梯度场中。假设此梯度会引起两个物体中的一组相移（绿色），其空间频率正好可以匹配红色的物体。 由于均匀物体（蓝色）跨多个相位周期，磁化矢量全部取消，将观测不到任何信号。换句话说，均匀物体中一个相移为φ的像素，很容易找到另一个像素相移为−φ。相反，红色物体在此相位编码中会产生强烈的信号，因为物体固有的空间频率正好可以与梯度产生的空间频率相匹配。 参考材料 Mezrich R. A perspective on k-space . Radiology 1995; 195: 297-315. [review]. Wald L. MR image encoding . (From MIT OpenCourseWare http://ocw.mit.edu ) 相关问题 从哪儿获得数据填充k空间？","tags":"K-space","title":"Question-信号和空间频率：我不明白你如何将数字化磁共振信号简单地直接插入到k空间中。这些点和空间频率是一致的么？"},{"url":"http://chunshan.github.io/MRI-QA/k-space/data-for-k-space.html","text":"原文链接: Where do you get the data to fill k-space? 概要 填充k空间的数据直接来自磁共振信号。由于使用梯度进行相位和频率编码，磁共振信号已经类似傅里叶格式，适合填充k空间矩阵。 用实部和虚部表示的磁共振信号 在 前面一个Q&A 中，我们解释了磁共振信号如何用正交的方式检测。每一个数字化的磁共振信号数据点可以表示为一个复数，有实部和虚部。另外，也可以为每个数据点定义一个幅值和相位，通过简单的三角关系计算。 填充k空间的数据直接取自磁共振信号但是可以以任意的顺序获取。过去30年中，填充k空间的主流方法是逐线填充的笛卡尔方法。现在，螺旋和径向填充轨迹越来越流行。 在笛卡尔方法中，每一个数字化回波完整地填充k空间的一行。回波信号用正交的方式记录，所以k空间上每一个点包含了实部和虚部。k空间中每一行左边的值在回波产生的早期采集，右边的值随后采集。回波的中心（最大的值）发生在k空间每一行的中心附近。 笛卡尔方法（逐线）填充k空间 在2D傅里叶变换成像中，k空间中每一行对应于应用一个相位编码梯度采集得到的回波数据。按照惯例，定义接近k空间中心的行与低阶相位编码步骤相关联，靠近顶部和底部的行与高阶相位编码步骤相关联。由于回波幅度在低阶相位编码步骤中更大（有较少的梯度引起的失相位），因此k空间中的值在中心处比较大。 参考材料 Mezrich R. A perspective on k-space . Radiology 1995; 195: 297-315. [review]. Miller K. MRI image formation (ppt) . On-line lecture notes available at users.fmrib.ox.ac.uk/~karla/teaching/image_formation.ppt 相关问题 k空间是什么？ 我不明白你如何将数字化磁共振信号简单地直接插入到k空间中。这些点和空间频率是一致的么？","tags":"K-space","title":"Question-填充k空间：从哪儿获得数据填充k空间？"},{"url":"http://chunshan.github.io/MRI-QA/k-space/locations-in-k-space.html","text":"原文链接: Exactly where are the spatial frequencies are located in k-space? 概要 概括地说，k空间的中心包含低空间频率信息，决定图像整体的对比度，亮度和基本形状；k空间的周边包含高空间频率信息（边缘，细节，尖锐的过渡）。 k空间的数据单元通常在以kx和ky为主轴的矩形网格中显示，k空间中的kx和ky轴与图像中的水平轴(x-)和垂直轴(y-)对应，但是kx和ky轴表示x-和y-方向的空间频率而不是位置，k空间中每个数据点(kx,ky)也并不与图像中每个像素点(x,y)一一对应。k空间中每个点含有最终图像中所有像素的空间频率和相位信息，反过来，图像中的每个像素也映射到k空间中所有的点。 kx轴上的点表示沿图像x方向的频率部分，ky轴上点反应图像沿y方向的频率部分。一个方块的图像，方块的边与图像的x轴和y轴对齐，此图像的k空间图像如右上图所示。 如果方块旋转45°，对应于方块边缘的主要空间频率也将与kx轴和ky轴成45°。平面图像波的角度和k空间位置之间的关系如下所示。 一个方块的图像 对应的k空间表示 旋转方块的图像 k空间频率相应旋转 当然，真实的图像在所有方向上都有频率分量，造成k空间具有\"银河\"状的外观。k空间中特定位置的一颗明亮的\"星\"暗示此点表示的空间频率对最终图像有积极的贡献。 物体尺寸（左）与k空间表示频率范围（右）之间的反比关系 最后一点，成像物体的物理尺寸和k空间中频率的宽广程度成反比。换句话说，小物体（像右图中的小白圆圈）有涟漪到k空间的边缘，而较大的物体的频谱能量更多聚焦于k空间的中心。 随着物体的增大，仅需要各个方向少量的低空间频率来表示。极限情况下（物体填充整个FOV），仅需要一个常数傅里叶项。对非常大的物体，其k空间表示收缩为(kx, ky) = (0, 0)处的一个数据点，它的值反应图像的平均亮度。 参考材料 Mezrich R. A perspective on k-space . Radiology 1995; 195: 297-315. [review]. Miller K. MRI image formation (ppt) . On-line lecture notes available at users.fmrib.ox.ac.uk/~karla/teaching/image_formation.ppt \"Spatial frequency\" . Wikipedia, The Free Encyclopedia. 相关问题 k空间是什么？ k空间中点与图像中的点并不对应，它们的意义是什么？ What are 2D- and 3D-Fourier transforms? I don't see how FT works in higher dimensions.","tags":"K-space","title":"Question-空间频率的位置：k空间中空间频率具体在什么位置？"},{"url":"http://chunshan.github.io/MRI-QA/k-space/spatial-frequencies.html","text":"原文链接: What do you mean by spatial frequency? 概要 测试分辨率的线对图案.你的显示器有多好？ 空间频率的概念对所有类型的成像都是很基础的，包括摄影，电视，普通放射成像，和磁共振成像。你可能见过右图所示的测试图案，用于评估打印机或者电脑监视器的保真度。 图像分辨率通常用\"每mm中线的对数\"描述，能够分辨的黑条和白条的最近间距。由于一对线就像相邻波的波峰和波谷，每mm中线的对数可以用来测量空间频率。 正如一个一维信号可以分解为简单的正弦和余弦波的和，二维图像可以分解为一组相位，频率，幅度和方向不同的平面波。 平面波必须从所有可能的方向考虑，沿图像x轴(0º)，沿图像y轴(90º)和其他的方向（145º, −126º等）。 由两个偏移90º的平面波形成的\"蛋箱\"图案 更多方向的平面波相加时，图像逐渐显现 所有图像都可以表示为不同方向空间频率的和。 所有图像都可以使用傅里叶分析分解为不同频率，相位，振幅和方向的平面波。这在斑马图像上很容易看到，但是对即使没有清晰边界的图像其实也适用。实际上，人的视觉皮层包含对不同方向上正弦空间频率响应的细胞。MR图像的k空间表示仅仅是反应图像空间谐波内容的空间频率的有机集合。 参考材料 Sharpness: What is it and how is it measured? (White paper from Imatest.com , a company that makes image-testing software). \"Spatial frequency\" . Wikipedia, The Free Encyclopedia. 相关问题 k空间是什么？ k空间中点与图像中的点并不对应，它们的意义是什么？ What are 2D- and 3D-Fourier transforms? I don't see how FT works in higher dimensions.","tags":"K-space","title":"Question-空间频率：空间频率是什么意思？"},{"url":"http://chunshan.github.io/MRI-QA/k-space/what-does-k-stand-for.html","text":"原文链接: What does the letter \"k\" stand for? 概要 字母\"k\"在光学，声学，力学和电磁学中已经用了一个多世纪，指不同媒介中波的空间频率，但\"k-trajectory\"和\"k-space\"直到20世纪80年代早期才被用于NMR领域，直到20世纪90年代才变得流行。 概念比较简单。一个波用其波长(λ)进行表征，波长为两个对应的点或连续波峰之间的距离。波数(k)是波长的倒数，由下式给出： k = 1 / λ 波数(k)表示单位距离中波或周期的个数。 由于波长用距离的单位测量，波数的单位是(1/距离)，如1/m，1/cm，或1/mm。 高级讨论 波数的概念（德语中为Wellenzahn）首次出现在19世纪70年代至80年代的物理学文献中，用于描述原子光谱。字母\"k\"用于表示波数，尽我所能可确定的最早出版物是A Sommerfield在1914年的一篇论文(Über die Fortpflanzung des Lichtes in dispergierenden Medien. Annalen der Physic 1914; 3491(10):177-202)，处理光在色散介质中的传播问题。 在接下来的30年中，\"k\"作为波数的缩写变得更加流行，但是其它的符合如σ和ν也被使用。在20世纪50年代，美国光谱学协会建议波数的单位是kayser(K)，1K = 1cm -1 ，用于纪念德国20世纪早期的物理学家Heinrich Kayser，他以测量基本物质发射光谱的工作而知名。虽然单位kayser后来被废弃了，\"k\"与波数的联系却加强了，从20世纪50年代起，\"K\"或\"k\"成为波数最常见的缩写。 在一些文献中，k被定义为\"角\"或\"周期\"波数，k = 2π/λ，然而单位是相同的(距离 -1 )。 参考材料 \"Spatial frequency\" . Wikipedia, The Free Encyclopedia. \"Wavenumber\" . Wikipedia, The Free Encyclopedia. 相关问题 k空间是什么？ 空间频率是什么意思？","tags":"K-space","title":"Question-\"k\"的意义：字母\"k\"代表什么？"},{"url":"http://chunshan.github.io/MRI-QA/k-space/parts-of-k-space.html","text":"原文链接: If the points in k-space don't correspond to points in the image, what do they mean? 概要 虽然k空间中一个数据的位置与图像中一个像素的位置没有直接的联系，k空间中的不同部分确实与MR图像的空间频率有拓扑上的对应。如下图所示，靠近k空间中心的数据与低空间频率（如基本的形状和轮廓）相对应，而外围的数据与高空间频率（如边缘与细节）相对应。 参考材料 Mezrich R. A perspective on k-space . Radiology 1995; 195: 297-315. [review]. 相关问题 k空间是什么？ 空间频率是什么意思？","tags":"K-space","title":"Question-k空间\"地理\"：k空间中点与图像中的点并不对应，它们的意义是什么？"},{"url":"http://chunshan.github.io/MRI-QA/k-space/what-is-k-space.html","text":"原文链接: What is k-space? 概要 对许多学生而言，k空间的概念很可怕而且容易混淆，其实没有这么恐怖。k空间的核心可以用如下简单的术语定义： k空间是表示MR图像中空间频率的数组。 k空间常见的图形表示看起来像\"银河\"，充满神秘感。k空间中的每一个\"亮星\"就是直接来自MR信号的数据点。每一个星的亮度代表该星特定的空间频率对最终图像的相对贡献。 虽然k空间\"银河\"与MR图像看起来非常不同，它们包含扫描对象的相同信息。这两种表示可以使用一种\"高级\"的数学方法（傅里叶变换，Fourier Transform）相互转换。 k空间是MR图像的傅里叶变换 DNA的X射线衍射图案。 这实际上就是分子螺旋结构的k空间表示。 k空间的数据单元通常在以kx和ky为主轴的矩形网格中显示，k空间中的kx和ky轴与图像中的水平轴(x-)和垂直轴(y-)对应，但是kx和ky轴表示x-和y-方向的空间频率而不是位置，k空间中每个数据点(kx,ky)也并不与图像中每个像素点(x,y)一一对应。k空间中每个点含有最终图像中所有像素的空间频率和相位信息，反过来，图像中的每个像素也映射到k空间中所有的点。MR图像的k空间表示因此类似于X线晶体学，光学或全息摄影中产生的衍射。 k空间中每一个点映射到图像中的所有点，反过来也一样 这是一个简单介绍。请看下面的\"高级讨论\"和本章节其他的Q&A对k空间的进一步解释。 高级讨论 k空间的概念公认比较抽象，难以想象。在过去的几年里，我尝试了许多不同的方法将此概念解释给我的学生，有不同程度的效果。下面是使用镜头作比喻的例子，许多人发现对理解k空间概念很有帮助。 考虑透过一对透镜看著名的雕塑女王奈费尔提蒂，光波被雕塑反射进入第一片透镜，被第一片透镜折射（弯曲）作为空间频率的函数。低频率的光波仅被微弱的折射，直接穿过透镜的中心，高频率的光波在透镜边缘被折射地更强。第一个透镜的\"输出\"是高空间频率在周围低空间频率在中心的一系列散波。这些波既有建设性的干涉也有破坏性的干涉，可以认为第一个镜片对入射光线进行了\"光学\"傅里叶变换。 如果把你的头放在两片透镜之间（所谓的傅里叶平面），回头看女王，除了模糊的弥散的光什么都看不到，这些光就代表光线穿过第一片透镜的平均强度。这些光波是零散的，不会在你的视网膜上形成图像。你身处\"光\"的k空间。 第二片透镜逆转了这个过程，按照原来的关系重新聚集了在光学k空间分散的光波。第二片透镜进行的是傅里叶逆变换，重新塑造为聚焦的图像。 为什么当你把眼睛置于傅里叶平面内时看不到k空间\"银河\"中的图像？一个原因是眼睛仅对幅度敏感，而透镜将相位和幅度的信息混合在了一起。如果要检测光学k空间，需要一种更加复杂的设备，称为\"4-f\"装置。4-f装置含有一个高度准直的单色激光光源，一个放置在傅里叶平面的滤波器或屏幕，和一个敏感的电荷耦合探测器。这样的4-f实验通常在研究生水平的物理或工学的光学课程中展示，4-f装置也可以从科学教育机构购买。 即使女王奈费尔提蒂的例子还是不能帮助你，最重要的一点是：k空间是原对象固有空间频率的解构表示。对光波而言，从物体到光学k空间的变换通过一个透镜就能简单而且瞬时的实现，对MRI而言，过程更加复杂，也更为耗时，需要在使用多射频脉冲和可变梯度激发物体后对信号进行收集，但结果是一样的：产生k空间中按空间频率组织的数据阵列。在光学和磁共振成像中都一样，还需要一个逆过程，重新组装分散的信号波成为一幅连贯的最终图像。 参考材料 Brown TR, Kincaid BM, Ugurbil K. NMR chemical shift imaging in three dimensions . Proc Natl Acad Sci USA 1982; 79:3523-6. Ek L, Thaning A. Fourier optics . KTH Royal Institute of Technology, 2012. Likes RS. Moving gradient zeugmatography . US Patent #4307343 issued 22 Dec 1981. (First use of the term K-space in the MR literature I can find. He capitalized it!) Ljunggren S. A simple graphical representation of Fourier-based imaging methods . J Magn Reson 1983;54:338-343. Mezrich R. A perspective on k-space . Radiology 1995; 195: 297-315. [review]. Sykora S. K-space formulation of MRI . 2005. (A generalized mathematical formulation that is not too difficult to follow found on-line at http://www.ebyte.it/library/educards/mri/K-SpaceMRI.html ) Twieg DB. The k-trajectory formulation of the NMR imaging process with applications in analysis and synthesis of imaging methods . Med Phys 1983; 10: 610-621. 相关问题 k空间中点与图像中的点并不对应，它们的意义是什么？ 从哪儿获得数据填充k空间？","tags":"K-space","title":"Question-k空间：k空间是什么？"},{"url":"http://chunshan.github.io/MRI-QA/misc/welcome_to_mri_questions_answers_chinese_version.html","text":"首先声明这个网站的文章（除了本篇&#94;_&#94;）都翻译自 Questions and Answers in MRI 。网站上看到的图片也都是来源于 Questions and Answers in MRI ，这些图片非常宝贵，其版权都属于Allen D. Elster博士和 Questions and Answers in MRI 。 在学习磁共振知识的过程中，我发现了 Questions and Answers in MRI 这个网站，这个网站对磁共振相关知识介绍的非常全面，涵盖磁体，线圈，磁共振成像原理，磁共振伪影，磁共振功能成像等方方面面，堪称磁共振知识的百科全书，而且每个话题都写得深入浅出，图文并茂，甚至有视频讲解，磁共振初学者和对磁共振有一定了解的技术人员都能从中学到很多东西。这个网站的作者Allen D. Elster在开发这个网站之前其实已经分别在1994年和2001年出过 Questions and Answers in Magnetic Resonance Imaging 这本书的第一版和第二版，这个网站算是这本书的延伸。 这个网站是英文的，相信想要学习磁共振的同仁们都有能力阅读，但要是有对应中文版的可阅读，相信学习者会更开心（有怀疑精神和更高追求的除外&#94;_&#94;），学习效率也会更高一些。 本来我只想自己业余时间翻译着玩儿，将翻译后的内容记在 有道云笔记 上，与部门同事进行分享。但后来觉得用一个网站能够分享给更多对磁共振感兴趣的同仁，在 太然 的建议下使用 Pelican 这个静态网页生成工具在 GitHub 的project pages免费空间上建站，这应该是成本最小而且也显得比较专业的方式了。遂又花了一些时间了解 Pelican 和 reStructuredText ，学习在 GitHub 上建网站的过程。翻译为中文网站也算是我给自己留的深入了解磁共振物理的作业，借此翻译把磁共振知识进行比较系统地了解，也看看自己能不能坚持翻译完或者聚集志同道合的朋友一起翻译完。 翻译的过程我不想按照原网站的顺序逐个话题逐个问题翻译，而是先挑与我当前工作比较接近的话题先翻译，再翻译其他的话题。如果有比较心急的，就自己去读英文版，或者加入到我这个众筹项目中来，大家一起合作翻译(=&#94;_&#94;=)，求之不得。 这个网站目前还没有独立域名，留待以后申请也不迟。目前我个人对 reStructuredText 还不是很熟悉，排版还不是很美观，对 Pelican 的配置也还没很熟悉，网站的一些功能还没开发得很完善。好在 GitHub 可以提供非常好的版本控制，源文件也使用版本控制，改进后重新用 Pelican 生成页面再上传到 GitHub 就能重新发布。 有兴趣加入的朋友联系我。 email : shan.c.young@gmail.com","tags":"Misc","title":"欢迎来到磁共振知识问答中文版"}]}